{"id":"20220427537","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Biden says all light bulbs have to be more efficient — here's how LED can save hundreds of dollars over a bulb's lifetime","publishedDate":"2022-04-27T12:07:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Rachel Koning Beals ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  30% of light bulbs sold in the U.S. in 2020 were still incandescent or halogen incandescent bulbs ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  How many years and regulations does it take before we can screw in efficient light bulbs? ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  All light bulbs, even the iconic pear-shaped option, will have to meet new efficiency standards because of long-delayed federal rules finalized Tuesday. The mandate is expected to accelerate the already popular switchover to Earth-friendlier light emitting diode bulbs, or LEDs. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The pair of rules from the Department of Energy, which go into effect fully next year, follow much industry wrangling that had allowed older-style bulbs to share store shelves with LEDs for years. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Sales of LEDs have increased, but about 30% of light bulbs sold in the U.S. in 2020 were still incandescent or halogen incandescent bulbs. These styles turn most of the electrical energy they use into heat. The DOE says LEDs use at least 75% less power than incandescent bulbs and last up to 25 times longer. According to the department, installing LED bulbs in your most frequently used light fixtures can save hundreds of dollars over the lifetime of the bulbs. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Natural Resources Defense Council offered different figures: LEDs use one-sixth the amount of energy to deliver the same amount of light and last at least 10 times longer than incandescent bulbs. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Some of the discrepancy may lie with the fact that LEDs don't burn out with the pop of the filament like older bulbs do. LEDs grow weaker over time, and according to industry standards, their useful life is over when their brightness is diminished by 30%. Households may then replace them at varying times. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Many retailers have greatly expanded their LED options, but continue to stock the old designs as well, which historically had cost less. While Sweden-based Ikea switched to selling only LEDs in 2015, including in U.S. stores, nearly all major retailers are still selling incandescent or halogen incandescent bulbs, including Walmart(WMT), Amazon(AMZN), Home Depot(HD), Lowe's(LOW) and Target(TGT). ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Environmental groups welcomed the news. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Today's announcement is brilliant news for consumers and the climate,\" said Joe Vukovich, NRDC's energy efficiency advocate. \"Implementing these overdue and common-sense light bulb efficiency standards will result in annual utility bill savings of $3 billion for consumers [collectively] and prevent 222 million tons of dangerous, climate-warming carbon pollution over the next 30 years.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  That's equal to the annual greenhouse gas emissions of over 48 million vehicles, the NRDC said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  GHG emissions are largely responsible for the global warming that is accelerating incidents of cataclysmic weather, drought and other events that risk lives and economic loss. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Also read:8 ways to save lives and money for World Water Day -- we each waste up to 30 gallons a day ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The light bulb efficiency standard -- first addressed in a 2007 law -- had been set to take effect in 2020, but the Trump administration prevented its advancement after a trade group representing major light bulb manufacturers sued the government and urged it to not implement the standard. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The National Electrical Manufacturers Association has said that government requirements for greater bulb efficiency are unnecessary because the market is undertaking its own shift toward LEDs. Some states had already made their own moves. Similar light bulb efficiency standards went into effect in California and Nevada on Jan. 1, 2020, and 2021, respectively. Incandescents were phased out in Europe in mid-2018. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read:New York will restrict gas for cooking and heating, paving the way for more cities to follow ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  For some time, LEDs were much more expensive than their traditional rivals, which kept demand in check. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Now, the Energy Department has said that average cost of LED bulbs has dropped by nearly 90% since 2008. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"LEDs have become so inexpensive that there's no good reason for manufacturers to keep selling 19th-century technology that just isn't very good at turning electrical energy into light,\" said Steven Nadel, executive director of the American Council for an Energy-Efficient Economy (ACEEE). ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  But access to LEDs hasn't been uniform, with communities underserved by retail options finding less choice. In turn, minimal choice typically means shoppers pay up for the rarer LEDs relative to what's spent per bulb in more affluent shopping districts.  One Michigan study, from 2018, revealed that not only were LED bulbs less available in poorer areas, they also tended to cost on average $2.50 more per bulb than in wealthier communities. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Research has shown that lower-priced retailers such as dollar stores, including Dollar Tree(DLTR) and Dollar General(DG), as well as convenience stores, both as part of chains and those independently operated, still extensively stock their shelves with traditional or halogen incandescent bulbs. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  For some stakeholders, the regulatory change isn't coming fast enough. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The administration is allowing retailers to keep selling the inefficient bulbs well into 2023, but responsible chains ought to get them off their shelves as soon as possible and certainly by the end of this year, said Andrew deLaski, executive director of the Appliance Standards Awareness Project (ASAP). ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Each additional month that inefficient light bulbs are widely sold in the U.S. costs consumers nearly $300 million in extra energy bills and causes 800,000 tons of preventable carbon dioxide emissions over the short lifetime of the bulbs sold in that month, he added. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Many of these energy-guzzling bulbs have labels claiming they save energy, and it's infuriating. People and the climate have paid the price,\" said deLaski. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  One of the two rules finalized Tuesday requires that bulbs produce at least 45 lumens per watt. That's a measure of how much visible light is produced for a given amount of electrical power. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The second rule ensures that the new efficiency standard covers not only pear-shaped A-type bulbs, but several other common types, such as reflector bulbs used in recessed and track lighting, candle-shaped bulbs used in wall fixtures and other decorative light fixtures, and globe-shaped bulbs often installed in bathrooms. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  LEDs are now widely available for each of these bulb types, which collectively make up about 40% of the light bulbs in use, the ACEEE said. The Obama administration had determined that these types should be covered, but the Trump administration also undid that action. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Biden, meanwhile, has reverted to stricter regulations on appliances and select energy sources in addition to the bulb rules, but a key piece of his efforts, legislation to boost home solar, electric vehicles and more, is stalled in Congress. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Rachel Koning Beals ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  04-27-22 1307ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}