{"id":"20220222005496","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"BigBear.ai Expands Leadership Team to Strengthen Product Development and Research","publishedDate":"2022-02-22T07:00:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"BigBear.ai Expands Leadership Team to Strengthen Product Development and Research","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"i","contentObject":[{"type":"text","content":"Todd Hughes Appointed SVP of Technology and Research; Dan Jones Appointed SVP of Products","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nBigBear.ai (NYSE: BBAI), a leading provider of artificial intelligence (\"AI\"), machine learning, cloud-based big data analytics, and cyber engineering solutions, today announced two senior-level appointments to enhance the Company’s innovation and product development for public and private sector customers. ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Todd Hughes","gated":false}],"gated":false},{"type":"text","content":" has been appointed Senior Vice President of Technology and Research, and ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Dan Jones","gated":false}],"gated":false},{"type":"text","content":" has been appointed Senior Vice President of Products. Hughes and Jones will report to Brian Frutchey, Chief Technology Officer of BigBear.ai.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Our best-in-class research and product development teams are essential to our growth strategy, enabling us to meaningfully enhance the solutions we provide and accelerate our expansion into the commercial markets,” said Brian Frutchey, Chief Technology Officer of BigBear.ai. “Organizations across all sectors and industries are increasingly seeking ways to better manage and leverage their data to achieve competitive advantages, and we are confident that Todd and Dan’s extensive leadership and technology experience will help us deliver scalable AI-driven solutions to a growing customer base. We are thrilled to welcome them to the team.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“BigBear.ai’s innovative AI and machine learning technologies provide superior, actionable, data-driven advice that transforms the decision-making process,” said Hughes. “I am honored to join such an esteemed team, and I look forward to helping to chart the company’s path forward to ensure we are meeting the growing and evolving needs of our customers.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Demand for AI and ML solutions is expected to explode over the next few years, presenting BigBear.ai with a huge growth opportunity,” said Jones. “Building, scaling, and developing a SaaS product offering that harnesses the power of BigBear.ai’s transformative solutions and differentiates us in the market will be absolutely critical to the Company’s success, and I’m thrilled to have the opportunity to be a part of this critical effort.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAs SVP of Technology and Research, Hughes will manage BigBear.ai’s research team, driving innovations that improve the company’s existing products and inform the development of new ones. Hughes brings 20 years of experience from both the AI and Government sectors, most recently as Technical Director, Strategic Projects and Initiatives at CACI International, a $5.7 billion enterprise technology company. Prior to that, Hughes worked in senior research, technology and engineering roles at Next Century Corporation, DARPA, Lockheed Martin and Cycorp. Hughes received an undergraduate degree at SUNY Geneseo and PhD in Philosophy from the University of Wisconsin.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAs SVP of Products, Jones will lead all aspects of the development of BigBear.ai’s next-generation AI-driven products, including vision, design, development and operations. Jones has more than 20 years of product management experience, having most recently served as Senior Vice President, Products at Skytap, where he was responsible for product management, user experience and product documentation. He previously held senior product and program management roles at Nordstrom, Microsoft, IBM and HP. Jones received his Bachelor of Science at California Polytechnic University and MBA from Santa Clara University.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About BigBear.ai","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nA leader in decision dominance for more than 20 years, BigBear.ai operationalizes artificial intelligence and machine learning at scale through its end-to-end data analytics platform. The company uses its proprietary AI/ML technology to support its customers' decision-making processes and deliver practical solutions that work in complex, realistic, and imperfect data environments. In addition, BigBear.ai's composable AI-powered platform solutions work together as often as they stand alone: Observe (data ingestion and conflation), Orient (composable machine learning at scale), and Dominate (visual anticipatory intelligence and optimization).\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nBigBear.ai's customers, which include the U.S. Intelligence Community, Department of Defense, the U.S. Federal Government, as well as customers in the commercial sector, rely on BigBear.ai's high-value software products and technology to analyze information, identify and manage risk, and support mission-critical decision making. Headquartered in Columbia, Maryland, BigBear.ai has additional locations in Virginia, Massachusetts, Michigan, and California. For more information, please visit: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fbigbear.ai%2F&esheet=52582928&newsitemid=20220222005496&lan=en-US&anchor=http%3A%2F%2Fbigbear.ai%2F&index=1&md5=fa0fa36e4cb8a536db85ee2e5cb18bba","contentObject":[{"type":"text","content":"http://bigbear.ai/","gated":false}],"gated":false},{"type":"text","content":" and follow BigBear.ai on Twitter: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fbigbearai&esheet=52582928&newsitemid=20220222005496&lan=en-US&anchor=%40BigBearai&index=2&md5=226d62670d76664843a5a0eed8960a5e","contentObject":[{"type":"text","content":"@BigBearai","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220222005496r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"For BigBear.ai: \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Reevemark\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Paul Caminiti/Delia Cannan/Pam Greene\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"212-433-4600\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:bigbear.ai@reevemark.com","contentObject":[{"type":"text","content":"bigbear.ai@reevemark.com \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"OR\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:investors@bigbear.ai","contentObject":[{"type":"text","content":"investors@bigbear.ai","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220222005496/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220222005496/en/","gated":false}],"gated":false}],"gated":false}]}