{"id":"2021091474","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Biden to announce new pandemic steps ahead of U.N. meeting Tuesday, as global COVID-19 case tally nears 225 million","publishedDate":"2021-09-14T06:28:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Surgeon General Vivek Murthy defends Biden's vaccine requirements as both legal and effective ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The global tally of confirmed cases of the coronavirus-borne illness COVID-19 climbed closer to 225 million on Monday, with the U.S. leading by cases and deaths, and the U.S. surgeon general said President Joe Biden's newly announced vaccine requirements are legal and effective. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Dr. Vivek Murthy appeared on several Sunday interview shows to push Biden's program and said that the federal government has the legal authority to mandate vaccines and that such requirements are an effective way to persuade people to get their shots and eventually end the pandemic. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"These kinds of requirements actually work to improve our vaccination rates,\" Murthy said on ABC's \"This Week,\" citing as an example Tyson Foods (TSN), the meat processor that has seen its employee vaccination rate climb to 70% from 45% after requiring shots for workers in August. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See:Biden on prospect of legal challenges to his vaccine mandate from Republican governors: 'Have at it' ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"And they're not even at their deadline yet,\" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The government has been pushing hard to get unvaccinated Americans to roll up their sleeves, as that group accounts for almost all of the new cases, hospitalizations and deaths in the U.S. right now. The U.S. is averaging 145,724 new cases a day, according to a New York Times tracker, a figure that, while elevated, is down 7% from two weeks ago. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Deaths at an average of 1,648 a day are up 27% from two weeks ago and remain at their highest levels since March. Hospitalizations are averaging 100,382 a day, down 1% from two weeks ago but also the highest since winter. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Dispatches from a Pandemic: COVID-19 long haulers are frustrated with unvaccinated friends, worried about reinfection, and mired in medical bills ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Deaths and hospitalization rates are highest in states with low vaccination rates, which include North Dakota, Ohio and Maine. Experts have lamented such preventable deaths, given that vaccines have proven to be highly effective at preventing serious illness and death. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read now: Unvaccinated are 11 times likelier to die of COVID-19, says CDC ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Centers for Disease Control and Prevention's vaccine tracker is showing that 178.7 million Americans are fully vaccinated, equal to 53.8% of the total population. Some 209.4 million have received at least one dose of a two-shot vaccine, equal to 63.1% of the overall population. In Europe more than 70% of the adult population is fully vaccinated. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Murthy said Biden would also announce new steps in the fight against the virus ahead of the United Nations General Assembly, which starts Tuesday. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See now:Biden on prospect of legal challenges to his vaccine mandate from Republican governors: 'Have at it' ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In the meantime, schools in New York City, the nation's biggest school district, reopened on Monday after 18 months of mostly remote learning. For now, children below the age of 12 are not eligible for vaccination as drug companies continue trials, meaning schools are reliant on strict safety protocols. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Elsewhere, the Chinese province of Fujian reported 22 new COVID cases on Sunday, the most since Aug. 14, the Times reported. The cases were all of the highly transmissible delta variant, which is dominant across the globe. The latest outbreak is understood to have been imported by an adult who returning from Singapore. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In the U.K., children aged 12 to 15 will be allowed vaccines, after the country's four chief medical officers agreed to that decision, the Guardian reported. A first shot will be offered immediately with a second one likely in the spring school term or later. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Israel, meanwhile, is considering a fourth round of coronavirus vaccination, Bloomberg News reported, citing an interview that a health ministry official gave to a local radio station. \"We don't know when it will happen; I hope very much that it won't be within six months, like this time, and that the third dose will last for longer,\" Health Ministry Director General Nachman Ash said in an interview with Radio 103FM, the report said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  U.S.-listed shares of France's Valneva  dived 35% after the company said the U.K. has terminated a coronavirus vaccine supply deal. Valneva said it is continuing its VLA2001 development plan and \"strenuously\" denies it is in breach of its obligations under the supply agreement. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Phase 3 results are expected to be available early in the fourth quarter, and the company believes that initial approval for VLA2001 could be granted in late 2021, it said. It said it will increase its efforts with other potential customers to ensure that its inactivated vaccine can be used in the fight against the pandemic. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See now: Number of children and teens with COVID-19 exceeds 250,000 for first time since start of pandemic, as mask and vaccination fights continue ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Latest tallies ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The global tally for the coronavirus-borne illness climbed above 224.7 million on Monday, while the death toll rose to 4.63 million, according to data aggregated by Johns Hopkins University. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The U.S. continues to lead the world with a total of 40.9 million cases and 660,412 deaths. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  India is second by cases after the U.S. at 33.3 million and has suffered 442,874 deaths. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Brazil has second highest death toll at 585,851 and 20.9 million cases. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In Europe, Russia has had the most reported fatalities at 190,031, followed by the U.K. at 134,586. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  China, where the virus was first discovered late in 2019, has had 107,457 confirmed cases and 4,848 deaths, according to its official numbers, which are widely held to be massively underreported. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  09-14-21 0728ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2021 Dow Jones & Company, Inc.","gated":false}]}