{"id":"20211214149","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"NuScale to go public via merger with SPAC Spring Valley Acquisition in deal valued at about $1.9 billion","publishedDate":"2021-12-14T07:16:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  NuScale Power LLC, a provider of small modular nuclear reactor technology, is going public via a merger with special-purpose acquisition corporation Spring Valley Acquisition Corp. (SV), in a deal with a pro forma enterprise value of about $1.9 billion, the companies said in a joint statement Tuesday. The combined company will be renamed NuScale Power Corp., and will list under the ticker \"SMR.\" It will have gross proceeds of up to $413 million, including a private investment in public equity, or PIPE, of $181 million backed by investors including Samsung C&T Corporation, DS Private Equity and Segra Capital Management, with participation by Spring Valley's sponsor, Pearl Energy. \"NuScale's SMR technology is safe, reliable and scalable and the first and       only to receive Standard Design Approval from the U.S. Nuclear Regulatory       Commission,\" said the statement. Fluor (FLR), NuScale's majority shareholder, will own about 60% of the combined company and remain a partner to NuScale. The company's power plant design can generation up to 924 megawatts a day of electricity. The company's leadership team will remain in place. The deal is expected to close in the first half of 2022. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  12-14-21 0816ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2021 Dow Jones & Company, Inc.","gated":false}]}