{"id":"20220428005410","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Kelly-Moore Paints Amps Up Convenience with Same-Day Paint Delivery Powered by Walmart GoLocal","publishedDate":"2022-04-28T08:00:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Kelly-Moore Paints Amps Up Convenience with Same-Day Paint Delivery Powered by Walmart GoLocal","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"i","contentObject":[{"type":"text","content":"The new delivery service will enable the paint manufacturer to grow delivery capabilities across the western region of the U.S.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nKelly-Moore Paints, one of the largest employee-owned paint companies in the United States, will now offer professional painting contractors, home renovators and B2B clients same- and next-day delivery of Kelly-Moore paint and paint products from select Kelly-Moore stores across California, Nevada, Oklahoma and Texas, with the goal of expanding to more locations in the coming months. The new, convenient delivery option is made possible by Walmart GoLocal, Walmart’s white-labeled delivery as a service business that provides businesses of all sizes with low-cost delivery solutions.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release features multimedia. View the full release here: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220428005410/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220428005410/en/","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“As interest in home building and renovation continues to rise, so does the need for our merchandise and the customer desire for receiving affordable, high-quality paint and paint products quickly,” said Steve DeVoe, CEO, Kelly-Moore Paints. “We knew we had to offer fast, dependable delivery to remain competitive and Walmart GoLocal was the logical provider to meet our needs given their reach, pricing and capabilities.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFor more than 75 years, Kelly-Moore Paints, which operates a state-of-the-art manufacturing facility that produces some of the most technologically advanced offerings in the space, has met the evolving needs of its customers and clients by providing industry-leading items at competitive prices. Leveraging Walmart GoLocal will allow Kelly-Moore Paints’ customers to receive products like interior and exterior paints, primers, stains, paint brushes and rollers, tape and more, faster on the day of the ordering.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“One of Walmart GoLocal’s priorities is to support mid-sized and regional businesses with low-cost delivery capabilities, and we’re excited to add Kelly-Moore Paints to the growing list of Walmart GoLocal clients,” said Harsit Patel, General Manager of Walmart GoLocal. “With the continued construction boom sweeping the country, our collaboration with Kelly-Moore Paints allows them to tap further into the paint and design community, where we can collectively provide expanded customer experiences and exceptional client service.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nWalmart GoLocal is a white-label delivery service that launched last summer, offering businesses of all sizes the ability to leverage Walmart’s delivery infrastructure, world class operations and economies of scale to reach tens of millions of households at competitive pricing. This includes delivery on a range of assortment, including those with size and complex requirements, as well as the flexibility to meet varying timelines such as express, same-day and next-day. Kelly-Moore joins Walmart GoLocal’s growing list of clients which includes a diverse set of businesses, from enterprises to local merchants.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Kelly-Moore Paints","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nKelly-Moore Paints provides high quality, innovative products with exceptional service at a fair value. In 1946, William H. Kelly and William E. Moore recognized the unique needs of professional painting contractors for top-quality paint products and knowledgeable, efficient service at a fair price. This philosophy has allowed Kelly-Moore to grow to one of the largest employee-owned paint companies in the United States. Kelly-Moore is recognized throughout the paint industry as “The Painter’s Paint Store!” Made in America Since 1946, Kelly-Moore’s state-of-the-art manufacturing facility in Hurst, Texas, produces some of the most technologically advanced paint products and sets the industry standard for new product development and quality control. Established as an Employee Stock Ownership Program (ESOP) in 1998, Kelly-Moore Paints ensures a tradition of providing only the highest level of service to its customers. Each employee-owner is committed to offering the best paint products along with exceptional customer service every day.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Walmart","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nWalmart Inc. (NYSE: WMT) helps people around the world save money and live better - anytime and anywhere - in retail stores, online, and through their mobile devices. Each week, approximately 230 million customers and members visit more than 10,500 stores and clubs under 46 banners in 24 countries and eCommerce websites. With fiscal year 2022 revenue of $573 billion, Walmart employs approximately 2.3 million associates worldwide. Walmart continues to be a leader in sustainability, corporate philanthropy and employment opportunity. Additional information about Walmart can be found by visiting ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fcorporate.walmart.com&esheet=52700343&newsitemid=20220428005410&lan=en-US&anchor=https%3A%2F%2Fcorporate.walmart.com&index=1&md5=4588c61175b3a160ebcf42a8847f789b","contentObject":[{"type":"text","content":"https://corporate.walmart.com","gated":false}],"gated":false},{"type":"text","content":", on Facebook at ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ffacebook.com%2Fwalmart&esheet=52700343&newsitemid=20220428005410&lan=en-US&anchor=https%3A%2F%2Ffacebook.com%2Fwalmart&index=2&md5=ebcf15b2fcbb79d81710a7e31d6cd92c","contentObject":[{"type":"text","content":"https://facebook.com/walmart","gated":false}],"gated":false},{"type":"text","content":" and on Twitter at ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2Fwalmart&esheet=52700343&newsitemid=20220428005410&lan=en-US&anchor=https%3A%2F%2Ftwitter.com%2Fwalmart&index=3&md5=1bada8ee412f124262de7ff9ba212f3f","contentObject":[{"type":"text","content":"https://twitter.com/walmart","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220428005410r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nWalmart Media Relations\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fcorporate.walmart.com%2Fnewsroom%2Fcontact-media-relations&esheet=52700343&newsitemid=20220428005410&lan=en-US&anchor=news.walmart.com%2Freporter&index=4&md5=2a8f28be79b9321665a8a440ba6a2a68","contentObject":[{"type":"text","content":"news.walmart.com/reporter","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220428005410/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220428005410/en/","gated":false}],"gated":false}],"gated":false}]}