{"id":"20220516005826","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Annaly Capital Management, Inc. Announces Public Offering of Common Stock","publishedDate":"2022-05-16T15:05:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Annaly Capital Management, Inc. Announces Public Offering of Common Stock","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAnnaly Capital Management, Inc. (NYSE: NLY) (the “Company” or “Annaly”) today announced that it intends to make a public offering of 100,000,000 shares of its common stock.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIn connection with the offering, Annaly intends to grant the underwriters a thirty-day option to purchase up to an additional 15,000,000 shares of common stock.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAnnaly intends to use the net proceeds of this offering to acquire targeted assets under the Company’s capital allocation policy, which may include further diversification of its investments in Agency assets as well as residential credit assets. These investments include, without limitation, Agency MBS pools, to-be-announced forward contracts, mortgage servicing rights and residential credit assets (including residential mortgage loans). Annaly also intends to use the net proceeds for general corporate purposes, including, without limitation, to pay down obligations and other working capital items.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nGoldman Sachs & Co. LLC, Barclays, BofA Securities, J.P. Morgan, RBC Capital Markets, UBS Investment Bank and Wells Fargo Securities are acting as joint book-running managers and Loop Capital Markets and Roberts & Ryan are acting as co-managers for the offering.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe offering is being conducted pursuant to the Company’s currently effective shelf registration statement, which was previously filed with the Securities and Exchange Commission (the “SEC”). A preliminary prospectus supplement related to the offering and the accompanying prospectus can be obtained from the SEC. Before you invest in the offering, you should read the prospectus supplement and the accompanying prospectus and other documents Annaly has filed with the SEC for more complete information about Annaly and the offering. You may obtain these documents for free by visiting EDGAR on the SEC website at ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=52721133&newsitemid=20220516005826&lan=en-US&anchor=http%3A%2F%2Fwww.sec.gov&index=1&md5=a56efce72a553114bcd68a6122cb80f5","contentObject":[{"type":"text","content":"http://www.sec.gov","gated":false}],"gated":false},{"type":"text","content":". Alternatively, copies of these documents may be obtained by contacting:\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nGoldman Sachs & Co. LLC\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Attention: Prospectus Department\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"200 West Street\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"New York, NY 10282\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Telephone: (866) 471-2526\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Or by email: ","gated":false},{"type":"a","href":"mailto:prospectus-ny@ny.email.gs.com","contentObject":[{"type":"text","content":"prospectus-ny@ny.email.gs.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release does not constitute an offer to sell or the solicitation of an offer to buy shares of common stock, nor shall there be any sale of these securities in any jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such jurisdiction.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Annaly","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAnnaly is a leading diversified capital manager with investment strategies across mortgage finance. Annaly’s principal business objective is to generate net income for distribution to its stockholders and to optimize its returns through prudent management of its diversified investment strategies. Annaly is internally managed and has elected to be taxed as a real estate investment trust, or REIT, for federal income tax purposes.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis news release and our public documents to which we refer contain or incorporate by reference certain forward-looking statements which are based on various assumptions (some of which are beyond our control) and may be identified by reference to a future period or periods or by the use of forward-looking terminology, such as “may,” “will,” “believe,” “expect,” “anticipate,” “continue,” or similar terms or variations on those terms or the negative of those terms. Actual results could differ materially from those set forth in forward-looking statements due to a variety of factors, including, but not limited to, risks and uncertainties related to the COVID-19 pandemic, including as related to adverse economic conditions on real estate-related assets and financing conditions (and our outlook for our business in light of these conditions, which is uncertain); changes in interest rates; changes in the yield curve; changes in prepayment rates; the availability of mortgage-backed securities and other securities for purchase; the availability of financing and, if available, the terms of any financing; changes in the market value of our assets; changes in business conditions and the general economy; operational risks or risk management failures by us or critical third parties, including cybersecurity incidents; our ability to grow our residential credit business; the sale of our middle market lending business; credit risks related to our investments in credit risk transfer securities, residential mortgage-backed securities and related residential mortgage credit assets and corporate debt; risks related to investments in mortgage servicing rights; our ability to consummate any contemplated investment opportunities; changes in government regulations or policy affecting our business; our ability to maintain our qualification as a REIT for U.S. federal income tax purposes; and our ability to maintain our exemption from registration under the Investment Company Act. For a discussion of the risks and uncertainties which could cause actual results to differ from those contained in the forward-looking statements, see “Risk Factors” in our most recent Annual Report on Form 10-K and any subsequent Quarterly Reports on Form 10-Q. The Company does not undertake, and specifically disclaims any obligation, to publicly release the result of any revisions which may be made to any forward-looking statements to reflect the occurrence of anticipated or unanticipated events or circumstances after the date of such statements, except as required by law.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220516005826r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Annaly Investor Contact","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAnnaly Capital Management, Inc.\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Investor Relations\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"1-888-8Annaly\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:investor@annaly.com","contentObject":[{"type":"text","content":"investor@annaly.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220516005826/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220516005826/en/","gated":false}],"gated":false}],"gated":false}]}