{"id":"20211229401","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Some ETFs mix investing with charities — should you?","publishedDate":"2021-12-29T11:22:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Debbie Carlson ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  These impact funds aim to make ESG investing more personal ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  As investors increasingly seek to do good with their money, some companies behind exchange-traded funds are adding a twist: a direct connection to a charity such as the American Heart Association, the Susan G. Komen foundation or the NAACP. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The ETF issuers hope to capture a segment of the growing popularity of environmental, social and governance investing, where investors seek to align their personal values with their pocketbooks. In 2020, US SIF Foundation, which measures this type of investing, said 33% of U.S. assets under professional management use ESG criteria when investing. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  That poses a question for investors: Does marrying philanthropy and investment blur the line between the two goals? ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Fund managers behind these so-called impact funds pledge to give funding to the nonprofits through outright donations or part of the fund's expense ratio. The funds, which reference the cause in the name or ticker symbol, are generally track custom indexes, one reason why they are pricier than other index funds focused on the sector or theme. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The funds not only seek to own companies that positively reflect the organizations' mission using ESG metrics, but by also giving money straight to the nonprofits, they strive to have a direct impact on those causes. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Investors, however, should focus on the fund's investment strategy first and the philanthropic goal second, said Jon Hale, global head of sustainability research at Morningstar. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  While it's easy to look dismiss these types of funds as marketing gimmick, investors are looking for ESG products that they can really embrace, he added. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Brian Kelleher, chief revenue officer for Simplify Asset Management, agreed. \"There's no reason to invest in a mediocre product in the hopes of doing good. People are savvy investors; they want to find products that do well so they can do good,\" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The funds and their charities ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The first impact funds were launched three years ago, when nonprofit fund company Impact Shares, launched the NAACP Minority Empowerment ETF (NACP) and YWCA Women's Empowerment ETF (WOMN). At least five more were created this year, and another is expected in January. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  ETF issuer IndexIQ teamed up with New York Life Investments to launch four thematic ETFs: heart health through the IQ Healthy Hearts ETF (HART) with the American Heart Association; cleaner oceans through the IQ Clean Oceans ETF (OCEN) in conjunction with Oceana; workplace gender equality through the IQ Engender Equality ETF (EQUL) benefiting Girls Who Code; and the transition to environmentally friendly transportation, IQ Cleaner Transport (CLNR), supporting the National Wildlife Federation. All are passive funds that track custom indexes. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  ETF issuer Simplify launched its multi-cap, actively managed Simplify Health Care ETF (PINK) during October's breast cancer awareness month, to benefit the Susan G. Komen foundation. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  There's another ETF in filing and due to launch in January called the RN Volition America Patriot ETF, an actively managed fund that will give some of its fees to scholarships for military families through an organization called Folds of Honor. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Wendy Wong, head of sustainability investment partnerships with New York Life Investments, said the firm started with an investment thesis for the four ETFs and then worked with the nonprofit organizations to create the criteria for each custom index. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We look at the macro level, where do we have conviction, where do we think the trends are going to be and what type of companies are going to benefit from those trends,\" she said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Become a smarter investor. Read the daily Need to Know newsletter ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Sign up for Need to Know ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  New York Life is giving 0.10 percentage point of each ETF's 0.45% annual expense fee to its aligned organization. While the ETFs gather assets, it is making an undisclosed \"substantial donation\" to each group. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  She says New York Life worked with the four nonprofits on how the groups would use the contribution to fund specific programs that are related to the ETF strategy. For example, the Healthy Hearts ETF supports the American Heart Association's Social Impact Fund to address cardiovascular disease and ways people can develop healthy eating and fitness habits. Stocks in the custom-made IQ Candriam Healthy Hearts Index include Apple (AAPL), NIKE (NKE) and Merck (MRK). ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Simplify Health Care ETF began with an internal discussion around ESG and how the firm might approach socially responsible investing since most of the firm \"had a cynical view of ESG as it is constructed now,\" Kelleher said. By creating an ETF where the fees go to an organization, it offers a direct link to the potential impact. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  They picked breast cancer research as Simplify co-founder Paul Kim is a board member of the Komen foundation and it's a cause close to many of the firm's employees, he said. They decided to do an actively managed healthcare fund, hiring Michael Taylor, who ran healthcare equity portfolios at leading hedge funds for more than 20 years, as lead portfolio manager. The fund focuses on biotechnology, med tech and other healthcare sectors; its largest holdings include UnitedHealth Group (UNH), Pfizer (PFE) and Abbott Laboratories (ABT). ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The expense ratio is 0.50%. Kelleher said most of that fee goes to the foundation, with less than 10 basis points used to cover expenses. Simplify also plans to make a one-time $100,000 donation to the foundation. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Indeed, all of the impact funds of these ETFs have significantly higher fees than plain vanilla index funds such as the SPDR S&P 500 ETF Trust (SPY), which has an expense ratio of 0.09%, or the Health Care Select Sector SPDR Fund (XLV) at 0.12%. However, the funds are cheaper than the average cost of a thematic ETF (around 0.62%), and the 0.69% average cost for actively managed ETFs, according to ETF.com. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Judging impact ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  It's too early to look at the performance of funds that are only a few months old. However, the large-cap Impact Shares NAACP Minority Empowerment and Impact Shares YWCA Women's Empowerment, which use criteria like diversity and anti-discrimination policies in building the indexes, have three-year annualized returns of 21.8% and 24.25%, respectively, versus the S&P's  three-year annualized return of 20.5%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Apple (AAPL) is NACP's biggest holding, while Nvidia (NVDA) is WOMN's biggest holding. The NAACP fund's expense ratio is 0.49% and the YWCA expense ratio is 0.75%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Neither fund has passed on any money to their affiliated organization because they aren't yet profitable. In this case, that means amassing between $50 million and $100 million, said Ethan Powell, the firm's founder. The NAACP and YWCA ETFs each have around $38 million. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  But they are having an impact in other ways. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  After George Floyd's murder in 2020, for example, a number of blue-chip companies made large donations to the NAACP, Powell said. \"But the NAACP would go back and say, 'Thanks for the check. You know, you're not in our fund because your competitor does X, Y, and Z better than you do. So if you really want to be on the right side of history, you need to change your corporate ethos. And you can start by changing these relatively simple policies and procedures and ratios,\" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Debbie Carlson is a MarketWatch columnist. Follow her on Twitter @DebbieCarlson1. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Debbie Carlson ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  12-29-21 1222ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2021 Dow Jones & Company, Inc.","gated":false}]}