{"id":"20211217366","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"New COVID-19 booster candidates are still being developed as omicron spreads","publishedDate":"2021-12-17T08:40:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Jaimy Lee ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  There are several experimental COVID-19 boosters still in development ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The rapid spread of the omicron variant is the latest reminder that COVID-19 boosters may be necessary both now and in the future. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Valneva  said Thursday its COVID-19 booster candidate increased antibody levels among participants who received the company's still-investigational COVID-19 vaccine in clinical trials. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  GeoVax Inc. (GOVX) on Wednesday provided an update about its COVID-19 booster candidate, telling investors that the company began dosing participants in a Phase 2 clinical trial at City of Hope hospital in Southern California. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  GlaxoSmithKline (GSK.LN) and Sanofi (SAN.FR) also announced news on Wednesday, saying that their experimental booster raises antibody levels, and they expect to have full data from the Phase 3 trial in the first quarter of next year. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The expectations now have shifted to assuming [a] higher chance of ongoing boosting,\" Bernstein analyst Ronny Gal said in an email. \"This makes the business more interesting for pharma companies who would otherwise [have] 'given up' on participating in the epidemic stage.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  There are three authorized or approved COVID-19 vaccines and boosters in the U.S. But there are also several companies still developing new vaccines and boosters, including GeoVax, Sanofi/GSK, CureVac CVAC, which is developing a \"second-generation\" shot with GSK, and Novavax Inc. NVAX, which is working on a primary series of shots and a booster. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"It's clear that boosters will become most of the market in the future after the huge global bolus of priming vaccinations is mostly completed (particularly in developed countries),\" SVB Leerink's Geoffrey Porges told MarketWatch. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Wall Street has already taken the view that COVID-19 boosters are part of the overall vaccination package and will be a necessary tool to prevent infections and disease going forward. Now that people in the U.S. can choose what kind of booster they want, there is a huge potential market, especially if and when the virus becomes endemic and COVID-19 boosting becomes as routine as a flu shot. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The various COVID boosting trials that have been announced have suggested that nonstandard boosting strategies might be preferable,\" Porges added. \"This has opened up the market for new entrants such as Sanofi, hence the importance of this trial and the announcement.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  U.S. regulators began allowing people to mix and match vaccines in October, and they authorized boosters for all adults in mid-November, just weeks before omicron was declared a variant of concern. Just last week, the Food and Drug Administration authorized BioNTech SE (BNTX) and Pfizer Inc.'s (PFE) booster for 16 and 17 year olds, the first booster shot to be made available to teens of any age. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Federal health officials are urging anyone who qualifies--primarily adults--to get boosted even though boosters are not required to be considered \"fully vaccinated\" in the U.S. About 55 million people in the U.S have received a booster, and approximately 14 million of those shots were recorded in the last two weeks, White House officials said Wednesday. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The big question right now is how effective the available vaccines and boosters are against omicron. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The new variant is thought to be more transmissible than the delta variant, which is currently the world's most dominant strain. It's unclear at this time whether omicron causes more severe disease. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Omicron has been detected in 36 states and more than 75 countries, and it is thought to make up 2.9% of all U.S. cases and up to 13% of new cases in New Jersey and New York, according to the Centers for Disease Control and Prevention. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Moderna Inc. (MRNA) and Pfizer have already said they are working on omicron-specific boosters, but the soonest either can deliver one to the FDA is likely in March. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Intuitively, you'd suspect an omicron-specific vaccine to be an even better booster option for right now,\" Raymond James analyst Steven Seedhouse told MarketWatch in an email. \"The industry is wrestling with the obvious question--what if it's not omicron but something else by then?\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Dr. Anthony Fauci, the president's chief medical advisor, reiterated his belief that there's no need for new boosters designed specifically to combat omicron. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Our booster vaccine regimens work against omicron,\" he said during a White House briefing on Wednesday. \"At this point there is no need for a variant-specific booster.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Preliminary research indicates that boosters may strengthen the immune response to omicron. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  A report out of the U.K. this week shows that the AstraZeneca (AZN.LN) and BioNTech/Pfizer vaccines are less effective against omicron than delta when it comes to preventing symptomatic infection. However, those vaccines were still around 75% effective at preventing symptomatic infections. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  There is also early data from the National Institutes of Health, cited by Fauci and published Wednesday as a preprint, that found that three doses of Moderna's vaccine is more effective against omicron than two doses. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n   \"The interest and justification for seasonal boosters has been apparent for a while, but omicron serves as a much-needed reminder that endemic COVID is likely inevitable,\" Seedhouse said. \"Do we envision a future where we just 'let it rip' and rely on whatever immunity has been established until now? Or do we do what we can vis-à-vis seasonal boosters and treat this like our annual flu shot? I suspect the world will trend towards the latter.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Jaimy Lee ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  12-17-21 0940ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2021 Dow Jones & Company, Inc.","gated":false}]}