{"id":"20220516268","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Has the junk-bond market hit bottom? Liquidity issues may be up next, warns this industry veteran","publishedDate":"2022-05-16T11:22:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Joy Wiltermuth ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  When 'liquidity is the issue, everything is untethered,\" Bagaria said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Don't call it a dash-for-trash quite yet. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  U.S corporate bonds with riskier high-yield or \"junk\" credit ratings finally might look like a buy, after a brutal start to 2022 sparked by central bankers looking to end an era of easy-money. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Prices for junk bonds have tumbled and yields have popped to two-year highs of about 7.5%, according to the ICE  BofA US high yield index. That's likely a comfort to those waiting for froth to exit the more speculative corners of markets. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  But Rajay Bagaria, chief investment officer at Wasserstein Debt Opportunities, still sees reasons why investors should remain cautious. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"There is a scenario where it all looks pretty cheap right now,\" Bagaria, a leveraged finance veteran, said by phone Friday. \"There is this possibility of a soft landing. And I think if that happens, you'll look back and you'll say: a lot of high yield's priced down 15 to 20 points in four months. That doesn't happen very often.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  On the flip side, however, he thinks investors could be downplaying several key factors, including the effects of sharp fund outflows this year (see chart), with high-yield getting hit the hardest in terms of outflows based on assets under management. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  There also are the risks of continued volatility in interest rates -- a key driver of negative first-quarter total returns -- and investors taking \"false comfort\" in some economic indicators, such as the roughly 10% drop in copperHG00 prices from a pandemic peak, a popular predictor of economic activity. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Bagaria worries about a boom in China's economy that could keep commodity prices, inflation and interest rates high as that country reopens after the latest COVID lockdowns ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The key 10-year U.S. Treasury yield  surged to a multiyear high of 3.12% in May from a low around 1.63% in January. Total returns for the high-yield index were down 10% on the year, according to BofA Global, and on pace for its second-worst yearly loss ever, eclipsed only by its 26% loss in 2008. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Federal Reserve Chairman Jerome Powell this week said the central bank's plan to achieve a soft landing for the economy, while tamping down high inflation, isn't entirely in its own hands, referring to the geopolitical risks of the war in Ukraine and COVID lockdowns in China, in an interview with Marketplace. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Bagaria sees a chance of the Fed \"inducing a pretty hard recession,\" if the central bank significantly raises interest rates in its quest for price stability. He also said cracks already have begun to appear in high yield debt, in the form of tumbling bond prices, following several companies reporting disappointing earnings. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Until the last week or two, we felt like this was a normal, functioning market, the liquidity premium was still low,\" Bagaria said. \"You are starting to see now gap-downs in price, because people just want to get out of stuff.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  It isn't only the debt of once buzzy companies like Carvana Co. (CVNA) or Coinbase Global Inc. that have taken a beating. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See: Carvana, Coinbase junk bonds tumble Wednesday as layoffs, losses hit prices ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Party City Holdco Inc. (PRTY)reported an earnings miss this week, and its stock tumbled and its B rated bonds due February 2026 fell to about $74 on Friday, from $96 in March, according to Bondcliq. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The fact that  you are seeing real capitulation in high yield, on specific situations, suggests to us that liquidity is becoming the issue,\" Bagaria said. \"And when liquidity is the issue, everything is untethered.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Joy Wiltermuth ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-16-22 1222ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}