{"id":"20220311ph89826","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"TRIUMPH ADOPTS TAX BENEFITS PRESERVATION PLAN TO PROTECT VALUABLE TAX ASSETS","publishedDate":"2022-03-11T15:48:00-06:00","body":[{"type":"text","content":"TRIUMPH ADOPTS TAX BENEFITS PRESERVATION PLAN TO PROTECT VALUABLE TAX ASSETS\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"TRIUMPH ADOPTS TAX BENEFITS PRESERVATION PLAN TO PROTECT VALUABLE TAX ASSETS","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"BERWYN, Pa., March 11, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"BERWYN, Pa., March 11, 2022 /PRNewswire/ -- Triumph Group, Inc. (\"Triumph\") [NYSE: TGI] today announced that in light of the expiration of its current rights plan, its Board of Directors has adopted a new tax benefits preservation plan (the \"Plan\") designed to preserve Triumph's ability to utilize its net operating loss carryforwards and other tax attributes (collectively, \"Tax Benefits\"). The Plan is similar to the tax benefits preservation plan of Triumph dated as of March 13, 2019 (the \"Expiring Plan\") and plans adopted by other public companies with significant Tax Benefits, and is designed to continue to preserve the benefit of Triumph's Tax Benefits. The Company intends to submit the Plan for stockholder approval at the Company's next annual meeting of stockholders.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"In connection with the expiration of the Expiring Plan, the Company will take routine steps to delist each right under the Expiring Plan from trading on the New York Stock Exchange. These actions are administrative in nature and will have no effect on the Company's common stock, which continues to be listed on the New York Stock Exchange.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Triumph estimates that it will have Tax Benefits, including net operating losses, capital losses, research tax credits, foreign tax credits and disallowed business interest expense carryovers, approximating $326.4 million as of March 31, 2022. The purpose of the Plan is to preserve Triumph's ability to use its Tax Benefits, which would be substantially limited if Triumph experienced an \"ownership change\" as defined under Section 382 of the Internal Revenue Code. The adoption of the Plan is intended to ensure that the Company will be able to utilize its Tax Benefits.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Details of the Plan will be communicated in a current report on Form 8-K to be filed with the U.S. Securities and Exchange Commission. A copy of the Plan can also be found on Triumph's website at ","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3470818-1&h=6130868&u=http%3A%2F%2Fwww.triumphgroup.com%2F&a=http%3A%2F%2Fwww.triumphgroup.com","contentObject":[{"type":"text","content":"http://www.triumphgroup.com","gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"About Triumph Group:","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Triumph Group, Inc., headquartered in Berwyn, Pennsylvania, designs, engineers, manufactures, repairs and overhauls a broad portfolio of aerospace and defense systems, components and structures. The company serves the global aviation industry, including original equipment manufacturers and the full spectrum of military and commercial aircraft operators.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"More information about Triumph can be found on the company's website at ","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3470818-1&h=6130868&u=http%3A%2F%2Fwww.triumphgroup.com%2F&a=http%3A%2F%2Fwww.triumphgroup.com","contentObject":[{"type":"text","content":"http://www.triumphgroup.com","gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Cautionary Statement Regarding Forward Looking Statements:","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"i","contentObject":[{"type":"text","content":"Statements in this release that are not historical, are forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Words such as \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"predict,\" \"project,\" \"should,\" and \"will\" and variations of such words and similar expressions are intended to identify such forward-looking statements. These forward-looking statements are not guarantees of future performance and involve risks, assumptions and uncertainties, including, but not limited to, competitive and cyclical factors relating to the aerospace industry, dependence of some of our businesses on key customers, requirements of capital, product liabilities in excess of insurance, uncertainties relating to the integration of acquired businesses, divestitures of our business, general economic conditions affecting our business segment, technological developments, limited availability of raw materials or skilled personnel, changes in governmental regulation and oversight, and international hostilities and terrorism. These and other risks, assumptions and uncertainties are more fully described in Item 1A (Risk Factors) of our Annual Report on Form 10-K for the fiscal year ended March 31, 2021, filed with the Securities and Exchange Commission on May 20, 2021, in Item 1A (Risk Factors) of our Quarterly Report on Form 10-Q for the fiscal quarter ended December 31, 2021, filed with the Securities and Exchange Commission on February 9, 2022, and in other documents that we file or furnish with the Securities and Exchange Commission, which you are encouraged to read. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual results may vary materially from those indicated or anticipated by such forward-looking statements. Accordingly, you are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date they are made. Triumph expressly disclaims any current intention to update publicly any forward-looking statement after the distribution of this release, whether as a result of new information, future events, changes in assumptions or otherwise.","gated":false}],"gated":false},{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Important Additional Information and Where to Find It:","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"text","content":"The Company, its directors and certain of its executive officers and employees may be deemed to be participants in the solicitation of proxies from stockholders in connection with the Company's 2022 annual meeting of stockholders (the \"2022 Annual Meeting\"). The Company plans to file a proxy statement with the U.S. Securities and Exchange Commission (the \"SEC\") in connection with the solicitation of proxies for the 2022 Annual Meeting (the \"2022 Proxy Statement\"), together with a proxy card. STOCKHOLDERS ARE URGED TO READ THE 2022 PROXY STATEMENT (INCLUDING ANY AMENDMENTS OR SUPPLEMENTS THERETO) AND ANY OTHER RELEVANT DOCUMENTS THAT THE COMPANY WILL FILE WITH THE SEC CAREFULLY AND IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION. Additional information regarding the identity of these potential participants, none of whom owns in excess of one percent (1%) of the Company's outstanding shares of common stock, and their direct or indirect interests, by security holdings or otherwise, will be set forth in the 2022 Proxy Statement and other materials to be filed with the SEC in connection with the 2022 Annual Meeting. Information relating to the foregoing can also be found in the Company's definitive proxy statement for its 2021 annual meeting of stockholders (the \"2021 Proxy Statement\"), filed with the SEC on June 8, 2021. To the extent holdings of the Company's securities by such potential participants (or the identity of such participants) have changed since the information printed in the 2021 Proxy Statement, such information has been or will be reflected on Statements of Change in Ownership on Forms 3 and 4 filed with the SEC.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Stockholders will be able to obtain, free of charge, copies of the 2022 Proxy Statement, any amendments or supplements thereto and any other documents (including the proxy card) when filed by the Company with the SEC in connection with the 2022 Annual Meeting at the SEC's website (","gated":false},{"type":"a","href":"http://www.sec.gov","contentObject":[{"type":"text","content":"http://www.sec.gov","gated":false}],"gated":false},{"type":"text","content":") or at the Company's website (","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3470818-1&h=6130868&u=http%3A%2F%2Fwww.triumphgroup.com%2F&a=http%3A%2F%2Fwww.triumphgroup.com","contentObject":[{"type":"text","content":"http://www.triumphgroup.com","gated":false}],"gated":false},{"type":"text","content":").","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=PH89826&sd=2022-03-11","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/triumph-adopts-tax-benefits-preservation-plan-to-protect-valuable-tax-assets-301501230.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/triumph-adopts-tax-benefits-preservation-plan-to-protect-valuable-tax-assets-301501230.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  Triumph Group","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"img","src":"https://rt.prnewswire.com/rt.gif?NewsItemId=PH89826&Transmission_Id=202203111648PR_NEWS_USPR_____PH89826&DateId=20220311","alt":"","variations":[],"gated":false}]}