{"id":"20220425005842","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Annaly Capital Management, Inc. Announces Agreement to Sell Its Middle Market Lending Portfolio to Ares Management Corporation for $2.4 Billion","publishedDate":"2022-04-25T15:15:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Annaly Capital Management, Inc. Announces Agreement to Sell Its Middle Market Lending Portfolio to Ares Management Corporation for $2.4 Billion","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAnnaly Capital Management, Inc. (NYSE: NLY) (“Annaly” or the “Company”) today announced that it has entered into a definitive agreement to sell its Middle Market Lending portfolio to Ares Capital Management LLC on behalf of funds managed by the Credit Group of Ares Management Corporation (NYSE: ARES) (“Ares”), a leading global alternative investment manager. The transaction is valued at approximately $2.4 billion and represents substantially all of the Company’s Middle Market Lending assets held on balance sheet as well as assets managed for third parties. The Company’s Middle Market Lending portfolio is comprised of predominantly 1","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"st","gated":false}],"gated":false},{"type":"text","content":" and 2","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"nd","gated":false}],"gated":false},{"type":"text","content":" lien loans focused on defensive, counter-cyclical industries.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“The sale of our Middle Market Lending portfolio represents a successful outcome for Annaly’s shareholders and marks the latest in a series of strategic actions – including the disposition of our Commercial Real Estate business and investments into our Mortgage Servicing Rights and Residential Credit businesses – that have enhanced our focus and capabilities across our core housing finance strategy,” remarked David Finkelstein, Annaly’s Chief Executive Officer & President.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAnnaly expects the transaction to be accretive to book value and have an immaterial impact on other key financial metrics, including earnings available for distribution and the Company’s dividend. Upon closing of the transaction, the Company intends to use proceeds from the sale to repay its financing facilities related to the Middle Market Lending assets being sold and to purchase targeted assets in accordance with its capital allocation policy, including Agency MBS, Mortgage Servicing Rights and Residential Credit assets.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nSubject to customary closing conditions, the transfer of the Middle Market Lending portfolio is expected to be completed by the end of the second quarter of 2022.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nWells Fargo Securities, LLC is serving as financial advisor and Hunton Andrews Kurth LLP is serving as legal advisor to Annaly. Latham & Watkins LLP is serving as legal advisor to Ares.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Annaly","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAnnaly is a leading diversified capital manager with investment strategies across mortgage finance. Annaly’s principal business objective is to generate net income for distribution to its stockholders and to optimize its returns through prudent management of its diversified investment strategies. Annaly is internally managed and has elected to be taxed as a real estate investment trust, or REIT, for federal income tax purposes. Additional information on the company can be found at ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.annaly.com%2F&esheet=52697068&newsitemid=20220425005842&lan=en-US&anchor=www.annaly.com&index=1&md5=d67bda4cc0be1e92f3681fb61cc37880","contentObject":[{"type":"text","content":"www.annaly.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Ares Management Corporation","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAres Management Corporation is a leading global alternative investment manager offering clients complementary primary and secondary investment solutions across the credit, private equity, real estate and infrastructure asset classes. Ares Management Corporation seeks to provide flexible capital to support businesses and create value for its stakeholders and within its communities. By collaborating across its investment groups, Ares Management Corporation aims to generate consistent and attractive investment returns throughout market cycles. As of December 31, 2021, Ares Management Corporation's global platform had approximately 2,100 employees operating across North America, Europe, Asia Pacific and the Middle East and approximately $314 billion of assets under management, including Ares Management’s acquisition of AMP Capital’s Infrastructure Debt platform which closed February 10, 2022. For more information, please visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.aresmgmt.com&esheet=52697068&newsitemid=20220425005842&lan=en-US&anchor=www.aresmgmt.com&index=2&md5=3f425e81130aeebc67a8b4e257cd99fb","contentObject":[{"type":"text","content":"www.aresmgmt.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis news release and our public documents to which we refer contain or incorporate by reference certain forward-looking statements which are based on various assumptions (some of which are beyond our control) and may be identified by reference to a future period or periods or by the use of forward-looking terminology, such as \"may,\" \"will,\" \"believe,\" \"expect,\" \"anticipate,\" \"continue,\" or similar terms or variations on those terms or the negative of those terms. Actual results could differ materially from those set forth in forward-looking statements due to a variety of factors, including, but not limited to, risks and uncertainties related to the COVID-19 pandemic, including as related to adverse economic conditions on real estate-related assets and financing conditions; changes in interest rates; changes in the yield curve; changes in prepayment rates; the availability of mortgage-backed securities and other securities for purchase; the availability of financing and, if available, the terms of any financing; changes in the market value of our assets; changes in business conditions and the general economy; operational risks or risk management failures by us or critical third parties, including cybersecurity incidents; our ability to grow our residential credit business; the sale of our middle market lending business; credit risks related to our investments in credit risk transfer securities, residential mortgage-backed securities and related residential mortgage credit assets and corporate debt; risks related to investments in mortgage servicing rights; our ability to consummate any contemplated investment opportunities; changes in government regulations or policy affecting our business; our ability to maintain our qualification as a REIT for U.S. federal income tax purposes; and our ability to maintain our exemption from registration under the Investment Company Act. For a discussion of the risks and uncertainties which could cause actual results to differ from those contained in the forward-looking statements, see \"Risk Factors\" in our most recent Annual Report on Form 10-K and any subsequent Quarterly Reports on Form 10-Q. The Company does not undertake, and specifically disclaims any obligation, to publicly release the result of any revisions which may be made to any forward-looking statements to reflect the occurrence of anticipated or unanticipated events or circumstances after the date of such statements, except as required by law.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220425005842r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Annaly Investor Contact \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Annaly Capital Management, Inc.\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Investor Relations\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"1-888-8Annaly\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:investor@annaly.com","contentObject":[{"type":"text","content":"investor@annaly.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Annaly Media Contact \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Brunswick Group\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Alex Yankus\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"212-333-3810\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:annaly@brunswickgroup.com","contentObject":[{"type":"text","content":"annaly@brunswickgroup.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Ares Management Contact \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Carl Drake, +1 888-818-5298\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"or\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Jacob Silber, +1 212-301-0376\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@aresmgmt.com","contentObject":[{"type":"text","content":"media@aresmgmt.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220425005842/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220425005842/en/","gated":false}],"gated":false}],"gated":false}]}