{"id":"20220308006419","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Tidewater Announces the Acquisition of Swire Pacific Offshore, Creating World’s Leading OSV Operator","publishedDate":"2022-03-09T04:55:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Tidewater Announces the Acquisition of Swire Pacific Offshore, Creating World’s Leading OSV Operator","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nTidewater Inc. (NYSE: TDW) (the “Company”) today announced a definitive agreement to acquire all of the outstanding shares of Swire Pacific Offshore Holdings Limited (“SPO”), a subsidiary of Swire Pacific Limited (HKSE: 0019.HK and 0087.HK), for approximately $190 million (the “Transaction”).\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release features multimedia. View the full release here: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220308006419/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220308006419/en/","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Strategic Rationale","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Creates industry’s largest fleet of OSVs: ","gated":false}],"gated":false},{"type":"text","content":"SPO’s fleet of 50 OSVs consists of 29 AHTS vessels and 21 PSVs; pro forma for the Transaction, Tidewater will own a fleet of 174 OSVs, bringing Tidewater’s total fleet size to 203 vessels, including crew boats, tug boats and maintenance vessels\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Significant cost synergies: ","gated":false}],"gated":false},{"type":"text","content":"Tidewater has identified approximately $45 million of annual run-rate cost synergies that will be targeted post-consummation of the Transaction\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Maintains balance sheet strength: ","gated":false}],"gated":false},{"type":"text","content":"pro forma the Transaction, Tidewater will retain the strongest balance sheet in the industry, with approximately $110 million of cash on hand, full access to our existing undrawn $25 million revolving credit facility and financial flexibility under existing indentures\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Robust earnings leverage:","gated":false}],"gated":false},{"type":"text","content":" acquired 50 OSVs provides a meaningful expansion of Tidewater’s asset base with which to drive earnings and free cash flow generation as the recovery in the offshore oil & gas market continues to unfold\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Fleet high-grading: ","gated":false}],"gated":false},{"type":"text","content":"adds 18 large PSVs and 10 large AHTSs to Tidewater’s fleet, with the age profile of large PSVs and large AHTSs improving by 0.6 years and 2.7 years, respectively\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Compelling valuation: ","gated":false}],"gated":false},{"type":"text","content":"SPO acquired at an attractive valuation compared to fleet appraised value, providing for asset-level value accretion\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Geographic enhancement and expansion:","gated":false}],"gated":false},{"type":"text","content":" The Transaction significantly enhances Tidewater’s presence in West Africa, provides for an expansion of its footprint in the rapidly growing Southeast Asia region and is additive to its footprint in the Middle East\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nQuintin Kneen, Tidewater’s President and Chief Executive Officer, commented, “The acquisition of Swire Pacific Offshore marks another important milestone in the strengthening of Tidewater’s leadership position as we capitalize on the recovery in the OSV industry. I am excited to have acquired a high-quality fleet with a strong reputation in the maritime sector globally. I believe that the timing of this acquisition will allow Tidewater to capitalize on the continued improvement in the offshore supply vessel market, providing Tidewater with significant additional earnings and free cash flow generation potential as utilization and day rates continue to improve. All 50 acquired vessels are currently active and working throughout the world, allowing Tidewater to immediately leverage this new asset base.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“We see a great deal of industrial synergies in acquiring this fleet and believe we will be able to rapidly integrate these vessels into the existing Tidewater shore base support infrastructure. Further, we believe that we will be able to realize significant synergies at both the G&A and operating expense level of approximately $45 million, from the current run rates, within 24 months from the close of the Transaction.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“The acquired fleet is primarily split among West Africa and Southeast Asia and Middle East. The addition of 25 OSVs in West Africa will nearly double Tidewater’s presence in the rapidly growing region, positioning it as the largest operator of active vessels in the region. Similarly, the addition of the SPO fleet in Southeast Asia and the Middle East positions Tidewater as the largest operator of active vessels across the entire region. The expansion of the Southeast Asia region, with 19 vessels currently operating, provides us with an opportunity to meaningfully participate in the oil & gas vessel market in the near-term and provides a platform with which to pursue offshore wind development expected to advance in the region.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nKneen continued, “Following the financing transactions executed during the fourth quarter of 2021, the buyout of our joint venture partner in Angola, and now the SPO acquisition, we have executed a series of steps that have positioned Tidewater as the world’s leading OSV operator with the cleanest balance sheet in the industry. With our strong financial position, substantial available liquidity, experienced management team and efficient global operations, we are well-positioned to drive utilization and day rates with an expanded fleet of vessels, drive earnings and cash flow generation and pursue opportunities for additional strategic value accretive acquisitions.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Transaction Terms","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nUnder the terms of the transaction, Tidewater will issue 8,100,000 Jones Act warrants, each of which will be initially exercisable for one share of Tidewater common stock at $0.001 per share, plus a cash payment of $42 million. As of the date hereof, the warrants to be issued in the Transaction would represent, upon exercise, approximately 15.6% of all of Tidewater’s outstanding shares of common stock and existing warrants. The Jones Act warrants to be issued in the Transaction are non-voting, are not entitled to receive any dividends or other distributions, and are otherwise structured to comply with the foreign ownership limitations on the beneficial ownership of Tidewater’s common stock contained in the Merchant Marine Act of 1920, as amended.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe Transaction was unanimously approved by Tidewater’s Board of Directors and is expected to close in the second quarter of 2022.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Advisors","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nEvercore is serving as financial advisor and Vinson & Elkins L.L.P. is serving as legal counsel to Tidewater.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Conference Call Information","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nConcurrent with Tidewater’s Q4 and Full Year 2021 earnings call, Tidewater management will host a conference call during which it will provide additional comments on the Transaction. Investors and interested parties may listen to the earnings conference call via telephone by calling +1.844.200.6205 if calling from the U.S. or Canada (+1.929.526.1599 if calling from outside the U.S.) and provide Access Code: 568379 prior to the scheduled start time. A live webcast of the call will also be available in the Investor Relations section of Tidewater’s website at investor.tdw.com.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Tidewater","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nTidewater owns and operates one of the largest fleets of offshore support vessels in the industry, with more than 65 years of experience supporting offshore energy exploration, production, generation and offshore wind activities worldwide.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIn accordance with the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, Tidewater notes that certain statements set forth in this press release contain certain forward-looking statements which reflect our current view with respect to future events and future financial performance. Forward-looking statements are all statements other than statements of historical fact. All such forward-looking statements are subject to risks and uncertainties, many of which are beyond the control of the Company, and our future results of operations could differ materially from our historical results or current expectations reflected by such forward-looking statements. Investors should carefully consider the risk factors described in detail in the Company’s most recent Form 10-K, most recent Form 10-Q, and in similar sections of other filings made by the Company with the SEC from time to time. The Company’s filings can be obtained free of charge on the SEC’s website at ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.sec.gov&esheet=52592172&newsitemid=20220308006419&lan=en-US&anchor=www.sec.gov&index=1&md5=1057ea3b844eb8fda6282d012ce402e0","contentObject":[{"type":"text","content":"www.sec.gov","gated":false}],"gated":false},{"type":"text","content":". Except to the extent required by law, the Company expressly disclaims any obligations or undertaking to release publicly any updates or revisions to any forward-looking statements contained in this press release to reflect any change in the Company’s expectations or any change in events, conditions or circumstances on which any statement is based. Forward-looking statements and written and oral forward-looking statements attributable to the Company or its representatives after the date of this release are qualified in their entirety by the cautionary statements contained in this paragraph and in other reports filed by the Company with the SEC.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220308006419r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nTidewater Inc.\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"West Gotcher\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Vice President,\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Finance and Investor Relations\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"+1.713.470.5285\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220308006419/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220308006419/en/","gated":false}],"gated":false}],"gated":false}]}