{"id":"20220511sf53483","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"Gogoro To Launch In Israel This Summer","publishedDate":"2022-05-11T06:00:00-05:00","body":[{"type":"text","content":"Gogoro To Launch In Israel This Summer\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"Gogoro To Launch In Israel This Summer","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"TEL AVIV, Israel, May 11, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Metro Motor, Paz Group and Gogoro Partner ","gated":false}],"gated":false},{"type":"b","contentObject":[{"type":"text","content":"to Launch Battery Swapping Ecosystem in ","gated":false}],"gated":false},{"type":"b","contentObject":[{"type":"text","content":"Tel Aviv Metro Area and in Other ","gated":false}],"gated":false},{"type":"b","contentObject":[{"type":"text","content":"Cities in the Future","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"TEL AVIV, Israel, May 11, 2022 /PRNewswire/ -- Gogoro Inc. (Nasdaq: GGR), a global technology leader in battery swapping ecosystems that enable sustainable mobility solutions for cities, today announced it was partnering with industry leaders, Metro Motor and Paz Group in Israel to launch its industry leading battery swapping platform and Smartscooters in the Tel Aviv metropolitan area this summer and other cities in Israel in the future. Metro Motor is a top two-wheel vehicle distributor in Israel and Paz Group is a leading gas and energy company in Israel. ","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n                ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n                        ","gated":false},{"type":"a","href":"https://mma.prnewswire.com/media/1815263/Gogoro_Metro_Paz_Graphic.html","contentObject":[{"type":"text","content":"\n                    ","gated":false},{"type":"img","src":"https://mma.prnewswire.com/media/1815263/Gogoro_Metro_Paz_Graphic.jpg","alt":"Gogoro To Launch Battery Swapping and Smartscooters In Israel This Summer.","variations":[],"gated":false},{"type":"text","content":"\n                        ","gated":false}],"gated":false},{"type":"text","content":"\n                ","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"We are excited to be launching in Israel, one of the most innovative and technology forward countries in the world to establish a new era of urban two-wheel mobility. We are partnering with two industry leaders Metro Motor and Paz, to bring Gogoro's next generation battery swapping ecosystem to the Tel Aviv metro area this summer and additional cities in the future,\" said ","gated":false},{"type":"u","contentObject":[{"type":"text","content":"Horace Luke, founder, chairman, and chief executive officer of Gogoro","gated":false}],"gated":false},{"type":"text","content":". \"Gogoro was created to introduce a mass market shift to sustainable energy in densely populated cities by establishing an intelligent urban ecosystem that introduces a new refueling system for electric two-wheel vehicles. Today, Gogoro manages more than 350,000 battery swaps per day and since 2015 has exceeded 275 million battery swaps.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"We are proud to announce our collaboration with Gogoro and excited to begin marketing their innovative Smartscooters in Israel. The introduction of Gogoro into the Israeli market is excellent news for two-wheeler enthusiasts and is likely to be a significant growth engine for the company, ever deepening its presence in the electric two-wheeler market,\" said ","gated":false},{"type":"u","contentObject":[{"type":"text","content":"Gadi Aviram, ","gated":false}],"gated":false},{"type":"u","contentObject":[{"type":"text","content":"t","gated":false}],"gated":false},{"type":"u","contentObject":[{"type":"text","content":"he chairm","gated":false}],"gated":false},{"type":"u","contentObject":[{"type":"text","content":"a","gated":false}],"gated":false},{"type":"u","contentObject":[{"type":"text","content":"n of the board ","gated":false}],"gated":false},{"type":"u","contentObject":[{"type":"text","content":"of ","gated":false}],"gated":false},{"type":"u","contentObject":[{"type":"text","content":"Metro Motor.","gated":false}],"gated":false},{"type":"text","content":" \"This new collaboration aligns with Metro Motor's vision of constantly updating the standards by which they operate, maintaining the status as an industry-leader. We provide the public optimization of user experience, fashion, environmental protection, and affective economic package.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"Paz is proud to bring to Israel the amazing Gogoro Smartscooters - an innovative transportation solution tailored to the Israeli lifestyle,\" said ","gated":false},{"type":"u","contentObject":[{"type":"text","content":"Nir Stern, CEO of Paz.","gated":false}],"gated":false},{"type":"text","content":" \"Paz will lead the \"battery swapping\" platform for the scooters as part of the company's electric vehicle charging department, and will offer dedicated services to users at our stations and through our app.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"At the heart of Gogoro's ecosystem is the Gogoro Network, an open and interoperable battery swapping platform that was recognized in 2021 by Guidehouse Insights as the leading battery swapping company for lightweight urban vehicles in the world. Gogoro Network is a new generation of swappable battery refueling that is smart, scalable, and continually optimizing itself to be dynamic and versatile for people, communities, and businesses. With more than 465,000 riders and over 10,000 battery swapping GoStations at over 2,185 locations, Gogoro Network is hosting 350,000 daily battery swaps with more than 275 million total battery swaps to date.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Gogoro Network battery swapping has demonstrated interoperable success by enabling multiple generations of batteries, swapping stations and vehicles to integrate and work together. For example, Gogoro's first batteries from 2015 can work on its latest vehicles and can integrate across different generations of GoStations.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"ABOUT GOGORO","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Founded in 2011 to rethink urban energy and inspire the world to move through cities in smarter and more sustainable ways, Gogoro leverages the power of innovation to change the way urban energy is distributed and consumed. Gogoro's battery swapping and vehicle platforms offer a smart, proven and sustainable long-term ecosystem for delivering a new approach to urban mobility. Gogoro has quickly become an innovation leader in vehicle design and electric propulsion, smart battery design, battery swapping, and advanced cloud services that utilize artificial intelligence to manage battery availability and safety. The challenge is massive, but the opportunity to disrupt the status quo, establish new standards, and achieve new levels of sustainable transportation growth in densely populated cities is even greater. For more information, visit ","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3532913-1&h=2710607394&u=https%3A%2F%2Fwww.gogoro.com%2Fnews&a=www.gogoro.com%2Fnews","contentObject":[{"type":"text","content":"www.gogoro.com/news","gated":false}],"gated":false},{"type":"text","content":" and follow Gogoro on Twitter: @wearegogoro.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"ABOUT METRO MOTOR","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Metro Motors Ltd. is Israel's largest power-sports distributor for motorcycles, ATVs, UTVs, and other leisure vehicles. Founded in 1981, Metro Motors are the authorized suppliers of the world's premier motorcycle brands: San Yang, Yamaha, Kawasaki, Beta, and Fantic. The company also retails off-road vehicles, commercial vehicles, and utility vehicles from the likes of Access, Segway, Marshell, and 'Afikim', an Israeli manufacturer of Mobility Scooters. Recently, Metro Motors founded the 'Metro ELECTRIC Division' importing urban electric two-wheel scooters, mopeds and motorcycles from the international brands, Gogoro and Zero. The Metro ELECTRIC Division also franchises American manufacturers KARMA Automotive, and the Chinese Limp Motors. An additional Metro Motors Division of recreational watercraft retail jet skis and personal pump-jet boats from the brands Moomba, Supra, Kawasaki, and Yamaha. Metro Motors is built on the premise of providing the highest possible level of customer service for its Israeli clients. The company operates 10 showrooms, 5 service stations, and 4 logistic centers throughout Israel. Furthermore, Metro Motors provides maintenance services for all of their vehicles from an additional 40 authorized service stations all over the country.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Metro Motors head offices are located in Atir Yeda 18, Kfar Saba, Israel. For more details visit: ","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3532913-1&h=422548349&u=https%3A%2F%2Fwww.metro.co.il%2F&a=https%3A%2F%2Fwww.metro.co.il%2F","contentObject":[{"type":"text","content":"https://www.metro.co.il/","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"ABOUT PAZ GROUP","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"The Paz Group is Israel's leading energy corporation, operating real estate and industrial retail branches. Paz is traded publicly on the Tel Aviv Stock Exchange and is valued at NIS 5.5 billion. Paz has 270 refueling complexes nationwide, over 300 minimarkets, and a unique app with over one million users. Paz will take the lead in electric vehicle charging, with the placement of fast charging stations in our stations and additional electric charging services.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Forward Looking Statements","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This communication contains forward looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Forward looking statements generally relate to future events or Gogoro's future financial or operating performance. In some cases, you can identify forward looking statements because they contain words such as \"may,\" \"will,\" \"should,\" \"expects,\" \"plans,\" \"anticipates,\" \"going to,\" \"could,\" \"intends,\" \"target,\" \"projects,\" \"contemplates,\" \"believes,\" \"estimates,\" \"predicts,\" \"potential\" or \"continue\" or the negative of these words or other similar terms or expressions that concern Gogoro's expectations, strategy, priorities, plans or intentions. Forward-looking statements in this communication include, but are not limited to, projections of market opportunity and market share, the capability of Gogoro's technology, Gogoro's business plans including its plans to grow and expand including its plans to launch a battery swapping ecosystem in Tel Aviv and other cities, the timing of Gogoro's launch in Israel, the potential success of Gogoro's partnerships with Metro Motor and Paz Group and statements by Gogoro's founder, chairman, and chief executive officer.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Gogoro's expectations and beliefs regarding these matters may not materialize, and actual results in future periods are subject to risks and uncertainties that could cause actual results to differ materially from those projected, including risks related to the impact of the COVID-19 pandemic, Gogoro's ability to effectively manage its growth, Gogoro's ability to launch and ramp up the production of its products and control its manufacturing costs and manage its supply chain issues, Gogoro's risks related to ability to expand its sales and marketing abilities, Gogoro's ability to expand effectively into new markets, foreign exchange fluctuations, Gogoro's ability to develop and maintain relationships with its partners, risks related to operating in the PRC, regulatory risks, and Gogoro's risks related to strategic collaborations including with Metro Motor and Paz Group, alliances or joint ventures including Gogoro's ability to enter into and execute its plans related to strategic collaborations, alliances or joint ventures in order for such strategic collaborations, alliances or joint ventures to be successful and generate revenue, the risks related to the need for Gogoro to invest more capital in strategic collaborations, and alliances or joint ventures. The forward looking statements contained in this communication are also subject to other risks and uncertainties, including those more fully described in Gogoro's filings with the Securities and Exchange Commission (\"SEC\"), including in Gogoro's Form 20-F for the year ended December 31, 2021, which was filed on May 2, 2022  and in its subsequent filings with the SEC, copies of which are available on our website and on the SEC's website at ","gated":false},{"type":"a","href":"http://www.sec.gov","contentObject":[{"type":"text","content":"www.sec.gov","gated":false}],"gated":false},{"type":"text","content":". The forward looking statements in this communication are based on information available to Gogoro as of the date hereof, and Gogoro disclaims any obligation to update any forward looking statements, except as required by law.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n                ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n                        ","gated":false},{"type":"a","href":"https://mma.prnewswire.com/media/395232/Gogoro___Logo.html","contentObject":[{"type":"text","content":"\n                    ","gated":false},{"type":"img","src":"https://mma.prnewswire.com/media/395232/Gogoro___Logo.jpg","alt":"Gogoro Logo","variations":[],"gated":false},{"type":"text","content":"\n                        ","gated":false}],"gated":false},{"type":"text","content":"\n                ","gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=SF53483&sd=2022-05-11","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content to download multimedia:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/gogoro-to-launch-in-israel-this-summer-301544669.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/gogoro-to-launch-in-israel-this-summer-301544669.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  Gogoro","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false}]}