{"id":"20211115181","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"5 takeaways from the COP26 climate summit investors need to know","publishedDate":"2021-11-15T08:01:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Rachel Koning Beals ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Climate action 'can be done, but everyone will need to chip in: governments, central banks, capital markets, ESG, private sectors and consumers,' says Bank of America ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  A two-week U.N. climate conference in Scotland required overtime, but delegates on Saturday advanced pollution-cutting priorities though they spared the harsher restrictions for oil, gas and coal that some environmental groups and scientists believe necessary to assure hitting aggressive net-zero emissions goals in coming years. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Still, with the ball advanced, investors will smartly reassess the green energy and clean technology opportunities, as well as the adaptability of traditional fossil-fuel giants, that could shape portfolios moving forward. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read:Nations strike climate deal with coal compromise ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Climate action to limit global warming requires an unprecedented shift to clean technologies at scale, but will be expensive, slow and uneven,\" a Bank of America Merrill Lynch thematic equity research team said in a note. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  They estimate a doubling of annual investment in the global energy system alone of $5 trillion each year over the next 30 years, adding up to $150 trillion or approximately two times current global GDP. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"It can be done, but everyone will need to chip in: governments, central banks, capital markets, ESG (environmental, social and governance-themed investing), private sectors and consumers,\" the analysts said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Banks, insurers and asset managers representing some $130 trillion in holdings have pledged to align themselves with net-zero emissions goals. Their regulators are also on board, although to varying degrees, and with some political pushback. One major objective is new disclosure rules around emissions; the U.S. Securities and Exchange Commission, for example, is getting closer to rule-making on such disclosures for stocks. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Opinion: At last, a global accounting standard that will discourage greenwashing and harness the power of capital to fight climate change ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Stock market analysts have said that if companies are forced to disclose their emissions, it could be a game-changer, making it easier for investors to adjust their portfolios to include climate change and sustainability themes, if they so choose. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Here are five areas for investors to consider in the wake of the U.N.'s climate announcement. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Tightening emissions targets and the green energy to get there ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Conference of Parties, or COP26, agreement says that in order to achieve the 2015 Paris accord's ambitious goal of capping global warming at 1.5 degrees Celsius (2.7 Fahrenheit) by the end of the century compared with pre-industrial times, countries will need to make \"rapid, deep and sustained reductions in global greenhouse gas emissions, including reducing global carbon dioxide emissions by 45% by 2030 relative to the 2010 level and to net zero around mid-century, as well as deep reductions in other greenhouse gases.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Developed countries are also being asked to submit a short-term update next year. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Helen Mountford, vice president, climate and economics, with the World Resources Institute, saw mostly positive developments from her group's point of view, and areas for growth. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"There are the right rules in place to ensure accountability and rigor in the system,\" she said. \"And a push to come back next year with ambition for their 2030 targets.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Scientists say the world is not on track to meet the temperature goal yet, but these pledges will bring them closer. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The BofA researchers noted decelerating costs of clean technologies in the last decade. Already, wind has gotten 45% cheaper, with the cost of solar down 85% and batteries, such as for electric vehicles and solar storage, down 89%. Cheaper costs make these sources more competitive with natural gas  and other sources, but their capacity is lagging. Thus, another growth opportunity. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"To decarbonize our planet, we will need 9x, 14x and 88x more capacity of wind, solar and batteries, respectively, by 2050, and even then still that can cover only half the emissions reduction,\" the team said in its note. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  U.S. solar and wind growth is on pace to notch records in 2022, pushed there by government incentives and private-sector demand, a report from S&P Global Market Intelligence says. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The research group expects as much as 44 gigawatts of utility-scale solar (TAN) , and 27 gigawatts of wind (FAN)to come online next year. For solar, the forecast is nearly double 2021's estimated 23 gigawatts of new capacity. And for wind, 2022's projected totals would surpass the current annual record of 16 gigawatts, set in 2020. It remains only a portion of available utility capacity, however. The U.S. has a total generating capability of about 1,200 gigawatts, according to the Public Power Association. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"If the current administration is successful in putting the U.S. on a path to 100% decarbonization of the energy sector by 2035, these record-setting projections are just the beginning,\" S&P Global said of its 2022 estimates. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Morgan Stanley stock-pickers highlighted for Barron's a few of their stocks to watch when it comes to putting climate-change solutions into action. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  As for the renewable-energy space, FirstEnergy(FE) and SunRun(RUN) are U.S.-listed companies in the mix, while the area of energy storage brought QuantumScape(QS) to mind. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The firm's list for electric vehicles, which extends beyond passenger cars, includes familiar names and more: TeslaTSLA, NIONIO, and Li AutoLI, TPI CompositesTPIC, Schneider NationalSNDR, Knight-Swift TransportationKNX  FREYR BatteryFREY and  FiskerFSR. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read:A 'Made in America' tax credit -- what car buyers considering a Tesla, Rivian or other EVs need to know about Build Back Better ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The BofA team says wind, solar and other renewably-sourced power won't be enough for some industries. \"Solutions to decarbonize hard-to-abate sectors such as shipping, aviation and steel are at earlier stages of development, requiring rapid development and cost reductions in green hydrogen, sustainable fuels and carbon capture, for example,\" they said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Hydrogen and nuclear ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  COP26 developments could be a boon for nuclear energy, said Amber Rudd, the U.K.'s former minister for energy and climate, and a delegation leader at the 2015 Paris climate conference, at a UBS conference this week. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In the U.S., nuclear and hydrogen technology tend to get bipartisan backing. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Rudd said the conversion to nuclear would shift some upfront cost risk to taxpayers, but she also sees demand for small modular reactors. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The U.S. Nuclear Regulatory Commission as recently as  2020 approved the design of a new kind of reactor, known as a small modular reactor. The design, from the Portland, Ore.--based company NuScale Power, is intended to speed construction, lower cost and improve safety over traditional nuclear reactors, in large part because of its size. Private NuScale Power has drawn investment from FluorFLR and others. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  General Electric-Hitachi Nuclear Energy(GE) has also made a name in small modular reactors. GE this week announced it was breaking up into three companies. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Green hydrogen technology will need more investment to reach scale, but it often features in bullish outlooks when it comes to the multiple steps required to move from fossil fuels. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Looking at hydrogen, Morgan Stanley identified U.S. stocks Air ProductsAPD, EnbridgeENB and New Fortress EnergyNFE as potential beneficiaries of growth for this alternative fuel source. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Global X Hydrogen ETF(HYDR) is up about 7% since its September launch. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Continued support for oil, gas and coal companies ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Traditional energy sources found some support in a COP26 edit to earlier proposals, which some groups argued against. China and India, in particular, pushed back on stricter coal rules, and the bigger group reluctantly agreed in order to push a yes-vote overall. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The final statement calls on countries to \"accelerate efforts towards the phase-down of unabated coal power and inefficient fossil fuel subsidies.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Earlier language pushed for all oil and gas subsidies to end and it called for a phaseout, not the phase-down of coal. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  And, the text says nations will recognize \"the need for support towards a just transition\" -- a reference to calls from those working in the fossil fuel industry for financial support as they wind down jobs and businesses. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Still, the possibility of having fossil fuels explicitly mentioned for the first time in a decision coming out of the U.N.'s annual COP was well-received by some environmentalists. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Significant announcements have been made at this COP,  on coal, on fossil fuel subsidies, as well as on curbing oil and gas. For the first time in 27 years of negotiations, COP's final agreement even mentions fossil fuels,\" said Namrata Chowdhary, head of public engagement at environment group 350.org. \"This is a tiny step, but a significant one. There is hope, and hope is in the people, in the climate movement.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Of the three fossil fuels -- coal, oil and natural gas -- coal is the biggest polluter. It's responsible for about 20% of all greenhouse gas emissions. It's also a fuel that historically has been relatively easy to replace, first with natural gas and increasingly renewables in advanced nations. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Australia has the highest per capita coal emissions among the Group of 20 biggest economies, followed by South Korea, South Africa, the U.S. and China, according to an analysis by Ember, a climate and energy think tank. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  But even as renewables become more competitive on price, coal isn't that easy to get rid of. Electricity needs are soaring as the world's population and prosperity increase, and renewables simply aren't enough to satisfy that growth in demand, particularly in India. The International Energy Agency projects that India will need to add a power system the size of the EU's to meet expected growth in electricity demand in the next 20 years. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (MORE TO FOLLOW) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  11-15-21 0901ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2021 Dow Jones & Company, Inc.","gated":false}]}