{"id":"20220518480","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Target stock plunges as profit drops on consumer spending shifts and jump in freight costs","publishedDate":"2022-05-18T11:33:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Tonya Garcia ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Analysts note that Target's quarterly results are \"eerily similar\" to Walmart's, which reported on Tuesday ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Target Corp. shares plunged more than 25% in Wednesday trading after the retailer reported a big earnings miss driven by a shift in spending away from key categories like apparel and home. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The stock is heading for its worst day since Black Monday ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In earnings call comments, Target Chief Executive Brian Cornell said the company continued to make gains in areas like food and beverage and essentials. Beauty was also strong as Target (TGT) continues its partnership with Ulta Beauty Inc.   (ULTA) ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"In our other three core merchandise categories, apparel, home and hardlines, we saw a rapid slowdown in the year-over-year sales trends beginning in March when we began to see the impact of last year's stimulus payments,\" Cornell said, according to FactSet. Included among hardlines are furniture, appliances and electronics. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"While we anticipated a post-stimulus slowdown in these categories, and we expect the consumer to continue refocusing their spending away from goods and services, we didn't anticipate the magnitude of that shift.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Target had too much inventory on \"bulky\" items like TVs, kitchen appliances and outdoor furniture, which drove higher storage costs and markdowns. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See: P&G makes the case for its premium products as consumer budgets battle shrinkflation and rising prices ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Also: RH says 'softening demand' in the first quarter coincided with Russia's attack on Ukraine ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  High savings, higher wages, and the employment rate continue to help shoppers, though spending is moving towards travel and other activities that get people out of the house as the world begins to recover from the COVID-19 pandemic. Target's Chief Growth Officer Christina Hennington notes that while consumers are concerned about inflation and gasoline prices, they might arrive at a store willing to splurge on home décor items, or looking for a new pair of shoes, or preparing for a barbecue or other festive activity. As a result of the changing consumer environment and inflation, which has reached a 40-year high, Target is focused on value. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Many guests are sharing their uncertainty of the overall state of the economy but are feeling more positive about their personal finances,\" she said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The company also experienced freight and transportation costs in the first quarter that were higher-than-expected by hundreds of millions of dollars, and now anticipates freight costs will reach $1 billion for the year. While the retailer had hoped that volatility would moderate this year, \"we don't see conditions improving right away,\" Cornell said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Target reported first-quarter adjusted earnings per share of $2.19, missing the FactSet consensus of $3.07. Revenue of $25.17 billion beat the Street. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  CFRA downgraded Target to hold from buy and slashed its price target to $165 from $288 after the earnings announcement. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Overall, we were caught off guard by Target's rapid change in outlook and worry that we could see more downward revisions to guidance, especially if overall consumer spending weakens and the U.S. economy moves closer to a recession,\" wrote Arun Sundaram, an equity analyst at the research group. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Raymond James analysts note that Target hosted an investor event 78 days ago where the company expressed confidence in its ability to manage inflation. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"While the cost challenges are concerning and create further near-term uncertainty around estimates (and will take some time to gain investor confidence again), Target's top-line momentum, traffic, customer loyalty remain strong (even against the toughest comparison of the year; tougher to fix in retail than cost) -- supporting the long-term favorable thesis of market share gain opportunities,\" wrote analysts led by Bobby Griffin. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Raymond James rates Target stock strong buy. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The company remains profitable -- and has made bottom-line gains on both 2020 and 2019 -- but margins are well below the long-run average, which is a cause for concern and a very notable stumble for a retailer that has long been the poster child for solid retailing,\" wrote Neil Saunders, managing director at GlobalData, noting the consumer shift away from higher margin goods. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Target's value-for-money stance and its strong approach to product development and innovation should help it perform much better than other generalists and many specialists in the market which will see more serious erosions in discretionary categories.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Still, Saunders warns that Target has to execute well and \"ensure that its grocery and household essentials offer is on-point.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Analysts also highlight what RBC Capital Markets called the \"eerily similar\" results from both Target and Walmart Inc. (WMT), which reported fiscal first-quarter earnings on Tuesday. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart noted that some consumers are trading down in certain grocery categories due to inflationary price pressure. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read: Walmart says consumers are trading down to private label for items like dairy and bacon ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"A major theme coming out of Walmart's earnings is the bifurcating U.S. consumer,\" wrote Cowen analysts led by Oliver Chen in a Walmart note. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Walmart noted the impact of inflation on grocery pulled sales away from other categories as low-to-middle income shoppers are cutting back on non-essentials, resulting in overall flat transactions year-over-year.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n   Cowen rates Walmart stock outperform with a $180 price target. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Truist Securities rates Walmart stock hold with a $139 price target, down from $150. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We believe rising food prices (double-digit inflation), will continue to have an outsized impact on the spending power lower/middle income customers (a core base), making it increasingly difficult for Walmart to maintain its sales/margin trajectory off of its massive $400 billion sales base,\" analysts wrote in a Walmart note. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Target's Hennington said Target has grown its food and beverage sales by $1.8 billion over the last three years, about a quarter of the company's sales growth for the period. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Target stock has slumped 31% for the year to date. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tonya Garcia ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-18-22 1233ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}