{"id":"20220517005569","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Introducing IonQ Forte, Improving Quantum Performance with a Software-Configurable Dynamic Laser System","publishedDate":"2022-05-17T14:08:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Introducing IonQ Forte, Improving Quantum Performance with a Software-Configurable Dynamic Laser System","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nNovel optics technology takes industry beyond counting qubits to enable optimal configuration\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fionq.com%2Fposts%2Fmay-17-2022-ionq-forte&esheet=52721826&newsitemid=20220517005569&lan=en-US&anchor=Early+access+to+Forte&index=1&md5=76f5af5702f56310d8d62fdfc57a7da2","contentObject":[{"type":"text","content":"Early access to Forte","gated":false}],"gated":false},{"type":"text","content":" will open doors for developers to experiment with real-world quantum computing\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nForte joins IonQ Aria as second IonQ system with capacity of up to 32-qubits\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIonQ (NYSE: IONQ), an industry leader in quantum computing, announced IonQ Forte, its latest generation of quantum systems. The system features novel, cutting-edge optics technology that enables increased accuracy and further enhances IonQ’s industry leading system performance. Forte is expected to be initially available for select developers, partners, and researchers in 2022 and is expected to be available for broader customer access in 2023.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release features multimedia. View the full release here: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220517005569/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220517005569/en/","gated":false}],"gated":false}],"gated":false},{"type":"div","contentObject":[{"type":"img","src":"https://mms.businesswire.com/media/20220517005569/en/1457927/4/IMG3207.jpg","alt":"Figure 1: Photograph of IonQ Forte (front left) in our quantum data center in College Park, MD. Copyright 2022 by IonQ. (Photo: Business Wire)","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Figure 1: Photograph of IonQ Forte (front left) in our quantum data center in College Park, MD. Copyright 2022 by IonQ. (Photo: Business Wire)","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nForte is the latest evolution towards a “software-configurable quantum computer,” which is designed to allow the company to optimize the computing hardware for targeted user problems–ultimately, giving users customized algorithmic performance. The new system features acousto-optic deflector (AOD) technology, which allows IonQ to dynamically direct laser beams that drive quantum gates towards individual ions. The AOD is designed to minimize noise and overcome variations in ion position, improving fidelity in long chains of trapped ions, which is crucial for scaling quantum computers. In addition, key parameters, including qubit and gate configuration, can be tailored to user needs, creating a truly dynamic and flexible system.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nForte joins IonQ Aria as the company’s second system with capacity of up to 32 qubits, has AOD systems capable of addressing up to 40 individual ion qubits, and is currently configured to use 31 of them. With this technological leap, IonQ furthers its commitment to building ever more powerful quantum computers with an increasing number of ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fionq.com%2Fposts%2Ffebruary-23-2022-algorithmic-qubits&esheet=52721826&newsitemid=20220517005569&lan=en-US&anchor=algorithmic+qubits&index=2&md5=8b9bceffee232b51f7e261fc38d17c03","contentObject":[{"type":"text","content":"algorithmic qubits","gated":false}],"gated":false},{"type":"text","content":", an application-oriented performance metric for quantum computers. The new announcement follows IonQ’s announcement of open-source access to ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fionq.com%2Fnews%2Fmay-12-2022-ionq-launches-native-gate-access&esheet=52721826&newsitemid=20220517005569&lan=en-US&anchor=native+gates&index=3&md5=079f36da9e94a3122c3e063de060fdb5","contentObject":[{"type":"text","content":"native gates","gated":false}],"gated":false},{"type":"text","content":", which allows quantum application developers to explore software breakthroughs on top of IonQ hardware without having to choose from a set menu of gates.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“IonQ Forte is further proof that high-performance quantum computers can be designed and built so both qubit count and gate fidelity improve simultaneously. We expect that this will lead to quantum computers with increasing algorithmic qubit numbers that will enable the search for solutions to the most complex problems of our time,” said IonQ Chief Technology Officer, Jungsang Kim. “IonQ’s quantum systems, including Aria and Forte, are at the forefront of achieving practical utility. The most impactful quantum computing applications will come to light when leading innovators seeking new ways to tackle their formidable problems get to work with the best systems, and customize them for their unique needs. We can’t wait to get these systems in people’s hands.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe launch of Forte represents IonQ’s latest effort to push quantum computing. In March, IonQ ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fionq.com%2Fnews%2Fmarch-04-2022-ionq-presents-at-qip-2022&esheet=52721826&newsitemid=20220517005569&lan=en-US&anchor=unveiled&index=4&md5=8024b67bbcd176808bfd17d098646305","contentObject":[{"type":"text","content":"unveiled","gated":false}],"gated":false},{"type":"text","content":" an industry-standard #AQ performance benchmark set to evaluate the usefulness of a quantum computer beyond the number of physical qubits. And in February, IonQ ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fionq.com%2Fnews%2Ffebruary-10-2022-duke-ionq-new-qc-gate&esheet=52721826&newsitemid=20220517005569&lan=en-US&anchor=announced&index=5&md5=14d44c64ba2596399dc1912e71655c3c","contentObject":[{"type":"text","content":"announced","gated":false}],"gated":false},{"type":"text","content":" the development of the N-qubit Toffoli gate alongside Duke University, introducing a new way to operate on many connected qubits at once by leveraging multi-qubit communication. IonQ continues to make significant strides within its customer and partner base and executed well in Q1, delivering financial results and operational achievements that exceeded expectations. For more details, please refer to the company’s ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Finvestors.ionq.com%2Fnews%2Fnews-details%2F2022%2FIonQ-Announces-First-Quarter-2022-Financial-Results%2Fdefault.aspx&esheet=52721826&newsitemid=20220517005569&lan=en-US&anchor=Q1+2022+financial+results&index=6&md5=5c7c1f908e0f35cb822d81b38a020f16","contentObject":[{"type":"text","content":"Q1 2022 financial results","gated":false}],"gated":false},{"type":"text","content":" announced on May 16, 2022.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About IonQ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIonQ, Inc. is a leader in quantum computing, with a proven track record of innovation and deployment. IonQ's current generation quantum computer, IonQ Forte, is the latest in a line of cutting-edge systems, including IonQ Aria, a system that boasts of industry-leading 20 algorithmic qubits. Along with record performance, IonQ has defined what it believes is the best path forward to scale. IonQ is the only company with its quantum systems available through the cloud on Amazon Braket, Microsoft Azure, and Google Cloud, as well as through direct API access. IonQ was founded in 2015 by Christopher Monroe and Jungsang Kim based on 25 years of pioneering research. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ionq.com&esheet=52721826&newsitemid=20220517005569&lan=en-US&anchor=www.ionq.com&index=7&md5=f269d6ffa49459e085c6ffb0138b5498","contentObject":[{"type":"text","content":"www.ionq.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"IonQ Forward-Looking Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Some of the forward-looking statements can be identified by the use of forward-looking words. Statements that are not historical in nature, including the words “anticipate,” “expect,” “suggests,” “plan,” “believe,” “intend,” “estimates,” “targets,” “projects,” “should,” “could,” “would,” “may,” “will,” “forecast” and other similar expressions are intended to identify forward-looking statements. These statements include those related to IonQ’s ability to further develop and advance its quantum computers and achieve scale; the expected launch of IonQ Forte for access by select developers, partners, and researchers in 2022 with broader customer access expected in 2023; the anticipated benefits of native gate access; IonQ’s market opportunity and anticipated growth; and the commercial benefits to customers of using quantum computing solutions. Forward-looking statements are predictions, projections and other statements about future events that are based on current expectations and assumptions and, as a result, are subject to risks and uncertainties. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including but not limited to: market adoption of quantum computing solutions and IonQ’s products, services and solutions; the ability of IonQ to protect its intellectual property; changes in the competitive industries in which IonQ operates; changes in laws and regulations affecting IonQ’s business; IonQ’s ability to implement its business plans, forecasts and other expectations, and identify and realize additional partnerships and opportunities; and the risk of downturns in the market and the technology industry including, but not limited to, as a result of the COVID-19 pandemic. The foregoing list of factors is not exhaustive. You should carefully consider the foregoing factors and the other risks and uncertainties described in the “Risk Factors” section of IonQ’s Quarterly Report on Form 10-Q for the quarter ended March 31, 2022 and other documents filed by IonQ from time to time with the Securities and Exchange Commission. These filings identify and address other important risks and uncertainties that could cause actual events and results to differ materially from those contained in the forward-looking statements. Forward-looking statements speak only as of the date they are made. Readers are cautioned not to put undue reliance on forward-looking statements, and IonQ assumes no obligation and does not intend to update or revise these forward-looking statements, whether as a result of new information, future events, or otherwise. IonQ does not give any assurance that it will achieve its expectations.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220517005569r2&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIonQ Media contact:\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Dillon Olagaray\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Mission North\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:press@ionq.com","contentObject":[{"type":"text","content":"press@ionq.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIonQ Investor Contact:\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:investors@ionq.com","contentObject":[{"type":"text","content":"investors@ionq.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220517005569/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220517005569/en/","gated":false}],"gated":false}],"gated":false}]}