{"id":"20220516005570","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Griffon Corporation Announces Review of Strategic Alternatives","publishedDate":"2022-05-16T08:15:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Griffon Corporation Announces Review of Strategic Alternatives","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nGriffon Corporation (“Griffon” or the “Company”) (NYSE:GFF) today announced that its Board of Directors has initiated a process to review a comprehensive range of strategic alternatives to maximize shareholder value including a sale, merger, divestiture, recapitalization or other strategic transaction. Griffon has retained Goldman Sachs & Co. LLC as its financial advisor and Dechert LLP as its legal counsel to assist in the review process.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRonald J. Kramer, Chairman and Chief Executive Officer, said “We are proud of what the Board, management and our employees have accomplished in building Griffon. We have executed a substantial transformation, which started in 2018 with the divestiture of the Plastics business and the acquisitions of ClosetMaid and Cornell Cookson. During the past four years Griffon’s operating performance has been outstanding with significant increases in profitability and free cash flow. The recent strategic acquisition of Hunter Fan Company complements and diversifies our Consumer & Professional Products segment while the announced divestiture of our defense electronics business, Telephonics, will strengthen our balance sheet.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Demonstrating the conviction in its ability to continue to deliver strong operating performance for the business, Griffon raised its fiscal year 2022 adjusted EBITDA guidance for its business segments to $475 million, an increase of $120 million or 34%, during the company’s second quarter results conference call on April 28th,” said Mr. Kramer. “Additionally, management also discussed its expectation that the company’s leverage, as calculated in accordance with Griffon’s credit agreement, will be less than 3.0x EBITDA by the end of fiscal 2022 ending September 30 (a reduction of at least 1.5x from the second quarter ended March 31), driven by second half cash generation and EBITDA performance and the proceeds from the divestiture of Telephonics.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Notwithstanding the increased guidance for fiscal 2022, and our confidence in our forward outlook, there is a profound disconnect between Griffon's share price and the underlying value of our businesses. Given this disconnect, the Board and management believe it is necessary to consider a review of alternatives, with a focus on maximizing near-term shareholder value creation. Our top priority is unlocking the true intrinsic value of Griffon for our shareholders.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThere is no timeline for this review and there is no assurance that the Board’s review will result in any transaction being entered into or consummated. Griffon does not intend to comment on the process or disclose further developments until the Board approves a specific transaction or otherwise concludes its review of strategic alternatives.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Safe Harbor Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Safe Harbor” Statements under the Private Securities Litigation Reform Act of 1995: All statements related to, among other things, income (loss), earnings, cash flows, revenue, changes in operations, operating improvements, industries in which Griffon operates and the United States and global economies that are not historical are hereby identified as “forward-looking statements” and may be indicated by words or phrases such as “anticipates,” “supports,” “plans,” “projects,” “expects,” “believes,” “should,” “would,” “could,” “hope,” “forecast,” “management is of the opinion,” “may,” “will,” “estimates,” “intends,” “explores,” “opportunities,” the negative of these expressions, use of the future tense and similar words or phrases. Such forward-looking statements are subject to inherent risks and uncertainties that could cause actual results to differ materially from those expressed in any forward-looking statements. These risks and uncertainties include, among others: current economic conditions and uncertainties in the housing, credit and capital markets; Griffon’s ability to achieve expected savings from cost control, restructuring, integration and disposal initiatives; the ability to identify and successfully consummate, and integrate, value-adding acquisition opportunities (including, in particular, integration of the Hunter Fan acquisition); increasing competition and pricing pressures in the markets served by Griffon’s operating companies; the ability of Griffon’s operating companies to expand into new geographic and product markets, and to anticipate and meet customer demands for new products and product enhancements and innovations; reduced military spending by the government on projects for which Griffon's Telephonics Corporation supplies products, including as a result of defense budget cuts or other government actions; the ability of the federal government to fund and conduct its operations; increases in the cost or lack of availability of raw materials such as resin, wood and steel, components or purchased finished goods, including any potential impact on costs or availability resulting from tariffs; changes in customer demand or loss of a material customer at one of Griffon’s operating companies; the potential impact of seasonal variations and uncertain weather patterns on certain of Griffon’s businesses; political events that could impact the worldwide economy; a downgrade in Griffon’s credit ratings; changes in international economic conditions including interest rate and currency exchange fluctuations; the reliance by certain of Griffon’s businesses on particular third party suppliers and manufacturers to meet customer demands; the relative mix of products and services offered by Griffon’s businesses, which impacts margins and operating efficiencies; short-term capacity constraints or prolonged excess capacity; unforeseen developments in contingencies, such as litigation, regulatory and environmental matters; unfavorable results of government agency contract audits of Telephonics Corporation; our strategy, future operations, prospects and the plans of our businesses, including closing of the disposition of Telephonics Corporation; Griffon’s ability to adequately protect and maintain the validity of patent and other intellectual property rights; the cyclical nature of the businesses of certain of Griffon’s operating companies; possible terrorist threats and actions and their impact on the global economy; the impact of COVID-19 on the U.S. and the global economy, including business disruptions, reductions in employment and an increase in business and operating facility failures, specifically among our customers and suppliers; Griffon's ability to service and refinance its debt; and the impact of recent and future legislative and regulatory changes, including, without limitation, changes in tax laws. Such statements reflect the views of the Company with respect to future events and are subject to these and other risks, as previously disclosed in the Company’s Securities and Exchange Commission filings. Readers are cautioned not to place undue reliance on these forward-looking statements. These forward-looking statements speak only as of the date made. Griffon undertakes no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise, except as required by law.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Griffon Corporation","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nGriffon is a diversified management and holding company that conducts business through wholly-owned subsidiaries. Griffon oversees the operations of its subsidiaries, allocates resources among them and manages their capital structures. Griffon provides direction and assistance to its subsidiaries in connection with acquisition and growth opportunities as well as in connection with divestitures. In order to further diversify, Griffon also seeks out, evaluates and, when appropriate, will acquire additional businesses that offer potentially attractive returns on capital.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nGriffon conducts its operations through three reportable segments:\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Consumer and Professional Products (“CPP”)","gated":false}],"gated":false},{"type":"text","content":" is a leading North American manufacturer and a global provider of branded consumer and professional tools; residential, industrial and commercial fans; home storage and organization products; and products that enhance indoor and outdoor lifestyles. CPP sells products globally through a portfolio of leading brands including AMES, since 1774, Hunter, since 1886, True Temper, and ClosetMaid.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Home and Building Products","gated":false}],"gated":false},{"type":"text","content":" conducts its operations through Clopay Corporation (“Clopay”). Founded in 1964, Clopay is the largest manufacturer and marketer of garage doors and rolling steel doors in North America. Residential and commercial sectional garage doors are sold through professional dealers and leading home center retail chains throughout North America under the brands Clopay, Ideal, and Holmes. Rolling steel door and grille products designed for commercial, industrial, institutional, and retail use are sold under the CornellCookson brand.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nClassified as a discontinued operation, Defense Electronics conducts its operations through Telephonics Corporation (\"Telephonics\"), founded in 1933, a globally recognized leading provider of highly sophisticated intelligence, surveillance and communications solutions for defense, aerospace and commercial customers.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFor more information on Griffon and its operating subsidiaries, please see the Company’s website at ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.griffon.com&esheet=52720768&newsitemid=20220516005570&lan=en-US&anchor=www.griffon.com&index=1&md5=527e8bfc97e58203d8e58c2ef48575a1","contentObject":[{"type":"text","content":"www.griffon.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220516005570r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nCompany:\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Brian G. Harris\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"SVP & Chief Financial Officer\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Griffon Corporation\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"(212) 957-5000\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nInvestor Relations:\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Michael Callahan\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Managing Director\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"ICR Inc.\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"(203) 682-8311\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220516005570/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220516005570/en/","gated":false}],"gated":false}],"gated":false}]}