{"id":"20220309fl86321","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"PureCycle Technologies Provides Fourth Quarter 2021 Update, Announces $250 Million Investment","publishedDate":"2022-03-09T07:00:00-06:00","body":[{"type":"text","content":"PureCycle Technologies Provides Fourth Quarter 2021 Update, Announces $250 Million Investment\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"PureCycle Technologies Provides Fourth Quarter 2021 Update, Announces $250 Million Investment","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"h2","contentObject":[{"type":"text","content":"-Announced $250 million private equity capital raise to support the build out of the Augusta, Georgia multi-line manufacturing complex and other strategic and general corporate purposes; Transaction expected to close on March 17, 2022, subject to the satisfaction of closing conditions","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"h2","contentObject":[{"type":"text","content":"-Plant 1, the first manufacturing plant in Ironton, Ohio, remains on schedule to complete construction in the fourth quarter of 2022","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"h2","contentObject":[{"type":"text","content":"-Plant 2, first multi-line purification complex in Augusta, Georgia, to break ground with initial site work construction scheduled for March 22, 2022","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"h2","contentObject":[{"type":"text","content":"-PureCycle signed letters of intent (LOI) for 60 million pounds of new feedstock from untapped waste streams that are currently landfilled or incinerated","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"h2","contentObject":[{"type":"text","content":"-PureCycle's chief manufacturing officer, Dustin Olson, has been elevated to chief operating officer","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"ORLANDO, Fla., March 9, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"ORLANDO, Fla., March 9, 2022 /PRNewswire/ -- PureCycle Technologies, Inc. (\"PureCycle\" or \"the company\") (NASDAQ: PCT), a U.S.-based advanced recycling company revolutionizing plastic waste, today announced a corporate update and financial results for the fourth quarter ending December 31, 2021. ","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n                ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n                        ","gated":false},{"type":"a","href":"https://mma.prnewswire.com/media/1730092/PureCycle_Logo.html","contentObject":[{"type":"text","content":"\n                    ","gated":false},{"type":"img","src":"https://mma.prnewswire.com/media/1730092/PureCycle_Logo.jpg","alt":"(PRNewsfoto/PureCycle Technologies)","variations":[],"gated":false},{"type":"text","content":"\n                        ","gated":false}],"gated":false},{"type":"text","content":"\n                ","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This includes entering into subscription agreements with a select group of existing stockholders including among others, Sylebra Capital and Samlyn Capital along with a new investor, SK geo centric, for a private placement of common stock and warrants (the \"Offering\"). Upon closing of the private placement, PureCycle will receive net proceeds of approximately $250 million. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Mike Otworth, PureCycle's Chairman and Chief Executive Officer, ","gated":false}],"gated":false},{"type":"text","content":"said, \"PureCycle remains intently focused on executing against its strategic growth plan and advancing the sustainable plastic revolution through our unique purification process. That growth plan is now further supported by the additional $250 million investment from our long-term shareholders and a new investor.  This transaction underscores the support from our shareholder base and highlights a vote of confidence in our technology.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Larry Somma, PureCycle's Chief Financial Officer, ","gated":false}],"gated":false},{"type":"text","content":"stated, \"PureCycle's successful announcement of our oversubscribed private placement financing marks an integral step for our company and highlights trust in our ability to execute. It is also a testament to the support we have from several of our long-term shareholders and a new investor. While we have an ambitious growth objective, this capital will provide sufficient capital to fund our business plan which includes building the first four purification lines in Augusta, the supporting feedstock pre-processing (PreP) facilities, our equity investment for the joint venture with SK geo centric and funding of general corporate purposes. This capital raise is a key element for the project debt process which is underway.  Any news related to the project debt will be provided to the market at a future time. Operationally, we expect to break ground in Augusta on March 22, 2022, and look forward to providing further details during the corporate update call.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Na Kyung-soo, CEO, SK geo centric, ","gated":false}],"gated":false},{"type":"text","content":"said, \"The welcome addition of SK geo centric to the group of investors demonstrates another strong commitment to the PureCycle technology and business plan. SK geo centric and PureCycle engaged across multiple face to face meetings to understand the key technical details as well as chart a path into South Korea and broader Asia. Our company has a strategic goal to increase the usage of recycle material into our core product platform that aligns perfectly with PureCycle's core mission. Our equity investment into the PureCycle is the first step toward a long-term strategic partnership.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Private Placement of Common Stock Details  ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"The Offering included subscription agreements with Sylebra Capital, Samlyn Capital, and partner SK geo centric. Additionally, certain members of the PCT Board of Directors participated in the Offering. Upon closing of the Offering, PureCycle will receive net proceeds of approximately $250 million, resulting from the sale of 35.7 million shares of common stock and warrants to purchase 17.9 million shares of common stock. Subject to the satisfaction of conditions to closing set forth in the securities purchase agreement, the Offering is expected to close on March 17, 2022.  Subscribers in the transaction will pay $7.00 per combination of one share of common stock and warrant to purchase one-half of a share of common stock. Each warrant will have an exercise price of $11.50 per share and can be exercisable through March 17, 2026.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The securities were offered only to accredited investors. PureCycle is required to prepare and file a resale registration statement with the Securities and Exchange Commissions (the \"SEC\") under the Securities Act of 1933, as amended (the \"Securities Act\"), covering the resale of the shares of common stock issued in the Offering and the shares of common stock issuable upon exercise of the warrants issued in the Offering. PureCycle is required to have such resale registration statement declared effective by the SEC within 60 calendar days (or 90 calendar days in the event of a \"full review\" by the SEC) following the closing of the Offering. The securities being sold in the Offering are being sold and issued without registration under the Securities Act, in reliance on the exemptions provided by Section 4(a)(2) of the Securities Act as a transaction not involving a public offering and/or Rule 506 promulgated thereunder, and in reliance on similar exemptions under applicable state laws. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Liquidity and Capital Resources","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"text","content":"Total liquidity of $431.2 million including $200.7 million of cash, cash equivalents and debt securities available for sale and $230.5 million in restricted cash. PureCycle had $249.6 million in debt and accrued interest, less $17.1 million of discount and issuance costs as of December 31, 2021. Plant 1's original budget was $242.1 million, which was funded through bond financing. As of December 31, 2021, the remaining capital allocated from the bond funds was $121.4 million.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Operational Update","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"PureCycle's chief manufacturing officer, Dustin Olson, has been elevated to chief operating officer. This change reflects the integral role Olson plays within PureCycle and will continue to shepherd key projects through to completion such as the Ironton and Augusta facilities. The company's first manufacturing facility in Ironton, Ohio continues to progress and remains on schedule. With up to 220 construction craftsmen on site daily, 90% of utilities equipment, and 65% of PreP equipment on site daily, PureCycle is on track for completion in the fourth quarter of 2022. PureCycle's partnership with Gulfspan has allowed the company to build facilities at a much faster rate and module construction is progressing with all 26 modules on site at Gulfspan's facility. With module construction on track, the company remains confident in the previously disclosed timeline for the completion of PureCycle's flagship facility, which will have a production capacity of 107 million pounds per year of Ultra-Pure Recycled (UPR) resin. PureCycle expects the Ironton feedstock preprocessing facility (PreP) to be operational in the third quarter of 2022.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The first multi-line purification complex in Augusta, Georgia is scheduled to break ground on March 22, 2022. The multi-line purification complex is designed to support up to 8 lines and produce up to 1.04 billion pounds of UPR resin per year. PureCycle has implemented strategic decisions to strengthen the company's business model to mitigate and anticipate ever-changing market conditions. This includes an early decision to ensure all facilities are Born Digital, which aides in reducing the commissioning timeline. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PureCycle previously announced its first non-binding head of agreement (HOA) with SK geo centric to open Asia's first UPR resin facility in Ulsan, South Korea, advancing the company's joint discussions following the memorandum of understanding (MOU) signed in August 2021. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Feedstock and Commercial Update ","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"In the fourth quarter, PureCycle signed letters of intent (LOI) for 60 million pounds of new feedstock within the post-consumer, non-curbside waste stream, a stream that is not currently moving through the market and is either landfilled or incinerated. PureCycle's feedstock supply pipeline comprises three diverse types of waste streams: post-consumer non-curbside. post-consumer curbside, and post-industrial. PureCycle recently passed partner tests at our Feedstock Evaluation Unit for impact polymer which opens, for the first time, the automotive feedstock market.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PureCycle's regionalized PreP strategy is expected to deliver strong economics and feed security. Through this strategy, new feedstock sources should be more easily accessible and the PreP facilities themselves are currently expected to generate a return on investment within 3 years. Further, regional PreP facilities will play a key role in our optimization of sort operations to extract No. 5 plastic waste regardless of the quality of the mixed bales. These facilities will play a key role in our overall strategy and are designed to diversify our feed system. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The Central Florida PreP facility, which is designed to provide feedstock to Augusta, remains on schedule and is expected to be operational in the third quarter of 2022. This facility will have the capacity to process 75 million pounds of polypropylene feedstock per year with a scalable annual capacity of 150 million pounds. Conversations with Titus in California are progressing for a second regional PreP facility and site selection for an additional U.S. PreP facility in the Northeast is underway. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PureCycle continues to see strong demand across the packaging and consumer goods segments, and continued market acceptance of the company's feedstock+ pricing model. PureCycle added 164 million pounds to the pipeline in the fourth quarter and has a total sales pipeline of 822 million pounds. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The company commissioned an independent Life Cycle Assessment (LCA) that was conducted based on the final design of the Ironton facility and without operational data. The LCA shows the Ironton facility is expected to be below new fossil-fueled derived polypropylene across both carbon emissions and energy consumption. PureCycle effectively improves customer value proposition with a tangible alternative to expensive carbon credit purchase programs.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PureCycle received follow up questions from the FDA regarding its previously filed Letter of No Objection (LNO) and as such, amended the request for a LNO for categories C-G, which covers many products that consumers use on a regular basis. The company anticipates additional submissions designed to expand approved feedstocks and enter into extreme heat applications (COU: A,B,H).","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release shall not constitute an offer to sell or the solicitation of an offer to buy any of the securities described herein, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction. Any offering of these securities under the resale registration statement will only be by means of a prospectus.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Conference Call Details","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"The company will hold a conference call today at 11:00 a.m. ET to provide an update on recent corporate developments, including activity from the fourth quarter and updated future strategic plans.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Fourth Quarter 2021 Conference Call Details","gated":false},{"type":"br","gated":false},{"type":"text","content":"Date: Wednesday, March 9, 2022","gated":false},{"type":"br","gated":false},{"type":"text","content":"Time: 11:00 a.m. ET  ","gated":false},{"type":"br","gated":false},{"type":"text","content":"Toll-free dial-in number: (855) 940-5314","gated":false},{"type":"br","gated":false},{"type":"text","content":"International dial-in number: (929) 517-0418","gated":false},{"type":"br","gated":false},{"type":"text","content":"Conference ID: 1062349","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Please call the conference telephone number 5-10 minutes prior to the start time. An operator will register your name and organization. If you have any difficulty connecting with the conference call, please contact Gateway Investor Relations at (949) 574-3860.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The conference call will have a live Q&A session and be available for replay ","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3467409-1&h=2619211330&u=https%3A%2F%2Fedge.media-server.com%2Fmmc%2Fp%2F84a7sdrc&a=here","contentObject":[{"type":"text","content":"here","gated":false}],"gated":false},{"type":"text","content":" and on the Company's website at ","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3467409-1&h=2587015676&u=http%3A%2F%2Fwww.purecycle.com%2F&a=www.purecycle.com","contentObject":[{"type":"text","content":"www.purecycle.com","gated":false}],"gated":false},{"type":"text","content":". A replay of the conference call will be available after 2 p.m. Eastern time on the same day through March 16, 2022, via the information below:","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Toll-free replay number: (855) 859-2056","gated":false},{"type":"br","gated":false},{"type":"text","content":"International replay number: (404) 537-3406","gated":false},{"type":"br","gated":false},{"type":"text","content":"Replay ID: 1062349","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"This press release contains forward-looking statements, including statements about the financial condition, the closing of the Offering, the expected use of proceeds therefrom and prospects of PCT. In addition, any statements that refer to projections, forecasts or other characterizations of future events or circumstances, including any underlying assumptions, are forward-looking statements. Forward-looking statements are typically identified by words such as \"plan,\" \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"outlook,\" \"estimate,\" \"forecast,\" \"project,\" \"continue,\" \"could,\" \"may,\" \"might,\" \"possible,\" \"potential,\" \"predict,\" \"should,\" \"would\" and other similar words and expressions, but the absence of these words does not mean that a statement is not forward-looking.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The forward-looking statements are based on the current expectations of the management of PCT and are inherently subject to uncertainties and changes in circumstances and their potential effects and speak only as of the date of such statement. There can be no assurance that future developments will be those that have been anticipated. These forward-looking statements involve a number of risks, uncertainties or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. These risks and uncertainties include, but are not limited to, those factors described in the section of PCT's Quarterly Report on Form 10-Q entitled \"","gated":false},{"type":"i","contentObject":[{"type":"text","content":"Risk Factors","gated":false}],"gated":false},{"type":"text","content":",\" those discussed and identified in public filings made with the SEC by PCT and the following:","gated":false},{"type":"br","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[],"gated":false},{"type":"ul","contentObject":[{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to satisfy all conditions to closing for the Offering and to consummate the transaction in a timely manner, or at all; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to meet, and to continue to meet, applicable regulatory requirements for the use of PCT's UPR in food grade applications (both in the United States and abroad); ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to comply on an ongoing basis with the numerous regulatory requirements applicable to the UPR and PCT's facilities (both in the United States and abroad); ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"expectations and changes regarding PCT's strategies and future financial performance, including its future business plans, expansion plans or objectives, prospective performance and opportunities and competitors, revenues, products and services, pricing, operating expenses, market trends, liquidity, cash flows and uses of cash, capital expenditures, and PCT's ability to invest in growth initiatives; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to scale and build the Ironton, Ohio plant in a timely and cost-effective manner;","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to complete the necessary financing with respect to, and complete the construction of, its first U.S. cluster facility, located in Augusta, Georgia (the \"Augusta Facility\"), in a timely and cost-effective manner; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to sort and process polypropylene plastic at its plastic waste prep (\"Feed PreP\") facilities; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to maintain exclusivity under the Procter & Gamble Company license; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the implementation, market acceptance and success of PCT's business model and growth strategy; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the success or profitability of PCT's offtake arrangements; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the ability to source feedstock with a high polypropylene content; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's future capital requirements and sources and uses of cash;","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to obtain funding for its operations and future growth;","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"developments and projections relating to PCT's competitors and industry; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the outcome of any legal or regulatory proceedings to which PCT is, or may become a party, including the recently filed securities class action case and the ongoing SEC investigation; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the ability to recognize the anticipated benefits of the business combination; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"unexpected costs related to the business combination; ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"geopolitical risk and changes in applicable laws or regulations;","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the possibility that PCT may be adversely affected by other economic, business, and/or competitive factors;","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"operational risk; and","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the risk that the COVID-19 pandemic, including any variants and the efficacy and distribution of vaccines, and local, state, federal and international responses to addressing the pandemic may have an adverse effect on PCT's business operations, as well as PCT's financial condition and results of operations. ","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Should one or more of these risks or uncertainties materialize or should any of the assumptions made by the management of PCT prove incorrect, actual results may vary in material respects from those projected in these forward-looking statements.","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"All subsequent written and oral forward-looking statements or other matters attributable to PCT or any person acting on their behalf are expressly qualified in their entirety by the cautionary statements contained or referred to in this press release. Except to the extent required by applicable law or regulation, PCT undertakes no obligation to update these forward-looking statements to reflect events or circumstances after the date of this press release or to reflect the occurrence of unanticipated events.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"About PureCycle Technologies","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"PureCycle Technologies LLC, a subsidiary of PureCycle Technologies, Inc., holds a global license to commercialize the only patented, solvent-based purification recycling technology, developed by The Procter & Gamble Company (P&G), for restoring waste polypropylene (PP) into ultra-pure resin. The proprietary process removes color, odor and other contaminants from recycled feedstock resulting in an ultra-pure polypropylene suitable for any PP market. To learn more, visit","gated":false},{"type":"b","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false},{"type":"u","contentObject":[{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3467409-1&h=1632341130&u=https%3A%2F%2Fpurecycle.com%2F&a=purecycle.com","contentObject":[{"type":"text","content":"purecycle.com","gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Company Contact:","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Anna Farrar","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:afarrar@purecycle.com","contentObject":[{"type":"text","content":"afarrar@purecycle.com","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"text","content":"(954) 647-7059","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Investor Relations Contact:","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Georg Venturatos","gated":false},{"type":"br","gated":false},{"type":"text","content":"Gateway Investor Relations","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:PCT@GatewayIR.com","contentObject":[{"type":"text","content":"PCT@GatewayIR.com","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"text","content":"(949) 574-3860","gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=FL86321&sd=2022-03-09","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content to download multimedia:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/purecycle-technologies-provides-fourth-quarter-2021-update-announces-250-million-investment-301498786.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/purecycle-technologies-provides-fourth-quarter-2021-update-announces-250-million-investment-301498786.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  PureCycle Technologies","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false}]}