{"id":"2021120666","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"A new study finds that most COVID-19 boosters strengthen immunity, though there is no winning shot","publishedDate":"2021-12-06T06:08:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Jaimy Lee ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Moderna's COVID-19 shot produced the greatest increase in antibody levels in the trial ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The first study directly comparing COVID-19 boosters found that most shots improved immune responses in fully vaccinated people, but there is no obvious \"winner\" to help make a decision. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"In terms of a 'best' booster, there is no definitive winner, but there are some losers,\" SVB Leerink analysts told investors on Friday. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The research, which was published Thursday in The Lancet, assessed booster shots in about 2,900 people in the U.K. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  It compared a mix of full and half doses of the vaccines developed by BioNTech SE (BNTX) and Pfizer Inc. (PFE), Novavax Inc. (NVAX), and Valneva SE , as well as a full dose of the AstraZeneca (AZN.LN), CureVac (CVAC), Johnson & Johnson (JNJ), and Moderna Inc. (MRNA) shots. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (The trial was conducted back in June; since then, CureVac scrapped development of its first-generation COVID-19 vaccine candidate. Valneva and Novavax are still seeking authorization for their vaccines in the U.K. The other shots have received authorization there.) ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The participants in the U.K. clinical trial were all fully vaccinated with either AstraZeneca's vaccine or Comirnaty, BioNTech and Pfizer's shot. The study only included people older than 30 years old who have never tested positive for the virus. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In short, nearly all of the vaccines in the study produced an immune response among the participants, though the type of response differed. (The people who were initially immunized with AstraZeneca's shot did not generate a different immune response with the same shot as a booster.) ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  According to the SVB Leerink analysts, a full dose of Moderna's vaccine produced the highest antibody titers. (In both the U.S. and the U.K., Moderna's booster is authorized as a half dose.) Novavax's shot was the best tolerated, in terms of side effects. The J&J shot drove up T-cells more than the others--a point of particular interest now that there are concerns that the omicron variant can reduce antibody protection. Comirnaty, the analysts told investors, is the \"decathlete\" of the group, based on how it generates both antibody and T-cell response. And, finally, as stated, AstraZeneca's shot doesn't do very much as a booster among people already immunized with the same vaccine. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The authors of the study recommended that policymakers and national immunization committees \"establish criteria for choosing which booster vaccines to use in their populations.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The U.S. is not doing this, at least at this time. Mixing and matching COVID-19 shots has been allowed by the Food and Drug Administration since October That means, for example, that people who got the single-shot J&J vaccine can choose between a second J&J jab or a booster dose of Comirnaty or Moderna's vaccine. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The decision to allow mixing and matching vaccines in the U.S. stems from a preliminary study, also called a preprint, that was conducted by National Institutes of Health. That research found that antibody levels were highest from a Moderna booster, then Pfizer, and then J&J; however, the study wasn't designed to compare the vaccine combinations. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  For Americans seeking guidance about which booster to get, the U.S. has stopped short of telling people what is the best booster based on their primary vaccination series and is instead encouraging people to sign up for whatever shot they choose. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We will not articulate a preference,\" Dr. Rochelle Walensky, director of the Centers for Disease Control and Prevention, said Oct. 22. \"My understanding is that most people will have done largely well with the initial vaccine that they got and may express a preference, very much, for the original vaccine series they got...There may be some people who might prefer another vaccine over the one that they received, and the current CDC recommendations now make that possible.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  That said, federal health officials in the U.S. continue to urge people who were vaccinated before June to get a booster shot. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"There's every reason to believe that if you get vaccinated and boosted that you would have at least some degree of cross protection, very likely against severe disease, even against the omicron variant,\" Dr. Anthony Fauci, the president's chief medical adviser, said during a press briefing on Friday. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read more of MarketWatch's coverage about COVID-19 boosters: ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  People who got J&J's COVID-19 shot can get a booster. Which one should they get? ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Here's why COVID-19 booster shots are good for business ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Allowing people to mix COVID-19 vaccines could cut into Pfizer and Moderna's revenue next year ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Jaimy Lee ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  12-06-21 0708ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2021 Dow Jones & Company, Inc.","gated":false}]}