{"id":"20220517249","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Here's how Biden could move to cancel student loans","publishedDate":"2022-05-17T08:42:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Victor Reklaitis ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  President promises in late April to roll out a plan for forgiving federal student debt 'in the next couple of weeks' ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  President Joe Biden made headlines on April 28 by saying he'll roll out a plan for canceling federal student loans \"in the next couple of weeks\" -- and that he'll aim to forgive less than $50,000 in debt per borrower. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  So what's likely to happen actually? ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  A Biden move to wipe out some student loans through \"executive action, with the sweep of a pen,\" would look smart politically before November's midterm elections, but it easily could end up blocked by the court system, said Mark Kantrowitz, an expert on student loans, in a recent interview. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  A second option, according to Kantrowitz, would be for Biden's Education Department to make a regulatory change that delivers broad forgiveness, with that approach \"much more likely to survive legal challenge.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The third and best route is for the president to work with U.S. lawmakers to enact a law that cancels student debt, as Congress has the \"power of the purse\" and there wouldn't be trouble with lawsuits, reckons Kantrowitz, who is the author of books such as \"Twisdoms about Paying for College\" and \"How to Appeal for More College Financial Aid.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Limiting forgiveness to borrowers who owe $10,000 or less would keep the price tag at $75 billion, but still completely eliminate federal student-loan debt for a third of all borrowers, or more than 15 million people, the expert said, citing a recent policy paper that he wrote. And that \"cheap\" price tag might attract support from Democratic and Republican lawmakers. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The problem with the legislative approach is Congress has struggled to pass substantive bills in recent years, and the \"only thing that gets through is naming a post office,\" he said. The White House has repeatedly said Biden would sign into law a bill wiping out $10,000 per borrower, but no such measure is close to coming to the president's desk. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Republican lawmakers have expressed opposition to forgiveness for student loans, with Sen. Tom Cotton of Arkansas saying such debt is \"no different than small business loans or car loans\" and \"must be paid back.\" Sen. Mitt Romney of Utah has said it's a \"bribe\" by Democrats as they face \"desperate\" polling ahead of the midterms. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  So hence the buzz around Option 1 -- executive action. Biden is considering that route and would forgive at least $10,000 per borrower, according to multiple published reports citing unnamed sources. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The president, who has long supported canceling up to $10,000, could announce his executive action when he gives the commencement address on May 28 at the University of Delaware, Kantrowitz said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"If he was going to announce something, that would be the perfect time,\" he told MarketWatch. Biden earned a bachelor's degree at the university in 1965, before heading to Syracuse for law school. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Finalizing details around the executive action could take a while, and there might not be a lawsuit that can block the forgiveness \"until they actually have a pronounced policy,\" Kantrowitz said. It's also possible, he said, that there could be a preliminary injunction well before the midterm elections, and then Biden's move to cancel student debt would be in the rearview mirror by November, leaving some voters to think, \"What have you done for me today?\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"But if he times it right -- right before the midterm election -- and maybe does more than $10,000, then it sets up a sharp divide between Democrats and Republicans, where the voters will see that the Democrats support loan forgiveness, while Republicans are opposed,\" Kantrowitz said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"So the key there is to not have the final court ruling before the elections, because then it's old news.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Student loan-issues have been election winners for Democrats in the past, as that party fared well in 2006 after pledging to cut student-loan interest rates in half, Kantrowitz said, adding that he tries to \"avoid politics as much as possible\" and aims to \"be neutral.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Biden's authority to cancel student debt seen as 'wishful thinking' ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  While advocates for debtors have argued that U.S. presidents have the authority to forgive student loans, Kantrowitz doesn't buy their view, saying it's \"basically wishful thinking.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The advocates point to waiver authority granted to the secretary of education in the Higher Education Act of 1965. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  One problem, however, is that a preamble limits this authority to the programs already approved by Congress, Kantrowitz said. Another problem is that 'in this part' language establishes a link just to an old guaranteed student loan program that ended in 2010. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Kantrowitz said it's also a \"misreading of the law\" to see waiver authority from the Heroes Act of 2003 that would allow for broad loan forgiveness. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  He views the Supreme Court, which currently has a 6-3 conservative majority, as likely to block any Biden executive action that's aiming to deliver broad cancellation of student debt. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  If Biden administration officials' \"actually want to provide forgiveness,\" and their top goal isn't \"setting themselves up for election success,\" then they should rely on regulatory action, rather than executive orders, Kantrowitz said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Related:Canceling student debt unlikely to stand up in court, ex-Education Department lawyer says ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Proposal based on regulatory change sparks 'firestorm' ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  A proposal from Kantrowtiz that relies on a regulatory change is based on the fact that existing income-based repayment plans are already loan-forgiveness programs, with debt wiped out after 20 years or 25 years. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"You could cut the forgiveness period down to five years,\" Kantrowitz told MarketWatch. People who already have been in income-driven repayment plans for five years would have their debts immediately forgiven, while others wouldn't get the immediate cancellation they want, but it would come in years rather than decades, and their monthly payments would be limited if they're not high earners. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Kantrowitz outlined this proposal in a blog post in late March, and he said it had an effect on Education Department officials, who hadn't had this type of approach on their radar. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"I do have my spies in the department, and I've gotten some hints that it did light a firestorm,\" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Opposition to forgiving student loans, companies affected ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Critics of forgiveness stress that it's far from a long-term solution. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"They forgive student loans and then what?\" tweeted Brian Riedl, a senior fellow at the conservative Manhattan Institute who is focused on budget, tax and economic policy. \"The same lenders keep lending. Students borrow even more expecting their round of forgiveness too. Colleges nudge up tuition more for these less-price-sensitive students. We're in the same mess 5 years from now, with more bailouts.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Kantrowitz said limiting the amount canceled to a figure like $10,000 somewhat \"minimizes the potential for moral hazard, because the borrowers will realize that they're still going to be stuck repaying some of their student loans.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Americans object to other taxpayer-funded programs that they don't benefit from, \"but for some reason people seem to take the student-loan forgiveness issue more personally, and it gets under their skin,\" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The expert on financial aid also said limiting forgiveness based on earnings could prove tricky, as the Internal Revenue Service likely would want borrowers to approve any sharing of their income data with the Education Department. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The problem with means-testing is then you can't make it automatic. You have to have an application process,\" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Jen Psaki, the former White House press secretary, told reporters on May 3 that Biden talked during the 2020 presidential campaign about wanting to \"help people making less than $125,000 a year, so that is the frame through which he's making considerations at this point.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Her comment came after a Washington Post report said administration officials have looked at limiting the aid to undergraduate debt and to individuals who earn no more than$125,000 or $150,000, with the cutoff for joint filers at $250,000 or $300,000. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Related:Here's how to craft student-loan forgiveness in a way that cuts out those who don't need help ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  On Tuesday, the new White House press secretary, Karine Jean-Pierre, told reporters that she didn't have any updates on a final decision on debt cancellation, saying: \"We have no policy to announce yet.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Some public companies could be hurt by forgiveness, said a Height Capital Markets analyst. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Student loan forgiveness could result in student loan servicing fee pressure for servicers, such as Nelnet (NNI). It could also reduce student loan refinancings for companies, such as Navient (NAVI) and SoFi Technologies (SOFI),\" Height's Edwin Groshans said in a recent note. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  This is an updated version of a report that was first published on May 2, 2022. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Victor Reklaitis ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-17-22 0942ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}