{"id":"20220517356","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Elon Musk says Twitter deal 'cannot move forward' without clarity on bots, but Twitter is committed to original terms","publishedDate":"2022-05-17T12:53:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Barbara Kollmeyer and Emily Bary ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Musk is widely thought to be pushing the bot issue as a way to seek a lower price on Twitter deal--or back out entirely ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  As Tesla Inc. Chief Executive Elon Musk said he was unwilling to move ahead with his $44 billion purchase of Twitter Inc. until the company provided more information about the prevalence of spam on the service, the social-media company reiterated its commitment to closing the deal under its original terms. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Musk has been battling publicly with Twitter (TWTR) in recent days over the presence of spam bots on the platform, suggesting that bots make up a greater portion of the Twitter user base than the company has disclosed in its filings. Parag Agrawal, Twitter's current chief executive, maintained Monday that bots make up fewer than 5% of the platform's monetized daily active users, and provided information about how the company assesses the legitimacy of accounts, but that discussion didn't satisfy Musk. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See more: Twitter CEO fires back at Elon Musk, who responds with poop emoji ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Yesterday, Twitter's CEO publicly refused to show proof\" that spam bots represent less than 5% of users, Musk said in a Tuesday morning tweet. \"This deal cannot move forward until he does.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Musk said his original offer was \"based on Twitter's SEC filings being accurate\" and floated the possibility that 20% or more of Twitter's users could be fake or spam accounts. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Musk reportedly also addressed the issue at a Miami conference Monday, offering the same view that bots could make up at least 20% of Twitter users, according to Bloomberg News. He reportedly shared, as well, that a deal could be possible at a lower price. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Twitter, meanwhile, reiterated its intent to close the deal under the previously agreed-upon conditions. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Twitter is committed to completing the transaction on the agreed price and terms as promptly as practicable,\" the company said in a Tuesday morning release. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Musk's beef over Twitter's spam activity has been widely viewed as an attempt by the Tesla boss to negotiate a lower price for the deal or back out entirely. Shares of other social-media names have fallen since the deal was announced, as have shares of Tesla. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Twitter's stock had fallen for seven straight trading sessions but was on track to snap that streak Tuesday. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We believe that Musk is using his investigation into the % of fake TWTR accounts as an excuse to pay below $54.20/share,\" Jefferies analyst Brent Thill wrote late Monday. \"In reality, the NASDAQ COMP is down 25% YTD and Elon Musk realizes that he may be overpaying for the asset.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Wedbush analyst Dan Ives added that \"the chances of a deal ultimately getting done\" are \"not looking good now and it's likely a 60%+ chance from our view Musk ultimately walks from the deal and pays the breakup fee.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  As for the funding of the tumultuous deal, the New York Post reported that SpaceX plans to sell existing shares starting Tuesday and Musk may be a seller of those shares. The article cited sources who said Musk has been finding it challenging and expensive to raise more cash for his Twitter takeout. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Barbara Kollmeyer ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-17-22 1353ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}