{"id":"20220412ny22063","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"MongoDB Announces a Pay-As-You-Go Offering on Google Cloud","publishedDate":"2022-04-12T08:00:00-05:00","body":[{"type":"text","content":"MongoDB Announces a Pay-As-You-Go Offering on Google Cloud\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"MongoDB Announces a Pay-As-You-Go Offering on Google Cloud","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"NEW YORK, April 12, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"i","contentObject":[{"type":"text","content":"Google console integration will simplify discoverability, subscription, onboarding, and management of MongoDB Atlas when running on Google Cloud","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"NEW YORK, April 12, 2022 /PRNewswire/ -- ","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3502122-1&h=378224040&u=https%3A%2F%2Fwww.mongodb.com%2F&a=MongoDB%2C+Inc.","contentObject":[{"type":"text","content":"MongoDB, Inc.","gated":false}],"gated":false},{"type":"text","content":" (NASDAQ: MDB), the leading modern, general purpose database platform, today announced the launch of a ","gated":false},{"type":"u","contentObject":[{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3502122-1&h=3387916999&u=https%3A%2F%2Fconsole.cloud.google.com%2Fmarketplace%2Fproduct%2Fmongodb%2Fmdb-atlas-self-service&a=pay-as-you-go+","contentObject":[{"type":"text","content":"pay-as-you-go ","gated":false}],"gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3502122-1&h=3332208301&u=https%3A%2F%2Fconsole.cloud.google.com%2Fmarketplace%2Fproduct%2Fmongodb%2Fmdb-atlas-self-service&a=MongoDB+Atlas+offering","contentObject":[{"type":"text","content":"MongoDB Atlas offering","gated":false}],"gated":false}],"gated":false},{"type":"text","content":", which can be launched directly from the Google Console. The offering provides developers with a simplified subscription experience, and enterprises more choice in how they procure MongoDB on Google Cloud. With this new pay-as-you-go MongoDB Atlas offering, customers only pay for the resources they use and can scale based on their needs, with no up-front commitments while using their Google accounts. This offering will also make it easier for customers to build, scale, and manage data-rich applications with MongoDB Atlas within the Google Cloud Console.","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n                ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n                        ","gated":false},{"type":"a","href":"https://mma.prnewswire.com/media/384058/MongoDB_Logo.html","contentObject":[{"type":"text","content":"\n                    ","gated":false},{"type":"img","src":"https://mma.prnewswire.com/media/384058/MongoDB_Logo.jpg","alt":"MongoDB","variations":[],"gated":false},{"type":"text","content":"\n                        ","gated":false}],"gated":false},{"type":"text","content":"\n                ","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The addition of a pay-as-you-go-offering aligns well with how companies want to build modern applications– from bootstrap companies participating in the Google for Startups and MongoDB Startup programs, ranging to the largest, most complex Enterprises. This new offering is available through Google Marketplace, giving companies and resellers of all sizes more flexibility in selecting the technology stack and partners that best fit their needs.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"Our business has shifted significantly over the last few years with the majority of our revenue now coming through e-commerce related technology for ordering. We realized it was becoming difficult and cost-prohibitive to build modern cloud-native applications capable of scaling seamlessly for these higher volumes using relational database technology,\" said Murali Bandaru, EVP and Chief Information and Digital Officer, American Tire Distributors. \"We embraced MongoDB on Google Cloud because its document data model enabled our developers to build cloud-native applications faster to support our volume growth in digital channels. We've since migrated to MongoDB Atlas and have over 50 clusters across 350 databases that are handling 250 million calls and 100 million events daily.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Customers love MongoDB Atlas because it provides developers with a multi-cloud database service built for resilience, scale, and security. With MongoDB Atlas, developers can build upon a trusted foundation that enables them to work with data the way they want – easily. MongoDB enables developers to integrate ","gated":false},{"type":"u","contentObject":[{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3502122-1&h=3071188337&u=https%3A%2F%2Fconsole.cloud.google.com%2Fmarketplace%2Fproduct%2Fmongodb%2Fmdb-atlas-self-service&a=Atlas+with+Google+Cloud","contentObject":[{"type":"text","content":"Atlas with Google Cloud","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" products including BigQuery, Apigee, Tensorflow, Cloud Run, App Engine, EventArc, Cloud Functions, DataStream, Google Kubernetes Engine (GKE), Dataproc, Dataflow, and Pub/Sub. In addition to these offerings, MongoDB and Google Cloud have expanded their joint reach across 28 global regions, including the recent availability in Toronto and Santiago.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Recently, MongoDB and Google Cloud made it easier and ","gated":false},{"type":"u","contentObject":[{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3502122-1&h=2740220640&u=https%3A%2F%2Fwww.mongodb.com%2Fblog%2Fpost%2Ffaster-migrations-mongodb-atlas-google-cloud-migvisor-by-epam&a=faster+for+customers+to+migrate","contentObject":[{"type":"text","content":"faster for customers to migrate","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" their workloads to MongoDB Atlas on Google Cloud with migVisor by EPAM and Google Cloud StratoZone. Previously applicable only to migrations from RDBMS to cloud-based RDBMS, migVisor is now available for MongoDB On-Premises to MongoDB Atlas migrations. With the StratoZone assessment tool, customers can automatically discover existing infrastructure from any environment, analyze the cost-benefits of MongoDB on Google cloud, and plan the migration. The ability to assess the complexity of migrations helps customers prioritize and accelerate their journey to the public cloud.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"MongoDB and Google Cloud have a long-standing partnership, focused on driving customer success across multiple industries, such as financial services and retail, at a global scale. Developers benefit by having MongoDB Atlas now featured in the database section of Google Cloud's console, increasing the visibility and velocity of Atlas with a wider group of users,\" said Alan Chhabra, Executive Vice President of Worldwide Partners, MongoDB. \"Together, Google Cloud and MongoDB will continue to work with organizations looking to streamline cloud migrations and modernize application development in order to provide their customers with a first class experience.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"Data is fundamental to digital transformation,\" said Kevin Ichhpurani, Corporate Vice President, Global Ecosystem at Google Cloud. \"Expanding the availability and simplifying the deployment of MongoDB Atlas on Google Cloud will make it even easier for customers to benefit from MongoDB's capabilities alongside those of Google's data cloud, providing greater capability and opportunity to utilize their data as they digitally transform.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"For more information on how to get started, visit ","gated":false},{"type":"u","contentObject":[{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3502122-1&h=1440824988&u=https%3A%2F%2Fconsole.cloud.google.com%2Fmarketplace%2Fproduct%2Fmongodb%2Fmdb-atlas-self-service&a=MongoDB+Atlas+on+Google+Cloud+","contentObject":[{"type":"text","content":"MongoDB Atlas on Google Cloud ","gated":false}],"gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3502122-1&h=2233547092&u=https%3A%2F%2Fconsole.cloud.google.com%2Fmarketplace%2Fproduct%2Fmongodb%2Fmdb-atlas-self-service&a=Marketplace","contentObject":[{"type":"text","content":"Marketplace","gated":false}],"gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3502122-1&h=3864984210&u=https%3A%2F%2Fconsole.cloud.google.com%2Fmarketplace%2Fproduct%2Fmongodb%2Fmdb-atlas-self-service&a=.","contentObject":[{"type":"text","content":".","gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"About MongoDB","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"MongoDB is the leading modern, general purpose database platform empowering innovators to create, transform, and disrupt industries by unleashing the power of software and data. Headquartered in New York, MongoDB has more than 33,000 customers in over 100 countries. The MongoDB database platform has been downloaded over 240 million times and there have been more than 1.5 million registrations for MongoDB University courses.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release includes certain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, or the Securities Act, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements regarding initiatives relating to new integrations to simplify discoverability, subscription, onboarding, and management of MongoDB Atlas when running on Google Cloud. These forward-looking statements include, but are not limited to, plans, objectives, expectations and intentions and other statements contained in this press release that are not historical facts and statements identified by words such as \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"will,\" \"would\" or the negative or plural of these words or similar expressions or variations. These forward-looking statements reflect our current views about our plans, intentions, expectations, strategies and prospects, which are based on the information currently available to us and on assumptions we have made. Although we believe that our plans, intentions, expectations, strategies and prospects as reflected in or suggested by those forward-looking statements are reasonable, we can give no assurance that the plans, intentions, expectations or strategies will be attained or achieved. Furthermore, actual results may differ materially from those described in the forward-looking statements and are subject to a variety of assumptions, uncertainties, risks and factors that are beyond our control including, without limitation: the impact that the precautions we have taken in our business relative to the ongoing COVID-19 pandemic may have on our business; the financial impacts of the COVID-19 pandemic on our customers, our potential customers, the global financial markets and our business and future operating results; our potential failure to meet publicly announced guidance or other expectations about our business and future operating results; our limited operating history; our history of losses; failure of our database platform to satisfy customer demands; the effects of increased competition; our investments in new products and our ability to introduce new features, services or enhancements; our ability to effectively expand our sales and marketing organization; our ability to continue to build and maintain credibility with the developer community; our ability to add new customers or increase sales to our existing customers; our ability to maintain, protect, enforce and enhance our intellectual property; the growth and expansion of the market for database products and our ability to penetrate that market; our ability to integrate acquired businesses and technologies successfully or achieve the expected benefits of such acquisitions; our ability to maintain the security of our software and adequately address privacy concerns; our ability to manage our growth effectively and successfully recruit and retain additional highly-qualified personnel; and the price volatility of our common stock. These and other risks and uncertainties are more fully described in our filings with the Securities and Exchange Commission (\"SEC\"), including under the caption \"Risk Factors\" in our Annual Report on Form 10-K for the year ended January 31, 2022 filed with the SEC on March 18, 2022 and other filings and reports that we may file from time to time with the SEC. Except as required by law, we undertake no duty or obligation to update any forward-looking statements contained in this release as a result of new information, future events, changes in expectations or otherwise.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Investor Relations","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Brian Denyeau","gated":false},{"type":"br","gated":false},{"type":"text","content":"ICR for MongoDB","gated":false},{"type":"br","gated":false},{"type":"text","content":"646-277-1251","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:ir@mongodb.com","contentObject":[{"type":"text","content":"ir@mongodb.com","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Media Relations","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Matt Trocchio","gated":false},{"type":"br","gated":false},{"type":"text","content":"MongoDB","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:communications@mongodb.com","contentObject":[{"type":"text","content":"communications@mongodb.com","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=NY22063&sd=2022-04-12","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content to download multimedia:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/mongodb-announces-a-pay-as-you-go-offering-on-google-cloud-301523764.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/mongodb-announces-a-pay-as-you-go-offering-on-google-cloud-301523764.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  MongoDB, Inc.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false}]}