{"id":"20211018383","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"U.S. may soon authorize boosters for all 3 in-use vaccines, as experts renew plea for unvaccinated to get their shots","publishedDate":"2021-10-18T14:00:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Colin Powell's death from complications of COVID shows need for boosters for seniors with compromised immune systems, say experts ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  A Food and Drug Administration advisory committee voted unanimously Friday that allowing adults who were initially vaccinated with the Johnson & Johnson one-dose vaccine against COVID-19 to get a booster is safe and effective, freeing the agency to authorize its use. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The committee's recommendation is to offer a booster to people 18 and older at least two months after their first shot. If the FDA follows the advice of the committee, which it is not required to do but often does, it means that all three COVID-19 vaccines that are available in the U.S. have authorized boosters, with the caveat that there are restrictions in place on who can get a mRNA booster. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The vaccines developed by Pfizer (PFE) and German partner BioNTech (BNTX) and Moderna (MRNA) are based on mRNA technology. Those are being reserved for now for people 65 and over, adults who are at high risk of severe disease, and those who face higher exposure to the virus because of their jobs. About 15 million people in the U.S. have received the J&J's (JNJ) adenovirus-based COVID-19 vaccine. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Colin Powell, who served under Republican and Democratic presidents in war and peace but whose sterling reputation was forever stained when he went before the U.N. and made faulty claims to justify the U.S. war in Iraq, has died of COVID-19 complications at the age of 84, the Associated Press reported. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Key Words:Colin Powell 'scrubbed' from U.N. testimony in 2003 all but 2% to 5% of flawed intelligence on Iraq weapons, longtime ally estimates ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Powell, a four-star Army general who went on to serve as national-security adviser, chairman of the Joint Chiefs of Staff  and secretary of state, had been treated at Walter Reed National Medical Center in Bethesda, Md. While Powell was fully vaccinated, he also suffered from multiple myeloma, according to NBC News, a type of blood cancer that damages the body's ability to fight infections. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read: Colin Powell's death is a reminder that we desperately need herd immunity against COVID-19 ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Related: Colin Powell's death after a 'breakthrough' case of COVID-19 is already being used by anti-vaxxers ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Health experts were quick to point out that breakthrough infections are rare but are to be expected given that the vaccines are not 100% effective. And seniors with compromised immune systems are going to be at greater risk, which is why the booster program has been implemented. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Others noted that vaccines continue to be the best protection against severe COVID and death and that most of the current cases, hospitalizations and deaths are among unvaccinated people. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  An unvaccinated Virginia couple in their 40s recently died of COVID-19, leaving behind four children -- and the father with one tragic regret before he succumbed, the New York Post reported ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"He called me up and said, 'Mom, I love you, and I wish that I'd got the shot,' \" said Terry Mitchem, the mother of Kevin Mitchem, to NBC 4 in Washington, D.C ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  She and other relatives of Kevin Mitchem and his late wife, Misty, are now urging those who have to be vaccinated to get immunized. \"Please get it,\" Kevin's father, Don Mitchem, reportedly told the TV station. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See now: FDA to hold advisory committee for Merck's experimental COVID-19 pill ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Don't miss: The success of Merck's antiviral -- and other COVID-19 pills in development -- may depend on how quickly people start taking them ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The U.S. is averaging more than 1,500 deaths a day at present, according to a New York Times tracker, down 19% from two weeks ago. Cases and hospitalizations are also declining, although hot spots, like Alaska and Minnesota, are still struggling with high caseloads. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Counties in the country's northernmost regions are seeking rising cases as cold weather arrives and drives people back into indoor settings, the Times reported. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Centers for Disease Control and Prevention's vaccine tracker is showing that 189 million Americans are fully vaccinated, equal to about 57% of the overall population, still below the 70% experts say is needed to rein in the spread. Some 10.5 million Americans have received a booster dose, the data shows. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  More than two-thirds of Americans over the age of 12, however, are now fully vaccinated, according to the CDC, and 77.1% of that population has had at least one vaccine dose. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Dr. Anthony Fauci, head of the National Institute of Allergy and Infectious Diseases, said Sunday that it is \"really unfortunate\" that Gov. Greg Abbott has moved to ban vaccine mandates in the state of Texas, the AP reported ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Speaking on \"Fox News Sunday,\" Fauci said that the Republican governor's decision to block businesses from requiring inoculations would damage public health, since vaccines are the \"most effective means\" to stop the spread of COVID-19. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Elsewhere, Russia reported a record number of COVID-19 cases and deaths on Saturday, data from the country's Coronavirus Response Center showed, as CNN reported ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Some 1,002 people died of COVID-19 in a single day, breaking the previous record of 999 deaths set Friday. The vast country of 146 million people counted 33,208 new cases. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  England is planning to push for teenagers to get their shots, after slower-than-expected take-up has left the rate below 10% in over a third of the main local authorities in the country, the Guardian reported The U.K. recorded 45,140 new cases on Sunday, the highest jump in positive cases since mid-July, the paper reported. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The European Union has exported more than 1 billion vaccine doses since December 2020, making the bloc the biggest vaccine exporter, European Commission head Ursula von der Leyen said on Monday, as Reuters reported Vaccines have gone to more than 150 countries, and the EU has exported as many doses as it had distributed to its own population, von der Leyen added in a statement. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The EU is working with the administration of President Joe Biden to achieve the goal of getting 70% of the world's population vaccinated by next September. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In medical news, two doses of either the vaccine made by Pfizer and partner BioNTech or AstraZeneca (AZN.LN) in partnership with Oxford University provided a similar level of protection to prior natural infection when the delta variant was dominant, the U.K. Office of National Statistics said Monday. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Vaccination significantly reduced the risk of people testing positive during both the alpha-dominant period and the delta-dominant period, but effectiveness was reduced in the delta-dominant period compared with the alpha-dominant period. The ONS added that two doses of either vaccine provided significantly greater protection than one dose across all analyses. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  And French biotech Valneva  said its vaccine candidate outperformed AstraZeneca's in a trial. The Phase 3 trial involved 4,012 people and showed a significantly more favorable tolerability profile. Valneva said its vaccine produced more neutralized antibodies and there was a complete absence of any severe COVID-19 cases. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Latest tallies ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The global tally for the coronavirus-borne illness climbed above 240.8 million on Monday, while the death toll edged above 4.9 million, according to data aggregated by Johns Hopkins University. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The U.S. continues to lead the world with a total of 44.9 million cases and 724,502 deaths. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  India is second by cases after the U.S. at 34 million and has suffered 452,290 deaths. Brazil has the second highest death toll at 603,282 and 21.6 million cases. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In Europe, Russia has most fatalities at 220,323, followed by the U.K. at 138,997. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  China, where the virus was first discovered late in 2019, has had 108,927 confirmed cases and 4,809 deaths, according to its official numbers, which are widely held to be massively underreported. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  10-18-21 1500ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2021 Dow Jones & Company, Inc.","gated":false}]}