{"id":"8501350","sourceId":"globe-newswire","sourceName":"GlobeNewswire","providerName":"GlobeNewswire","title":"Enact Welcomes Michael A. Bless to its Board of Directors","publishedDate":"2022-03-10T15:05:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"RALEIGH, N.C., March  10, 2022  (GLOBE NEWSWIRE) -- ","gated":false},{"type":"strong","contentObject":[{"type":"text","content":"Enact Holdings, Inc. (Nasdaq: ACT) (Enact)","gated":false}],"gated":false},{"type":"text","content":" a leading provider of private mortgage insurance through its insurance subsidiaries, has appointed Michael A. Bless to the company’s board of directors which is now comprised of 11 members.","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"    ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"“We are excited to welcome Michael to Enact’s Board of Directors. His extensive business experience and strong financial expertise will complement and enhance the skills and perspectives represented on the board,” said Dominic Addesso, Chairperson of the Enact Board. “Having held multiple executive positions with public companies, his prior director service, and currently serving as a special advisor to the CEO and Board of Directors of Century Aluminum Company since July 2021, and a director of CNA Financial Corporation since 2017, Michael’s business acumen and diverse experiences will serve the Company well.”","gated":false}],"gated":false},{"type":"text","content":"    ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Prior to joining the Enact board, Mr. Bless served as Century Aluminum Company’s (Nasdaq: CENX) President & Chief Executive Officer from November 2011 to July 2021, and a member of their Board of Directors from December 2012 to July 2021. In addition, Mr. Bless also served as the Chief Financial Officer for Century from 2006 to 2011. Prior to joining Century, Mr. Bless also served in various leadership positions such as Chief Financial Officer of Maxtor Corporation and Rockwell Automation, Inc. Since 2017, Bless has served as an independent director of CNA Financial Corporation (NYSE: CNA) where he is the chair of the Compensation Committee.  ","gated":false}],"gated":false},{"type":"text","content":"    ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Complete Enact board member biographies, including roles and committee assignments, can be found on the company website under the Corporate Governance tab at ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=fkdFamru6oXEuMxnkf-CKkmvS9s7CrBUry3USBeBRbuM0cDH4nUQr3DR_985YzovcHPeU6VHkG87ZGow8HV21U3BL9NbO7vVel3bjKA4uLgeFNQaWo-9iltZCbYWiX1FUNLRjGTZMbylbZxNv1gE0bs4JQQ86mGcYURbb2HPS285NqasNuiR0HOUftUA73WnvfMJXkbxfEw3p0FD3NQqcA==","contentObject":[{"type":"text","content":"https://ir.enactmi.com/corporate-governance/governance-overview","gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":"    ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"About Enact Holdings, Inc.","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=gDcPQft5MsXYk8L5-hqT3_eJoeAC0IjFL8smTh4I0kCUP5N7HQNsTdAzjJePmT8dzuG_j1BO-F6fi7FNXIWlhA==","contentObject":[{"type":"text","content":"Enact","gated":false}],"gated":false},{"type":"text","content":" (Nasdaq: ACT), operating principally through its wholly-owned subsidiary Enact Mortgage Insurance Corporation since 1981, is a leading U.S. private mortgage insurance provider committed to helping more people achieve the dream of homeownership. Building on a deep understanding of lenders' businesses and a legacy of financial strength, we partner with lenders to bring best-in class service, leading underwriting expertise, and extensive risk and capital management to the mortgage process, helping to put more people in homes and keep them there. By empowering customers and their borrowers, Enact seeks to positively impact the lives of those in the communities in which it serves in a sustainable way. Enact is headquartered in Raleigh, North Carolina.","gated":false}],"gated":false},{"type":"text","content":"    ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Safe Harbor Statement","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"This communication contains “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act. These forward-looking statements may address, among other things, our expected financial and operational results, the related assumptions underlying our expected results, and the quotations of management. These forward-looking statements are distinguished by use of words such as “will,” “would,” “anticipate,” “expect,” “believe,” “designed,” “plan,” or “intend,” the negative of these terms, and similar references to future periods. These views involve risks and uncertainties that are difficult to predict and, accordingly, our actual results may differ materially from the results discussed in our forward-looking statements. Our forward-looking statements contained herein speak only as of the date of this press release. Factors or events that we cannot predict, including uncertainty around Covid-19 and the effects of government and other measures seeking to contain its spread, risks related to an economic downturn or recession in the United States and in other countries around the world, changes in political, business, regulatory, and economic conditions and other factors described in the risk factors contained in our filings with the Securities and Exchange Commission, may cause our actual results to differ from those expressed in forward-looking statements. Although Enact believes the expectations reflected in such forward-looking statements are based on reasonable assumptions, the Company can give no assurance that its expectations will be achieved and it undertakes no obligation to update publicly any forward-looking statements as a result of new information, future events, or otherwise, except as required by applicable law.","gated":false}],"gated":false},{"type":"text","content":"    ","gated":false},{"type":"p","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"img","src":"https://www.globenewswire.com/newsroom/ti?nf=ODUwMTM1MCM0NzgyODY2IzIyMDgwNzg=","alt":"","variations":[],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"img","src":"https://ml.globenewswire.com/media/ZTEzODY3MWEtZDBhOC00NjFmLWJiNjUtNzE2ZDA2MTQzMGM0LTEyMTk2MzE=/tiny/Genworth-Mortgage-Insurance-Co.png","alt":"","variations":[],"gated":false},{"type":"pre","contentObject":[{"type":"text","content":"Investor Contact\nDaniel Kohl\ndaniel.kohl@enactmi.com\n\nMedia Contact\nBrittany Harris-Flowers\nbrittany.harris-flowers@enactmi.com","gated":false}],"gated":false}]}