{"id":"20220326318","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Yale professor monitoring companies still doing business in Russia ups the ante by highlighting those that are now 'digging in'","publishedDate":"2022-03-26T09:47:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Latest list is split into five categories, and the fifth comprises those defying demands for exit and imperiling their longer-term reputations ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Yale professor who is monitoring companies that are still doing business in Russia following its unprovoked invasion of neighboring Ukraine has upped the ante by reclassifying the list into five categories with the fifth titled \"digging in\" -- or defying public demands for exit. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Some 39 companies, including Koch Industries Inc., packaging company Ball Corp. (BLL), family-owned consumer-goods company SC Johnson and cybersecurity company Cloudflare Inc. (NET), remain in that category four weeks after the start of the attack. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  More than 450  companies have announced plans to pull out or curtail their activities in Russia since the list was first published by Jeffrey Sonnenfeld and his research team at the Yale School of Management. The situation remains fluid for now, with the Yale team updating the list on a daily basis. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See:Yale professor is keeping tabs on companies still operating in Russia despite Ukraine invasion -- and many have now pulled out ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The idea here is to bring the Russian economy to a standstill,\" Sonnenfeld told MarketWatch. \"That's what Gandhi did [in India], it's how Ceau escu was removed from power in Romania, [and] it's what led to the fall of P.W. Botha in South Africa and led to Nelson Mandela's freedom. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"It was critical in all those cases to have voluntary business blockades work in tandem with economic sanctions, so the people can hear that they are becoming pariahs and things are not what their leaders are telling them. ... It's a much tighter circle when the whole global economy takes part.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Koch, the Wichita, Kan., company run by billionaire Republican megadonor Charles Koch, was explicit about its intention in a statement last week signed by Chief Operating Officer Dave Robertson. The Robertson statement said Koch would continue to operate its two Russian glass facilities, which are owned by Guardian Industries, a company acquired in 2017. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"While Guardian's business in Russia is a very small part of Koch, we will not walk away from our employees there or hand over these manufacturing facilities to the Russian government so it can operate and benefit from them (which is what The Wall Street Journal has reported they would do),\" Robertson said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See:Koch Industries breaks silence on Russia operations -- and says it will continue to operate its two glass factories there ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The executive acknowledged the \"horrific and abhorrent aggression against Ukraine,\" which he called an \"affront to humanity.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  But that was not enough to persuade Koch to pull out of Russia, as Ukrainian President Volodymyr Zelensky urged companies to do when he addressed the U.S. Congress by video link last week. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"All American companies must leave [the Russian] market immediately because it is flooded with our blood,\" Zelensky said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See also: Facebook, Google, Amazon and more marked Black History Month with fanfare -- after donating to lawmakers who blocked voting-rights bills ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Sonnenfeld described the Koch statement as \"pathetic\" and said it \"reveals that all they care about is the loss of assets.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  He was also scathing toward SC Johnson, describing its decision to continue operating in Russia as providing \"globally branded confidence\" to Russia's war machine. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  SC Johnson said in a statement that it feels a \"deep obligation\" to stand by its 200 workers in Russia and 130 workers in Ukraine. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We're not going to turn our backs on  our people in Russia,\" the Racine, Wis., company's chief communications officer, Alan VanderMolen, told MarketWatch. \"We believe we have an obligation to provide them with a livelihood and will continue to do so as long as we are complying with sanctions and the law.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See now:McDonald's to shutter all 850 of its Russia locations, but keep paying staff ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Cloudflare responded to calls to end all of its services in Russia by consulting with government and civil-society experts, according to a blogpost from its Chief Executive Matthew Prince ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Our conclusion, in consultation with those experts, is that Russia needs more Internet access, not less,\" he wrote. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The company has seen a \"dramatic\" rise in requests from Russian networks to global media, he said, reflecting the interest from Russian citizens to see news beyond what is offered within Russia. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Indiscriminately terminating service would do little to harm the Russian government, but would both limit access to information outside the country, and make significantly more vulnerable those who have used us to shield themselves as they have criticized the government,\" Prince wrote. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Ball Corp. did not respond to a request for comment. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Outside of \"digging in,\" the Yale list's other four categories are \"withdraw,\" which is used for those companies taking a clean break from Russia; \"suspension,\" for companies that are temporarily curtailing activities, while keeping their return options open; \"scaling back,\" or reducing some activities while continuing others; and \"buying time,\" for companies that are holding off on new investments, while continuing most business. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  For the full list of companies: Visit the Yale School of Management website ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Companies that opt to dig in are facing substantial reputational risk at a time when younger people, in particular, expect companies to reflect their values and are willing and able to mobilize against them when corporate behavior disappoints, said Sonnenfeld. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Gen Z are very careful about where they shop, whom they buy from and where they invest,\" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Some activists are already organizing boycotts of Koch and SC Johnson products on social media, he noted. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  When Yale first published its list in late February, the stock market was down about 5% on the day, but the stocks of the companies on the list were down anywhere from 12% to 32%, he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The response from companies was also unusual, in that the first to announce plans to withdraw from Russia were energy companies, \"who have not always been on the right side of social-justice issues,\" said Sonnenfeld. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  That sector was followed by professional services, from the Big 3 accounting firms to Accenture, McKinsey and those engaged in the legal profession, \"firms that would often rather jump off a cliff than get involved in political issues,\" in Sonnenfeld's view. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"It's impressive that these companies have made these decisions independently -- it was not mandated or even encouraged by trade associations, who have been disappointingly mute,\" said Sonnenfeld. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Some of the international companies that have changed course this week and withdrawn from Russia include French car maker Renault , which announced it would halt operations at its Moscow plant on Wednesday. Renault, which has a partnership with AvtoVAZ, Russia's biggest car maker, was facing calls for a boycott of its products on social media. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See:Production halted at AvtoVAZ factory making Russia's iconic Lada cars ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Swiss-based global food company Nestlé  bowed to similar pressure and said it would suspend sales of its KitKat and Nesquik brands in Russia. The company had said last week that it was not profiting from its Russian activities. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  03-26-22 1047ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}