{"id":"20220315ny91684","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"MongoDB Expands Global Collaboration with AWS","publishedDate":"2022-03-15T08:00:00-05:00","body":[{"type":"text","content":"MongoDB Expands Global Collaboration with AWS\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"MongoDB Expands Global Collaboration with AWS","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"NEW YORK, March 15, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Strategic Collaboration Agreement to Focus on Accelerating Customer Workload Migrations to the Cloud","gated":false}],"gated":false},{"type":"text","content":"\n  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"NEW YORK, March 15, 2022 /PRNewswire/ --  ","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3472633-1&h=79312596&u=https%3A%2F%2Fwww.mongodb.com%2F&a=MongoDB%2C+Inc.","contentObject":[{"type":"text","content":"MongoDB, Inc.","gated":false}],"gated":false},{"type":"text","content":" (NASDAQ: MDB), the leading modern, general purpose database platform, today announced a significant expansion of a multi-year strategic collaboration agreement (SCA) with Amazon Web Services, Inc. (AWS). Under this six-year agreement, MongoDB and AWS have committed to a broad range of initiatives to make it easier for joint customers to advance their cloud adoption journey, including integrated go-to-market activities across sales and marketing, developer enablement and training through shared developer relations activities, and both technology integrations and commercial incentives to streamline the migration of on-premises workloads to MongoDB Atlas on AWS.","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n                ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n                        ","gated":false},{"type":"a","href":"https://mma.prnewswire.com/media/384058/MongoDB_Logo.html","contentObject":[{"type":"text","content":"\n                    ","gated":false},{"type":"img","src":"https://mma.prnewswire.com/media/384058/MongoDB_Logo.jpg","alt":"MongoDB","variations":[],"gated":false},{"type":"text","content":"\n                        ","gated":false}],"gated":false},{"type":"text","content":"\n                ","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This agreement builds on the current multi-year ","gated":false},{"type":"u","contentObject":[{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3472633-1&h=3373647547&u=http%3A%2F%2Fwww.mongodb.com%2Fblog%2Fpost%2Fmongodb-aws-expand-global-collaboration&a=relationship","contentObject":[{"type":"text","content":"relationship","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" between MongoDB and AWS aimed at driving customer adoption of MongoDB Atlas on AWS. In an effort to further improve the customer experience, both companies have agreed to collaborate together across sales, customer support, solution architecture, marketing, and other areas to make MongoDB Atlas an exceptional experience for developers on AWS globally. This includes increased workload migration incentives and enhanced tools to help customers move from legacy technologies in on-premises data centers to MongoDB Atlas on AWS. Both companies will also work together to offer new joint capabilities for customers in the areas of serverless, AWS Graviton processors, and AWS Outposts. Finally, this partnership will support MongoDB's expansion into further AWS Regions across the globe and US Public Sector with FedRAMP authorization.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"These efforts come on the heels of the recent collaborations announced at AWS re:Invent, including a pay-as-you-go ","gated":false},{"type":"u","contentObject":[{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3472633-1&h=4138161330&u=https%3A%2F%2Faws.amazon.com%2Fmarketplace%2Fpp%2Fprodview-pp445qepfdy34%3Fsr%3D0-1%26ref_%3Dbeagle%26applicationId%3DAWSMPContessa&a=MongoDB+Atlas+offering+","contentObject":[{"type":"text","content":"MongoDB Atlas offering ","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"on the AWS Marketplace and updates to the AWS Management Console that make it easier for customers to find Atlas. The console will give customers a simpler discovery and purchase experience through AWS Marketplace.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"Several years ago, we embarked on a strategic initiative to migrate the entire Shutterfly ecommerce platform to the public cloud because we realized the sheer complexity combined with the overall cost of managing our own infrastructure took away from our ability to innovate,\" said Moudy Elbayadi, Chief Technology Officer, Shutterfly. \"By leveraging MongoDB Atlas on AWS, our platform resiliency has increased along with the overall performance of our applications allowing our platform to scale during our seasonal peaks. Additionally, being able to offload the undifferentiated day-to-day work associated with managing our own databases allows our talented team to focus on building personalized experiences that delight our customers.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"MongoDB uses AWS's global reach and range of services to advance the performance of its database service, and enable customers to store, access, and build applications from anywhere in the world. As part of this collaboration, MongoDB leverages the AWS Marketplace to enable customers to run MongoDB Atlas on AWS and build applications that are highly available, performant at global scale, highly secure, and compliant with privacy standards. MongoDB on AWS works with a wide range of AWS services to enable customers to analyze data with the broadest set of analytical approaches and integrate advanced services in machine learning and Internet of Things.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"Designed for developers by developers, MongoDB delivers an application data platform that spans multiple geographies, clouds, and deployment types to solve the data challenges of transactional workloads and modern applications,\" said Alan Chhabra, Executive Vice President of Worldwide Partners, MongoDB. \"The continued growth and reach of our collaboration with AWS means that many more customers across a variety of industries will be able to use MongoDB Atlas to power the next generation of applications.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"MongoDB has been both a customer and trusted AWS Partner for years, using AWS's broad and deep set of functionalities, proven operational performance, and security to help organizations move their software and data into the cloud faster with a seamless user experience. Running MongoDB Atlas on AWS gives customers a richer application developer experience and helps customers make better use of their data,\" said Ruba Borno, Vice President of Worldwide Channels and Alliances at Amazon Web Services. \"MongoDB shares a mindset of driving innovation, improving reliability, and ensuring we support customers' efforts to become more data-driven organizations in the cloud, whether they're startups or enterprises, working in the private or public sector.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Further Resources","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"ul","contentObject":[{"type":"li","contentObject":[{"type":"u","contentObject":[{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3472633-1&h=3179382523&u=http%3A%2F%2Fwww.mongodb.com%2Fblog%2Fpost%2Fmongodb-aws-expand-global-collaboration&a=Blog","contentObject":[{"type":"text","content":"Blog","gated":false}],"gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"About MongoDB","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"MongoDB is the leading modern, general purpose database platform empowering innovators to create, transform, and disrupt industries by unleashing the power of software and data. Headquartered in New York, MongoDB has more than 33,000 customers in over 100 countries. The MongoDB database platform has been downloaded over 210 million times and there have been more than 1.5 million registrations for MongoDB University courses.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release includes certain \"forward-looking statements\" within the meaning of Section 27A of the Securities Act of 1933, as amended, or the Securities Act, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements regarding initiatives to make it easier for joint customers of MongoDB and AWS to advance their cloud adoption journey. These forward-looking statements include, but are not limited to, plans, objectives, expectations and intentions and other statements contained in this press release that are not historical facts and statements identified by words such as \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"plan,\" \"project,\" \"will,\" \"would\" or the negative or plural of these words or similar expressions or variations. These forward-looking statements reflect our current views about our plans, intentions, expectations, strategies and prospects, which are based on the information currently available to us and on assumptions we have made. Although we believe that our plans, intentions, expectations, strategies and prospects as reflected in or suggested by those forward-looking statements are reasonable, we can give no assurance that the plans, intentions, expectations or strategies will be attained or achieved. Furthermore, actual results may differ materially from those described in the forward-looking statements and are subject to a variety of assumptions, uncertainties, risks and factors that are beyond our control including, without limitation: the impact that the precautions we have taken in our business relative to the ongoing COVID-19 pandemic may have on our business; the financial impacts of the COVID-19 pandemic on our customers, our potential customers, the global financial markets and our business and future operating results; our potential failure to meet publicly announced guidance or other expectations about our business and future operating results; our limited operating history; our history of losses; failure of our database platform to satisfy customer demands; the effects of increased competition; our investments in new products and our ability to introduce new features, services or enhancements; our ability to effectively expand our sales and marketing organization; our ability to continue to build and maintain credibility with the developer community; our ability to add new customers or increase sales to our existing customers; our ability to maintain, protect, enforce and enhance our intellectual property; the growth and expansion of the market for database products and our ability to penetrate that market; our ability to integrate acquired businesses and technologies successfully or achieve the expected benefits of such acquisitions; our ability to maintain the security of our software and adequately address privacy concerns; our ability to manage our growth effectively and successfully recruit and retain additional highly-qualified personnel; and the price volatility of our common stock. These and other risks and uncertainties are more fully described in our filings with the Securities and Exchange Commission (\"SEC\"), including under the caption \"Risk Factors\" in our Quarterly Report on Form 10-Q for the quarter ended October 31, 2021 filed with the SEC on December 8, 2021 and other filings and reports that we may file from time to time with the SEC. Except as required by law, we undertake no duty or obligation to update any forward-looking statements contained in this release as a result of new information, future events, changes in expectations or otherwise.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Investor Relations","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Brian Denyeau","gated":false},{"type":"br","gated":false},{"type":"text","content":"ICR for MongoDB","gated":false},{"type":"br","gated":false},{"type":"text","content":"646-277-1251","gated":false},{"type":"br","gated":false},{"type":"u","contentObject":[{"type":"a","href":"mailto:ir@mongodb.com","contentObject":[{"type":"text","content":"ir@mongodb.com","gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Media Relations","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Matt Trocchio","gated":false},{"type":"br","gated":false},{"type":"text","content":"MongoDB","gated":false},{"type":"br","gated":false},{"type":"u","contentObject":[{"type":"a","href":"mailto:communications@mongodb.com","contentObject":[{"type":"text","content":"communications@mongodb.com","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=NY91684&sd=2022-03-15","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content to download multimedia:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/mongodb-expands-global-collaboration-with-aws-301502886.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/mongodb-expands-global-collaboration-with-aws-301502886.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  MongoDB, Inc.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false}]}