{"id":"20220516117","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Spirit Airlines stock jumps after JetBlue launches tender offer at near 77% premium","publishedDate":"2022-05-16T06:32:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Shares of Spirit Airlines Inc. (SAVE) soared 17.5% in premarket trading Monday, after JetBlue Airways Corp. (JBLU) said it launched a \"fully financed\" tender offer to buy all Spirit outstanding shares for $30 each, representing a 76.7% premium to Friday's closing price of $16.98. The tender offer comes after Spirit reiterated earlier in May its support for the merger deal with Frontier Group Holdings Inc. (ULCC) as it determined JetBlue's $33-per-share cash bid in April did not constitute superior offer. JetBlue also said on Monday that it was urging Spirit shareholders to vote against the \"inferior, high risk and low value\" Spirit-Frontier merger deal. JetBlue shares slipped 0.6% premarket and Frontier's stock rose 4.4%. \"JetBlue ffers more value - a significant premium in cash - more certainty, and more benefits for all stakeholders,\" said JetBlue Chief Executive Robin Hayes. \"Frontier offers less value, more risk, no divestiture commitments, and no reverse break-up fee, despite more overlap on non-stop routes and their own regulatory challenges.\" Year to date, Spirit shares have dropped 22.3% and JetBlue's stock has shed 29.4%, while the U.S. Global Jets ETF (JETS) has slipped 9.3% and the S&P 500  has declined 15.6%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tomi Kilgore ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-16-22 0732ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}