{"id":"20220519327","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"10 years after Facebook's record-breaking IPO, a sense of déjà vu","publishedDate":"2022-05-19T06:20:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Jeremy C. Owens ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Facebook shares fell more than 30% in their first year on Wall Street as the company transitioned to mobile, and after huge gains in between, they fell even harder last year as Mark Zuckerberg repositioned the company again with an eye on the 'metaverse' ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  After a record-breaking initial public offering, Facebook Inc. shares plunged more than 30% in their first year before a Wall Street rise that made that freshman year seem like an anomaly. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In its first year under the new name of Meta Platforms Inc. (FB), however, Facebook performed even worse. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  On May 18, 2012, Facebook became the first U.S. company to go public at an initial valuation topping $100 billion, kicking off a wave of Silicon Valley IPOs for the then-new category of \"unicorn\" startups. The IPO was beset by issues, however: Nasdaq bungled the bidding process, leaving investors unsure if they had actually received the Facebook shares they wanted, and underwriting banks reportedly had to step in and buy the stock to keep it higher than the $38 IPO price. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  From that day: Facebook's IPO -- success or failure? ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Shares closed higher than $38 that first day, at $38.23, but plunged more than 10% the following day and failed to touch the IPO price again for more than a year. Despite raising $6.8 billion at a record-breaking valuation, the IPO was derided as \"The Faceplant\" while Facebook shares fell lower than $20 in their first year of trading and ended year 1 down more than 30%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The reason for Facebook's freshman flop centered on doubts about the company's ability to transition from a product built for personal computers to a new era centered about smartphones, thanks to the 2007 birth of Apple Inc.'s (AAPL) iPhone. By the end of that first year as a public company, though, Facebook was getting roughly one-third of its advertising revenue from its mobile offering, and Mark Zuckerberg's baby grew to one of the largest and most valuable tech companies in the world while swallowing Instagram and WhatsApp. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In year two, Facebook stock more than doubled, gaining 121.3%, and even as the company faced public recrimination for allowing disinformation and misinformation on its platforms and many other missteps in subsequent years, Facebook stock did not have another down year. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Until the past one. From May 18, 2021, through Tuesday, Facebook shed more than one-third of its valuation, declining 35.8%, according to Dow Jones Market Data Group. That is even worse than the percentage performance from its first year as a public company, a 31.3% decline, and much worse from a valuation perspective: While Facebook was worth $104 billion at IPO time, the decline of the past year has cost it $346.6 billion in market cap. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Much of Facebook's current troubles, like its year-one trouble, involve Apple and its mobile ecosystem. Apple has changed its permissions for online-advertising providers that can shield more of its users' data and activity from outside entities, which has caused problems for Facebook and other social-media companies. After Chief Financial Officer David Wehner warned that Apple's changes could cost Facebook $10 billion in 2022 earlier this year, Facebook set a record by losing more than $200 billion in market cap in a single session. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  For more: Meta CFO cries 'wolf' again, but he may be right this time ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  That decline came after Facebook's first quarterly earnings report with a new name: Meta. Zuckerberg renamed the company to focus on the \"metaverse,\" which he sells as a magical new online reality but is, in our reality, another name for immersive products like Roblox Corp. (RBLX) The metaverse push relies on Facebook's 2014 acquisition of virtual-reality company Oculus, and it is expected to soon face a familiar foe in that arena: Apple. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Apple is expected to introduce its long-awaited augmented-reality hardware at some point this year, and the two sides have been gearing for another fight. Apple Chief Executive Tim Cook has made privacy and security his key talking points in recent years, aiming specifically at Zuckerberg, who has not shied away from a fight with the company that has bedeviled his own repeatedly over the years. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Wall Street analysts still believe in Facebook's future. As of the 10th anniversary of its IPO, 40 of the 56 analysts tracking the stock rate it the equivalent of a \"Buy,\" while only one rates the stock a \"Sell.\" The average price target as of Wednesday was $288.51, a 48.7% premium to its going rate. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Through 10 years as a public company, Facebook stock has gained more than 415% from its IPO price of $38, while the S&P 500 index has gained 284.2%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Jeremy C. Owens ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-19-22 0720ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}