{"id":"20220518568","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"You bought. They sold. Meet some of the insiders who unloaded $35 billion in stock amid the tech IPO bonanza that tanked.","publishedDate":"2022-05-18T13:56:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Nathan Vardi ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Shares of FIGS, Coinbase, Coupang and Robinhood have plunged since their IPOs in 2021. But not before executives and financial backers sold portions of their holdings. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  A year ago, Heather Hasson and Catherine \"Trina\" Spear traveled from Santa Monica, Calif., to New York to ring the opening bell at the New York Stock Exchange. The co--chief executives of FIGS, an online retailer of higher-end apparel for healthcare professionals, cheered their initial public offering together with people who joined them on the bell podium wearing stylish scrubs. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  FIGS had capitalized on some powerful pandemic-era trends, and, in the IPO, its shares were sold at $22 apiece, raising $580 million. The FIGS IPO even tapped the retail market, becoming the first IPO that was made available to users of the Robinhood trading app. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Most of the IPO money raised, however, didn't go to the company. Instead, $450 million of the proceeds went to Tulco Holdings, a company controlled and run by Thomas Tull, the Hollywood movie-studio billionaire. Tull's holding company had invested some $65 million in FIGS (FIGS) over the preceding four years and become its biggest shareholder, securities filings show. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The healthcare apparel market is massive. It's a $12 billion market in the United States. It's $79 billion globally,\" Spear said on the day of the IPO from the floor of the New York Stock Exchange. \"We actually feel those numbers are a bit understated.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  With fashionable face masks and a direct-to-consumer online model that had become popular with investors, shares of FIGS quickly soared to $50. Four months after the IPO, in September 2021, FIGS announced a secondary offering at $40.25 per share. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  This time Hasson, 40, and Spear, 38, got in on the action. Hasson sold $94 million in FIGS shares in the secondary offering, and Spear sold $59 million, securities filings show. Tull's company also sold another chunk of FIGS shares in the secondary offering. In total, Tull's company has sold $822 million of shares since the IPO, according to an analysis of securities filings conducted by research and analytics firm VerityData. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  But this year investors have started to question the FIGS growth story and the general euphoria around new direct-to-consumer models. Wall Street analysts have become skeptical that the total addressable market for stylish scrubs is as large as Spear had asserted. Investment bank Cowen, for example, put out a note saying that the market is much more difficult to pin down and that employment growth among healthcare workers appears to be slowing. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Shares of FIGS have plummeted. The stock recently traded hands for $10.16, down 54% since its 2021 IPO and 75% since FIGS's secondary offering. Anybody who bought and held the $975 million in shares sold by Tull's company, Hasson and Spear is sitting on massive losses. The entire company was recently valued at $1.7 billion. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"After building the company and growing its value for over a decade, FIGS co-founders Heather Hasson and Trina Spear sold a small percentage of their overall holdings in the same timeframe and amounts that any FIGS shareholder was allowed to sell under the IPO's lockup terms,\" FIGS said in a statement. \"While macro conditions later impacted the overall stock market, Heather and Trina continue to be more invested than anyone in FIGS' long-term success as two of the company's largest shareholders.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Tull declined to comment. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  With the stock market surging, 2021 brought an IPO bonanza. Through traditional IPOs, direct listings and special-purpose acquisition companies, or SPACs, more companies were listed on U.S. stock exchanges in 2021 than in any single year ever. Dealogic said more than 1,000 new companies listed their shares on U.S. exchanges and raised $315 billion. Wall Street investment bankers pushed every company they could find onto the public markets, taking in $10 billion in fees for their efforts. Goldman Sachs (GS), JPMorgan Chase & Co. (JPM) and Morgan Stanley (MS) each booked more than $1 billion in IPO revenue. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Today, many of the companies that were listed in the stock market last year are trading well below their IPO prices. But while investors lost money, many insiders -- CEOs, executives, venture capitalists and other early financial backers -- were able to cash out significant sums. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  There have been some big sellers. Dating-app operator Bumble (BMBL) raised $2.4 billion in its initial public offering last year by selling shares for $43 apiece. Most of that money went to the company's major shareholder, Wall Street behemoth Blackstone Group, which has sold $2.19 billion of Bumble's stock, securities filings show. Bumble's shares now trade for around $27, down 37% since the IPO. Blackstone (BX) declined to comment. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In total, insiders have sold $35.5 billion in shares of companies that went public in 2021 in the U.S., according to VerityData. Some insiders did buy, but they have only purchased an aggregate $7.6 billion in publicly traded stock of companies that listed on U.S. exchanges last year. For example, Tull recently purchased $7.25 million in FIGS stock. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"When the market is hot you tend to get companies trying to take advantage of the frothy market for new offerings, and you saw that with the IPOs and SPACs of 2021,\" says Ben Silverman, director of research at VerityData. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Coinbase, Coupang, Playtika, Robinhood, Honest Co. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In April 2021, Coinbase, operator of the nation's biggest cryptocurrency exchange, listed its shares on Nasdaq through a direct listing, circumventing the traditional IPO process that features expensive investment-banking fees. \"I was excited about the direct listing,\" Coinbase (COIN) CEO Brian Armstrong said at the time. \"I felt like it was more true to the ethos of crypto.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Armstrong went on to say that the direct listing process would deliver a more accurate market price for Coinbase's shares, \"rather than a guess\" that was determined \"behind closed doors and [by] a small number of participants.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Another difference with the direct listing process was that there were no underwriters that could set lock-up restrictions on insider selling for six months or more. The reference point for the Coinbase IPO was $250, but on the first day of trading the stock soared to $388. It was at this and other levels that Fred Wilson, who sits on Coinbase's board, pushed his venture firm, Union Square Ventures, to unload all of its Coinbase stock for $1.8 billion. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In total, Coinbase insiders have unloaded $3.5 billion in Coinbase shares since the IPO. According to VerityData, the biggest individual Coinbase sellers have been Coinbase co-founder Fred Ehrsam, who has sold $492 million in Coinbase stock; Armstrong, who has sold $292 million; and Coinbase president Emilie Choi, who has sold $231 million. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  With the price of bitcoin  and other cryptocurrencies plunging in recent months, the financial performance of Coinbase has taken a serious hit. Its stock has plunged to $70, which is 72% lower than its IPO reference price and 82% below the higher levels at which insiders like Union Square Ventures unloaded the stock. Coinbase and Union Square Ventures did not respond to requests for comment. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The role of venture capitalists in the IPO selling frenzy of 2021 has been notable. In 2016, Masayoshi Son, the billionaire founder and CEO of Japanese holding company SoftBank, announced that SoftBank had raised a $100 billion venture-capital fund to invest in hot new technology companies. One of the companies that SoftBank backed was Coupang (CPNG). ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  SoftBank had initially invested in the Korean online retailer in 2015, but the Vision Fund doubled down on the company and SoftBank became Coupang's biggest shareholder, securities filings show. Last year, Coupang decided to list its shares in the U.S., conducting a massive IPO on the New York Stock Exchange. Coupang sold shares for $35 a piece, raising $4.55 billion. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Six months after the IPO, in September 2021, SoftBank started selling its Coupang shares when they were changing hands for $29.69, securities filings show. It sold $1.69 billion in Coupang shares last year. This year, as the speculative frenzy around technology companies started to crumble, Softank sold another $1 billion in Coupang stock, putting its total Coupang sales at $2.69 billion. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  SoftBank's stock sales and Coupang's ongoing financial losses put the company in a poor position as investors reassessed risk assets this spring. Coupang's shares recently traded for $13.17, marking a 62% plunge since its IPO. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  SoftBank has also been selling the stocks of other companies it has pushed onto U.S. stock exchanges. In June 2021, Sofi Technologies (SOFI), an online personal-finance company, debuted on Nasdaq after merging with a SPAC called Social Capital Hedosophia, which had sold its stock for $10 apiece at its IPO. As the Nasdaq rose last year, Sofi arranged a secondary offering at $21.60 per share in which SoftBank sold a chunk of its holdings for $486 million. In total, insiders at Sofi have sold shares worth $984 million. Sofi's stock recently traded at $7.05. SoftBank did not respond to a request for comment. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  To some degree, the boom in speculative technology stocks that peaked in 2021 was driven by Robinhood Markets, which operates a trading app that became wildly popular with retail investors during the pandemic. Robinhood conducted its IPO last July, selling its stock for $38 and raising $1.89 billion, a big portion of it from individual investors and Robinhood users. Its two founders, Vlad Tenev and Baiju Bhatt, each sold $45.5 million in stock in connection with the offering. Robinhood's stock (HOOD) recently changed hands for $10.06, which is 73% below the IPO price. Through a Robinhood spokesperson, Tenev and Bhatt declined to comment. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (MORE TO FOLLOW) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-18-22 1456ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}