{"id":"20220216005848","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Annaly Capital Management, Inc. Announces Preferred Dividends","publishedDate":"2022-02-16T15:15:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Annaly Capital Management, Inc. Announces Preferred Dividends","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIn accordance with the terms of Annaly’s 6.95% Series F Fixed-to-Floating Rate Cumulative Redeemable Preferred Stock (“Series F Preferred Stock”), the Board has declared a Series F Preferred Stock cash dividend for the first quarter of 2022 of $0.434375 per share of Series F Preferred Stock.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIn accordance with the terms of Annaly’s 6.50% Series G Fixed-to-Floating Rate Cumulative Redeemable Preferred Stock (“Series G Preferred Stock”), the Board has declared a Series G Preferred Stock cash dividend for the first quarter of 2022 of $0.40625 per share of Series G Preferred Stock.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIn accordance with the terms of Annaly’s 6.75% Series I Fixed-to-Floating Rate Cumulative Redeemable Preferred Stock (“Series I Preferred Stock”), the Board has declared a Series I Preferred Stock cash dividend for the first quarter of 2022 of $0.421875 per share of Series I Preferred Stock.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nDividends for the Series F Preferred Stock, Series G Preferred Stock, and Series I Preferred Stock are payable on March 31, 2022 to preferred shareholders of record as of March 1, 2022.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Annaly","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAnnaly is a leading diversified capital manager with investment strategies across mortgage finance and corporate middle market lending. Annaly’s principal business objective is to generate net income for distribution to its stockholders and to optimize its returns through prudent management of its diversified investment strategies. Annaly is internally managed and has elected to be taxed as a real estate investment trust, or REIT, for federal income tax purposes. Additional information on the company can be found at ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.annaly.com&esheet=52580583&newsitemid=20220216005848&lan=en-US&anchor=www.annaly.com&index=1&md5=beeaebf0f026204a9671cc3f06e8c61d","contentObject":[{"type":"text","content":"www.annaly.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis news release and our public documents to which we refer contain or incorporate by reference certain forward-looking statements which are based on various assumptions (some of which are beyond our control) and may be identified by reference to a future period or periods or by the use of forward-looking terminology, such as \"may,\" \"will,\" \"believe,\" \"expect,\" \"anticipate,\" \"continue,\" or similar terms or variations on those terms or the negative of those terms. Actual results could differ materially from those set forth in forward-looking statements due to a variety of factors, including, but not limited to, risks and uncertainties related to the COVID-19 pandemic, including as related to adverse economic conditions on real estate-related assets and financing conditions; changes in interest rates; changes in the yield curve; changes in prepayment rates; the availability of mortgage-backed securities and other securities for purchase; the availability of financing and, if available, the terms of any financing; changes in the market value of our assets; changes in business conditions and the general economy; operational risks or risk management failures by us or critical third parties, including cybersecurity incidents; our ability to grow our residential credit business; our ability to grow our middle market lending business; credit risks related to our investments in credit risk transfer securities, residential mortgage-backed securities and related residential mortgage credit assets and corporate debt; risks related to investments in mortgage servicing rights; our ability to consummate any contemplated investment opportunities; changes in government regulations or policy affecting our business; our ability to maintain our qualification as a REIT for U.S. federal income tax purposes; and our ability to maintain our exemption from registration under the Investment Company Act. For a discussion of the risks and uncertainties which could cause actual results to differ from those contained in the forward-looking statements, see \"Risk Factors\" in our most recent Annual Report on Form 10-K and any subsequent Quarterly Reports on Form 10-Q. The Company does not undertake, and specifically disclaims any obligation, to publicly release the result of any revisions which may be made to any forward-looking statements to reflect the occurrence of anticipated or unanticipated events or circumstances after the date of such statements, except as required by law.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220216005848r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAnnaly Capital Management, Inc.\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Investor Relations\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"1-888-8Annaly\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:investor@annaly.com","contentObject":[{"type":"text","content":"investor@annaly.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220216005848/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220216005848/en/","gated":false}],"gated":false}],"gated":false}]}