{"id":"20220404005952","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"World Fuel Services Corporation Amends, Expands and Extends Credit Facility","publishedDate":"2022-04-04T16:05:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"World Fuel Services Corporation Amends, Expands and Extends Credit Facility","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n---Increases Total Liquidity and Extends Maturity to April 2027---\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nWorld Fuel Services Corporation (NYSE: INT) today announced that it has successfully amended its unsecured credit facility, increasing the overall facility to $2 billion and extending the term of the credit facility to April 2027.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“We greatly appreciate the relationships we have with all of our lenders and their continued support of our business and our vision for the future,” stated Ira M. Birns, executive vice president and chief financial officer of World Fuel Services Corporation. “The increase in the size of the credit facility and improved covenant provisions will provide additional financial flexibility in support of our strategic growth objectives.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nBank of America, N.A. is the Administrative Agent and Bank of America, N.A., JPMorgan Chase Bank, N.A., TD Bank, N.A., Wells Fargo Bank, N.A., and HSBC Bank USA, N.A. served as joint lead arrangers in connection with the transaction.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nInformation Relating to Forward-Looking Statements\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding our beliefs and expectations with respect to our financial flexibility and our ability to execute on our strategic growth objectives and return capital to our shareholders. These forward-looking statements are qualified in their entirety by cautionary statements and risk factor disclosures contained in our Securities and Exchange Commission (“SEC”) filings, including our most recent Annual Report on Form 10-K filed with the SEC. Actual results may differ materially from any forward-looking statements due to risks and uncertainties, including, but not limited to: our ability to capitalize on new market opportunities, our ability to successfully implement our growth strategy and integrate acquired businesses and recognize the anticipated benefits, potential liabilities, limited indemnities and the extent of any insurance coverage, our ability to effectively manage the effects of the COVID-19 pandemic, the extent of the impact of the pandemic on ours and our customers' sales, profitability, operations and supply chains due to actions taken by governments and businesses to contain the virus, customer and counterparty creditworthiness and our ability to collect accounts receivable and settle derivative contracts, sudden changes in the market price of fuel or extremely high or low fuel prices that continue for an extended period of time, the availability of cash and sufficient liquidity to fund our working capital and strategic investment needs, any global economic impacts or other significant volatility that may arise from geopolitical events, wars and other civil unrest, adverse conditions in the markets or industries in which we or our customers and suppliers operate, such as the current global economic environment as a result of the coronavirus pandemic, our ability to manage the changes in supply and other market dynamics in the regions where we operate, our failure to comply with restrictions and covenants in our senior revolving credit facility and our senior term loans, including our financial covenants, our ability to successfully execute and achieve efficiencies, our ability to achieve the expected level of benefit from any restructuring activities and cost reduction initiatives, inflationary pressures and its impact on our customers or the global economy, unanticipated tax liabilities or adverse results of tax audits, assessments, or disputes, our ability to capitalize on new market opportunities, risks related to the complexity of the U.S. and foreign tax legislation and any subsequently issued regulations and our ability to accurately predict the impact on our effective tax rate and future earnings, our ability to effectively leverage technology and operating systems and realize the anticipated benefits, actions that may be taken under the current administration in the U.S. that increase costs or otherwise negatively impact ours or our customers and suppliers businesses, the outcome of pending litigation and other proceedings, the impact of quarterly fluctuations in results, particularly as a result of seasonality, our failure to effectively hedge certain financial risks associated with the use of derivatives, uninsured losses, the impact of climate change and natural disasters, adverse results in legal disputes, our ability to retain and attract senior management and other key employees, and other risks detailed from time to time in our SEC filings. New risks emerge from time to time and it is not possible for management to predict all such risk factors or to assess the impact of such risks on our business. Accordingly, we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, changes in expectations, future events, or otherwise, except as required by law.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAbout World Fuel Services Corporation\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nHeadquartered in Miami, Florida, World Fuel Services is a global energy management company involved in providing energy procurement advisory services, supply fulfillment and transaction and payment management solutions to commercial and industrial customers, principally in the aviation, marine and land transportation industries. World Fuel Services also offers natural gas and electricity, as well as energy advisory services, including programs for carbon offsets, sustainability solutions and renewable energy alternatives. World Fuel Services sells fuel and delivers services to its clients at more than 8,000 locations in more than 200 countries and territories worldwide.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFor more information, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wfscorp.com&esheet=52646452&newsitemid=20220404005952&lan=en-US&anchor=www.wfscorp.com&index=1&md5=83cd505c9e57080c37237ecb6ba1011d","contentObject":[{"type":"text","content":"www.wfscorp.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220404005952r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIra M. Birns, Executive Vice President &\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Chief Financial Officer\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nGlenn Klevitz\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Vice President, Treasurer & Investor Relations\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"305-428-8000\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220404005952/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220404005952/en/","gated":false}],"gated":false}],"gated":false}]}