{"id":"20220512005806","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"IonQ Launches Native Gate Access, Extends Open-Source Capabilities for Researchers and Developers","publishedDate":"2022-05-12T10:00:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"IonQ Launches Native Gate Access, Extends Open-Source Capabilities for Researchers and Developers","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nNew capabilities reduce barriers to quantum computing experimentation and breakthroughs.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nHardware-native format creates more control over algorithm structure and implementation.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nFormat is being rolled out across a variety of open-source tools, enabling new capabilities in Qiskit, Cirq, PennyLane and more.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIonQ (NYSE: IONQ), a leader in quantum computing, today announced support for specifying quantum circuits in a hardware-native gate format across its systems. Researchers, academic institutions and developers looking for new ways to test, learn and discover real-world solutions can now more precisely and expressively define their algorithms that run on IonQ quantum hardware.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIonQ provides customers with access to its cloud quantum computing platform – the IonQ Quantum Cloud – which allows users to run quantum programs on IonQ’s hardware remotely. Customers have the flexibility to define quantum algorithms in whatever format best suits their needs, and the platform’s proprietary compilation, optimization and post-processing stack is designed to ensure consistent, high-quality results. However, advanced researchers and developers often need more fine-grained control over each individual gate run on hardware when exploring novel algorithms, solutions and fundamental techniques.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIn order to serve this group of innovators more effectively, IonQ is further democratizing access to its ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fionq.com%2Fnews%2Ffebruary-23-2022-ionq-aria-furthers-lead&esheet=52717577&newsitemid=20220512005806&lan=en-US&anchor=industry-leading+hardware&index=1&md5=d68e3431cf969d30ce6ab9f14462ea4e","contentObject":[{"type":"text","content":"industry-leading hardware","gated":false}],"gated":false},{"type":"text","content":" by providing users with the ability to submit quantum programs using its hardware-native gate format. Developers can now specify precisely what is happening to every qubit throughout their entire algorithm, improving overall usefulness through new error mitigation or post-processing techniques. The feature is now available via IonQ’s ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fdocs.ionq.com%2F&esheet=52717577&newsitemid=20220512005806&lan=en-US&anchor=direct+API&index=2&md5=b87f66939952c436bb75a90801dc30e4","contentObject":[{"type":"text","content":"direct API","gated":false}],"gated":false},{"type":"text","content":", Google Cloud Marketplace integration, and a variety of open-source tools such as Qiskit, Cirq, PennyLane and others.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Researchers, academics, developers, and other ‘tinkerers’ like to be as close to the metal as possible when designing quantum experiments that can surpass today’s benchmarks – they want to be able to play at every layer of the stack to extract as much performance and novel insight as possible from these systems,” said Nathan Shammah, from ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Funitary.fund%2F&esheet=52717577&newsitemid=20220512005806&lan=en-US&anchor=Unitary+Fund&index=3&md5=0db98a0bcf26420397e803231ac324da","contentObject":[{"type":"text","content":"Unitary Fund","gated":false}],"gated":false},{"type":"text","content":", the nonprofit organization developing Mitiq, the first open-source software for quantum error mitigation. “IonQ providing a native gate interface across several open-source tools further opens access and paves the way for the open source community to allow for further control and to improve performance in quantum computing software.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“By providing the open source community with greater access to IonQ’s quantum hardware through native gates, we are doubling down on our commitment to provide researchers with the tools needed to experiment with quantum computers in the way they best see fit,” said Jungsang Kim, Co-Founder and CTO at IonQ. “We believe that quantum’s true potential will only be realized by those willing to push the boundaries of what’s possible, and IonQ’s industry-leading hardware is designed to provide the ideal platform to build on top of and seek out solutions for the world’s most complex problems.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nToday’s news is the latest in a series of announcements by IonQ designed to push accessibility of quantum systems forward. In March, IonQ ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fionq.com%2Fnews%2Fmarch-04-2022-ionq-presents-at-qip-2022&esheet=52717577&newsitemid=20220512005806&lan=en-US&anchor=unveiled&index=4&md5=8530d9d3ea49663a5a45adef337e908b","contentObject":[{"type":"text","content":"unveiled","gated":false}],"gated":false},{"type":"text","content":" an industry-standard #AQ performance benchmark set to evaluate the quality of results output from a quantum computer. Additionally, IonQ ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fionq.com%2Fnews%2Ffebruary-10-2022-duke-ionq-new-qc-gate&esheet=52717577&newsitemid=20220512005806&lan=en-US&anchor=announced&index=5&md5=ba6cb0a75be7fb69e9ff2a4b50a28ba6","contentObject":[{"type":"text","content":"announced","gated":false}],"gated":false},{"type":"text","content":" in February the development of the N-qubit Toffoli gate alongside Duke University, introducing a new way to operate on many connected qubits at once by leveraging multi-qubit communication. More recently, IonQ ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fionq.com%2Fnews%2Fapril-19-2022-ionq-hyundai-quantum-machine-learning&esheet=52717577&newsitemid=20220512005806&lan=en-US&anchor=announced&index=6&md5=48ac5c4dfc007ccc9f08a8ff0fddace2","contentObject":[{"type":"text","content":"announced","gated":false}],"gated":false},{"type":"text","content":" the extension of its commercial partnership with Hyundai Motors to use quantum machine learning to improve the computation process for tasks like road sign image classification and simulation in a real-world test environment.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About IonQ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIonQ, Inc. is a leader in quantum computing, with a proven track record of innovation and deployment. IonQ’s latest generation quantum computer, IonQ Aria, is the world’s most powerful quantum computer, and IonQ has defined what it believes is the best path forward to scale. IonQ is the only company with its quantum systems available through the cloud on Amazon Braket, Microsoft Azure, and Google Cloud, as well as through direct API access. IonQ was founded in 2015 by Christopher Monroe and Jungsang Kim based on 25 years of pioneering research. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.ionq.com&esheet=52717577&newsitemid=20220512005806&lan=en-US&anchor=www.ionq.com&index=7&md5=31686599c0d5c47e26c610accf28dae8","contentObject":[{"type":"text","content":"www.ionq.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"IonQ Forward-Looking Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. Some of the forward-looking statements can be identified by the use of forward-looking words. Statements that are not historical in nature, including the words “anticipate,” “expect,” “suggests,” “plan,” “believe,” “intend,” “estimates,” “targets,” “projects,” “should,” “could,” “would,” “may,” “will,” “forecast” and other similar expressions are intended to identify forward-looking statements. These statements include those related to the anticipated benefits of native gate access; IonQ’s ability to further develop and advance its quantum computers and achieve scale; IonQ’s market opportunity and anticipated growth; and the commercial benefits to customers of using quantum computing solutions. Forward-looking statements are predictions, projections and other statements about future events that are based on current expectations and assumptions and, as a result, are subject to risks and uncertainties. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including but not limited to: market adoption of quantum computing solutions and IonQ’s products, services and solutions; the ability of IonQ to protect its intellectual property; changes in the competitive industries in which IonQ operates; changes in laws and regulations affecting IonQ’s business; IonQ’s ability to implement its business plans, forecasts and other expectations, and identify and realize additional partnerships and opportunities; and the risk of downturns in the market and the technology industry including, but not limited to, as a result of the COVID-19 pandemic. The foregoing list of factors is not exhaustive. You should carefully consider the foregoing factors and the other risks and uncertainties described in the “Risk Factors” section of IonQ’s Quarterly Report on Form 10-Q for the fiscal quarter ended March 31, 2022","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"1","gated":false}],"gated":false},{"type":"text","content":" and other documents filed by IonQ from time to time with the Securities and Exchange Commission. These filings identify and address other important risks and uncertainties that could cause actual events and results to differ materially from those contained in the forward-looking statements. Forward-looking statements speak only as of the date they are made. Readers are cautioned not to put undue reliance on forward-looking statements, and IonQ assumes no obligation and does not intend to update or revise these forward-looking statements, whether as a result of new information, future events, or otherwise. IonQ does not give any assurance that it will achieve its expectations.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n_________________\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"1","gated":false}],"gated":false},{"type":"text","content":" NTD: STET this if this will be filed prior to the 10-Q.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220512005806r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIonQ Media contact:\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Dillon Olagaray\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Mission North\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:ionq@missionnorth.com","contentObject":[{"type":"text","content":"ionq@missionnorth.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIonQ Investor Contact:\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:investors@ionq.com","contentObject":[{"type":"text","content":"investors@ionq.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220512005806/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220512005806/en/","gated":false}],"gated":false}],"gated":false}]}