{"id":"20220224005536","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab Selected by MDA to Design and Build Spacecraft for Globalstar","publishedDate":"2022-02-24T07:50:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Rocket Lab Selected by MDA to Design and Build Spacecraft for Globalstar","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"i","contentObject":[{"type":"text","content":"The $143 million contract is the largest spacecraft bus order placed with Rocket Lab to date, encompassing the design and manufacture of 17 state-of-the-art spacecraft for Globalstar’s newest satellites","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab USA, Inc. (Nasdaq: RKLB) (“Rocket Lab” or “the Company”), a global leader in launch services and space systems, today announced that it has been awarded a subcontract by MDA Ltd (TSX: MDA), a leading provider of advanced technology and services to the rapidly expanding global space industry, to lead the design and manufacture of 17 spacecraft buses for Globalstar’s new Low Earth Orbit satellites. Globalstar, Inc. (NYSE American: GSAT) is a leading provider of Mobile Satellite Services including customizable satellite IoT solutions for individuals and businesses globally.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab will lead the development of the spacecraft buses, while MDA will act as prime contractor to manufacture Globalstar’s satellites, lead the development of the payload, and perform the final satellite assembly, integration, and test. The partnership between Rocket Lab and MDA brings together two of the space industry’s most innovative satellite companies. The total initial contract value for Rocket Lab is US$143 million, with options to provide the satellite operations control center, launch dispensers, launch integration, and up to nine additional spacecraft with flexibility in timing to order such spacecraft. The satellites will integrate with and replenish Globalstar’s current constellation, ensuring service continuity. Globalstar expects to launch the satellites by the end of 2025.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“We are thrilled to be collaborating with MDA to develop Globalstar’s new satellites and are honoured to have the trust and support of two of the space industry’s most innovative companies,” said Peter Beck, Founder and CEO of Rocket Lab. “With this contract Rocket Lab is executing on its strategy to go beyond launch and lead the new space economy by delivering complete mission solutions spanning spacecraft manufacture, satellite subsystems, flight software, ground operations, and launch.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Cross-company collaboration and co-development is key to bringing new capabilities to market quickly to meet growing customer demand for advanced satellite technology,” said Mike Greenley, CEO of MDA. “Rocket Lab is a strong fit for MDA and working with them on this system is an opportunity to flex, expand, and strengthen the capabilities of both companies, now and in the future.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAll 17 of the 500kg spacecraft will be designed and manufactured at Rocket Lab’s Long Beach production complex and headquarters, where a new high-volume spacecraft manufacturing line is being developed to support growing customer demand for Rocket Lab satellites. Leveraging Rocket Lab’s vertically integrated space systems capabilities, the satellites will feature components and subsystems produced by Rocket Lab’s recently acquired companies including solar panels and structures from SolAero Technologies in Albuquerque, New Mexico, software from ASI by Rocket Lab in Denver, Colorado, and reaction wheels from Sinclair Interplanetary in Toronto, Canada. The telemetry and control radio for all spacecraft will also be a C-band variant of Rocket Lab’s Frontier Satellite Radio (Frontier-C).\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe contract is the result of a very detailed and highly competitive bid and evaluation process and Rocket Lab is honoured to have been selected by MDA. We believe Rocket Lab’s proposal met MDA’s and Globalstar’s stringent technical and schedule requirements, offered efficiencies through Rocket Lab’s high level of vertical integration, and that there is also strong cultural and operational alignment between the companies to deliver innovation and agility in today’s satellite market.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab’s suite of spacecraft components and subsystems include reaction wheels, star trackers, space solar power, radios, flight software, ground software, and separation systems. More than 1,000 spacecraft globally have successfully flown with hardware from Rocket Lab and the four companies it has acquired since 2020.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nImages and video\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&esheet=52585038&newsitemid=20220224005536&lan=en-US&anchor=www.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&index=1&md5=2e52f4f6a8a4c6619dda334ba417be95","contentObject":[{"type":"text","content":"www.rocketlabusa.com/about-us/updates/link-to-rocket-lab-imagery-and-video/","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nTwitter\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.twitter.com%2Frocketlab&esheet=52585038&newsitemid=20220224005536&lan=en-US&anchor=www.twitter.com%2Frocketlab&index=2&md5=e79aba4cc5a94328851a0a36a39be724","contentObject":[{"type":"text","content":"www.twitter.com/rocketlab","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAbout Rocket Lab\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 2006, Rocket Lab is an end-to-end space company with an established track record of mission success. We deliver reliable launch services, satellite manufacture, spacecraft components, and on-orbit management solutions that make it faster, easier and more affordable to access space. Headquartered in Long Beach, California, Rocket Lab designs and manufactures the Electron small orbital launch vehicle and the Photon satellite platform and is developing the Neutron 8-ton payload class launch vehicle. Since its first orbital launch in January 2018, Rocket Lab’s Electron launch vehicle has become the second most frequently launched U.S. rocket annually and has delivered 109 satellites to orbit for private and public sector organizations, enabling operations in national security, scientific research, space debris mitigation, Earth observation, climate monitoring, and communications. Rocket Lab’s Photon spacecraft platform has been selected to support NASA missions to the Moon and Mars, as well as the first private commercial mission to Venus. Rocket Lab has three launch pads at two launch sites, including two launch pads at a private orbital launch site located in New Zealand and a second launch site in Virginia, USA which is expected to become operational in 2022. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2F&esheet=52585038&newsitemid=20220224005536&lan=en-US&anchor=www.rocketlabusa.com&index=3&md5=9512538f993671137cce513555f429b4","contentObject":[{"type":"text","content":"www.rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release may contain certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities and Exchange Act of 1934, as amended. These forward-looking statements, including without limitation expectations regarding the timing of scheduled delivery of spacecraft buses and anticipated benefits of the subcontract, are based on Rocket Lab’s current expectations and beliefs concerning future developments and their potential effects. These forward-looking statements involve a number of risks, uncertainties (many of which are beyond Rocket Lab’s control), or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including risks related to the global COVID-19 pandemic; risks related to government restrictions and lock-downs in New Zealand and other countries in which we operate that could delay or suspend our operations; delays and disruptions in expansion efforts; our dependence on a limited number of customers; the harsh and unpredictable environment of space in which our products operate which could adversely affect our launch vehicle and spacecraft; increased congestion from the proliferation of low Earth orbit constellations which could materially increase the risk of potential collision with space debris or another spacecraft and limit or impair our launch flexibility and/or access to our own orbital slots; increased competition in our industry due in part to rapid technological development and decreasing costs; technological change in our industry which we may not be able to keep up with or which may render our services uncompetitive; average selling price trends; failure of our launch vehicles, satellites and components to operate as intended either due to our error in design in production or through no fault of our own; launch schedule disruptions; supply chain disruptions, product delays or failures; design and engineering flaws; launch failures; natural disasters and epidemics or pandemics; changes in governmental regulations including with respect to trade and export restrictions, or in the status of our regulatory approvals or applications; or other events that force us to cancel or reschedule launches, including customer contractual rescheduling and termination rights; risks that acquisitions may not be completed on the anticipated timeframe or at all or do not achieve the anticipated benefits and results; and the other risks detailed from time to time in Rocket Lab’s filings with the Securities and Exchange Commission (the “SEC”), including under the heading “Risk Factors” in the prospectus dated October 7, 2021 related to our Registration Statement on Form S-1 (File No. 333-259757), which was filed with the Securities and Exchange Commission pursuant to Rule 424(b) on October 7, 2021 and elsewhere (including that the impact of the COVID-19 pandemic may also exacerbate the risks discussed therein). There can be no assurance that the future developments affecting Rocket Lab will be those that we have anticipated. Except as required by law, Rocket Lab is not undertaking any obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220224005536r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Media Contact\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Morgan Bailey\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"+64 27 538 9039\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220224005536/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220224005536/en/","gated":false}],"gated":false}],"gated":false}]}