{"id":"20220505576","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Walmart, Kohl's to pay civil penalties to settle allegations of 'deceptive' claims that products were made of bamboo","publishedDate":"2022-05-05T10:36:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart Inc. (WMT) and Kohl's Corp. (KSS) agreed to pay a total of $5.5 million in civil penalties, as part of settlements to resolve allegations of violations of the Textile Fiber Products Identification Act (Textile Act), the U.S. Department of Justice announced Thursday. In complaints filed in 2015, the DOJ alleged that the retailers violated the Textile Act, and the Federal Trade Commission Act (FTC Act), but advertising products as being made by bamboo when they were actually made by rayon, and didn't contain any bamboo fibers. The DOJ also alleged the companies made \"deceptive claims\" that the products supposedly made of bamboo were environmentally friendly, although rayon is produced using toxic chemicals. Walmart will pay $3.0 million and Kohl's will pay $2.5 million, as part of the settlement. Walmart's stock fell 1.1% in midday trading and Kohl's shares shed 2.4%, while the Dow Jones Industrial Average  sank 911 points, or 2.7%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tomi Kilgore ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-05-22 1136ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}