{"id":"20220502005965","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab Successfully Deploys 34 Satellites and Catches Rocket Booster Returning from Space with Helicopter","publishedDate":"2022-05-02T20:28:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Successfully Deploys 34 Satellites and Catches Rocket Booster Returning from Space with Helicopter\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab (Nasdaq: RKLB) (“Rocket Lab” or “the Company”), a leading launch and space systems company, has successfully launched its 26th Electron mission, deploying 34 satellites to orbit. Rocket Lab has now deployed a total of 146 satellites to orbit with the Electron launch vehicle.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release features multimedia. View the full release here: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220502005965/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220502005965/en/","gated":false}],"gated":false}],"gated":false},{"type":"div","contentObject":[{"type":"img","src":"https://mms.businesswire.com/media/20220502005965/en/1440934/4/View_of_Electron_Booster_from_Recovery_Helicopter.jpg","alt":"View from recovery helicopter of Electron booster returning to Earth under parachute after launch (Photo: Business Wire)","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View from recovery helicopter of Electron booster returning to Earth under parachute after launch (Photo: Business Wire)","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe “There And Back Again” mission also saw Rocket Lab complete a mid-air capture of the Electron booster with a helicopter for the first time. After launching to space, Electron’s first stage returned to Earth under a parachute. At 6,500 ft, Rocket Lab’s Sikorsky S-92 helicopter rendezvoused with the returning stage and used a hook on a long line to capture the parachute line. The mid-air capture is a major milestone in Rocket Lab’s pursuit to make Electron a reusable rocket to increase launch frequency and reduce launch costs for small satellites. After the catch, the helicopter pilot detected different load characteristics than previously experienced in testing and offloaded the stage for a successful splashdown. The stage is being loaded onto Rocket Lab’s recovery vessel for transport back to the Company’s production complex for analysis and assessment for re-flight as planned.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe mid-air capture comes after successful recovery operations from Rocket Lab’s 16th, 20th, and 22nd missions, which saw Electron’s first stage execute a controlled ocean splashdown before being returned to Rocket Lab’s production complex. Like those missions, a reaction control system re-oriented the first stage to an ideal angle for re-entry during the “There And Back Again” mission, enabling the stage to survive the incredible heat and pressure during its descent back to Earth. A drogue parachute was deployed to increase drag and to stabilize the first stage as it descended, before a large main parachute was deployed in the final kilometers of descent. “There And Back Again” is the first time a helicopter catch attempt was introduced to recovery operations and today’s mission will inform future helicopter captures.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Bringing a rocket back from space and catching it with a helicopter is something of a supersonic ballet,” said Rocket Lab founder and CEO, Peter Beck. “A tremendous number of factors have to align and many systems have to work together flawlessly, so I am incredibly proud of the stellar efforts of our Recovery Team and all of our engineers who made this mission and our first catch a success. From here we’ll assess the stage and determine what changes we might want to make to the system and procedures for the next helicopter catch and eventual re-flight.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe “There And Back Again” mission launched from Pad A at Rocket Lab’s Launch Complex 1 on New Zealand’s Mahia Peninsula at 10:49 am NZST, 3 May 2022, deploying satellites for Alba Orbital, Astrix Astronautics, Aurora Propulsion Technologies, E-Space, Spaceflight, and Unseenlabs. The mission brings the total number of satellites launched by Rocket Lab to 146. Among the payloads deployed were satellites designed to monitor light pollution, demonstrate space junk removal technologies, improve power restraints in small satellites, validate technology for sustainable satellite systems that can avoid collisions with untrackable space objects, enable internet from space, and build upon a maritime surveillance constellation.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab’s next mission is scheduled in May 2022 with more details to be released in the coming days.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ Images & Video Content\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&esheet=52705353&newsitemid=20220502005965&lan=en-US&anchor=www.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&index=1&md5=9fa7cdfd7316acec629df06e6d3b7c5a","contentObject":[{"type":"text","content":"www.rocketlabusa.com/about-us/updates/link-to-rocket-lab-imagery-and-video/","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ About Rocket Lab\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 2006, Rocket Lab is an end-to-end space company with an established track record of mission success. We deliver reliable launch services, satellite manufacture, spacecraft components, and on-orbit management solutions that make it faster, easier and more affordable to access space. Headquartered in Long Beach, California, Rocket Lab designs and manufactures the Electron small orbital launch vehicle and the Photon satellite platform and is developing the Neutron 8-ton payload class launch vehicle. Since its first orbital launch in January 2018, Rocket Lab’s Electron launch vehicle has become the second most frequently launched U.S. rocket annually and has delivered 146 satellites to orbit for private and public sector organizations, enabling operations in national security, scientific research, space debris mitigation, Earth observation, climate monitoring, and communications. Rocket Lab’s Photon spacecraft platform has been selected to support NASA missions to the Moon and Mars, as well as the first private commercial mission to Venus. Rocket Lab has three launch pads at two launch sites, including two launch pads at a private orbital launch site located in New Zealand and a second launch site in Virginia, USA which is expected to become operational in 2022. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2F&esheet=52705353&newsitemid=20220502005965&lan=en-US&anchor=www.rocketlabusa.com&index=2&md5=ca04e742af20399ea43c09bbaf173ee5","contentObject":[{"type":"text","content":"www.rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220502005965r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ Rocket Lab Media Contact\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Morgan Bailey\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220502005965/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220502005965/en/","gated":false}],"gated":false}],"gated":false}]}