{"id":"20220414556","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"New York State's recent COVID case surge caused by two new versions of omicron that are even more infectious than BA.2","publishedDate":"2022-04-14T12:35:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Cases are up 77% in New York from two weeks ago and hospitalizations are also climbing again ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  A surge of COVID-19 cases in New York State that is making it once again an epicenter of the U.S. pandemic is due to two new versions of the omicron variant, that appear even more infectious than the BA.2 subvariant that has become dominant in the U.S. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The two, named BA.2.12 and BA.2.12.1, accounted for more than 70% of new cases in central New York State in March, according to a statement from the health department ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  They are sub-lineages of BA.2, which accounts for 80.6% of COVID cases in New York. The two appear to have a 23% to 27% growth advantage over BA.2. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Cases in New York are up 77% from two weeks ago, according to a New York Times tracker, and hospitalizations have climbed 19%. The rapid spread makes it more vital than ever that unvaccinated people get their shots and avoid dying an avoidable death. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"While these subvariants are new, the tools to combat them are not. These tools will work if we each use them: get fully vaccinated and boosted, test following exposure, symptoms, or travel, consider wearing a mask in public indoor spaces, and consult with your healthcare provider about treatment if you test positive,\" said State Health Commissioner Dr. Mary T. Bassett in the statement. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read now: Fauci warns: Don't 'pooh-pooh' COVID because of low hospitalizations, as new daily cases and deaths extend increases ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The World Health Organization said Wednesday that the omicron variant accounted for 99.2% of cases sequenced in the latest week, demonstrating just how dominant it has become. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Overall, the U.S. is averaging 33,691 cases a day, the Times tracker shows, up 22% from two weeks ago. The country is averaging 14,751 hospitalizations a day, down 14% from two weeks ago, the lowest since the first weeks of the pandemic. The daily death toll has fallen below 600 to 513, although that remains an undesirably high number. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In medical news, Pfizer (PFE) and German partner BioNTech (BNTX) said a Phase 2/3 trial of their COVID-19 vaccine booster showed a high immune response in children aged 5-to-11-years old. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Data from a sub-analysis of 30 sera from the trial showed a 36-fold increase in neutralizing titers against the omicron variant, which has become dominant globally. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"These data demonstrate an increase in SARS-CoV-2 Omicron variant and wild-type strain neutralizing titers following a booster dose of the Pfizer-BioNTech COVID-19 vaccine compared to two doses,\" the companies said in a joint statement. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n   They are planning to submit the data to the Food and Drug Administration and other regulatory bodies in the coming days. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Separately, Regeneron (REGN) said the FDA has extended the review time by three months on whether to fully approve Regen-Cov as a treatment for non-hospitalized COVID-19 patients and as a prophylactic. Regeneron said the extension has to do with using Regen-Cov to prevent COVID-19 infections. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Regen-Cov, which is a monoclonal antibody, was authorized as a COVID-19 treatment in November 2020; however, the therapy is not in use anywhere in the U.S. at this time because it is not effective against new variants. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Coronavirus Update: MarketWatch's daily roundup has been curating and reporting all the latest developments every weekday since the coronavirus pandemic began ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Other COVID-19 news you should know about: ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -- Shanghai is easing rules that confined most of its 25 million people to their homes after complaints they had trouble getting food, the Associated Press reported. But most of its businesses still are closed. Access to Guangzhou, an industrial center of 19 million people near Hong Kong, was suspended this week. Other cities are cutting off access or closing factories and schools. Spring planting by Chinese farmers who feed 1.4 billion people might be disrupted, Nomura economists warned Thursday. That could boost demand for imported wheat and other food, pushing up already high global prices. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n   -- The U.K. regulator has become the first to approve a COVID vaccine developed by French drug company Valneva , boosting the number of vaccines now allowed in the country to six. The Medicines and Healthcare products Regulatory Agency said it's also the first whole-virus inactivated COVID-19 vaccine to be approved. That kind of vaccine is made by growing virus in a lab and then making it inactive so it cannot infect cells or replicate in the body, but can still trigger an immune response, the MHRA said in a statement. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n   -- German Health Minister Karl Lauterbach said a foiled plot to kidnap him shows that there are people taking advantage of protests over COVID restrictions to destabilize the state and its democratic system, the Guardian reported Prosecutors said Thursday they had detained four people suspected of plotting to kidnap Lauterbach and damage power facilities to create a nationwide power outage. The suspects were tied to COVID protesters and with the far-right \"Reichsbürger\" movement, which denies the existence of the modern German state, the prosecutor's office in the western city of Koblenz said in a statement. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n   -- JD.com Inc. (JD) is sending more than 100 autonomous vehicles to Shanghai to help the city, which is under a strict lockdown due to a COVID-19 outbreak, with customer order deliveries, mobile cabin hospitals, and more. About 50 indoor delivery robots are being sent to help with the effort as well. \"With AI technology and multiple sensors, the robots can recognize and avoid obstacles, plan its route to the destination automatically and drive on public roads without human interaction,\" the company said in the announcement. JD's first autonomous vehicle was introduced in 2016. JD has previously pledged to give 16 million items, including rice, oil and flour, to Shanghai residents. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Here's what the numbers say ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The global tally of confirmed cases of COVID-19 topped 502.1  million on Wednesday, after breaching the half-billion mark on Tuesday. The death toll rose above 6.19 million, according to data aggregated by Johns Hopkins University. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The U.S. leads the world with 80.5 million cases and more than 987,687 fatalities. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Centers for Disease Control and Prevention's tracker shows that 218.6 million people living in the U.S. are fully vaccinated, equal to 65.8% of the total population. But just 99 million are boosted, equal to 45.3% of the vaccinated population. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  04-14-22 1335ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}