{"id":"20220224005735","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"PCT Announces Tests Results For Oklahoma & Grassy Creek Crude With Super Catholyte & Nanogas N2 Infused Super Catholyte","publishedDate":"2022-02-24T08:58:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"PCT Announces Tests Results For Oklahoma & Grassy Creek Crude With Super Catholyte & Nanogas N2 Infused Super Catholyte","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nPCT LTD (OTCPK: PCTL). In early February, at INTERTEK LABS, PCT studied Oklahoma & Grassy Creek Crude With Super Catholyte & Nanogas N2 Infused Super Catholyte. Gary J. Grieco, CEO of PCT, stated, “After our initial tests in December ,we saw significant","gated":false},{"type":"b","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":"increases in oil cut and now with our N2 infused Super Catholyte we are continuing to see increases such as 49.85%","gated":false},{"type":"b","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":"in our oil cuts, especially in the OK oil samples.” Gary continued with, “What we are demonstrating in wells with significant down hole production zone damage, coupled with mud like low gravity oil, is an extremely cost effective and environmentally friendly production enhancing oil recovery system.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFor the 14 day field study (7 days in Oklahoma and 7 days in Grassy Creek), a total of ten tests were run: two Spontaneous Imbibition tests at ambient temperature and eight Spontaneous Imbibition tests at a temperature of 120F. Each plug sample was saturated, using a vacuum or capillary force, with two crude oil to conduct this study.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe findings from these studies run in Grassy Creek, were equal to the field study results conducted back in December 2021 at a slight","gated":false},{"type":"b","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":"increase from 14.40% to 15.66%. When assessing the results in Oklahoma, they were much more significant with an increased oil recovery of 49.85%. This is also a reflection of the 34 gravity oil in Oklahoma as opposed to the 15 gravity oil in Grassy Creek.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nDue to the significant and successful results found in Oklahoma utilizing the new generator, PCT will initiate a final comprehensive field study. It will be conducted for a full week, in mid-March, upon transfer of the new-gen Catholyte generator from Oklahoma to Grassy Creek “If we can see good results in Grassy Creek with their heavily damaged wells and heavy crude, then our oil recovery system can work anywhere” said Gary Grieco. This generator produces our proprietary catholyte at an increase of 300% in parts per million (ppm) and a 500% increase in volume of catholyte produced.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“The results are so compelling that we are in discussion with multiple energy companies to start initiating paid test wells that, in turn, will bring revenue to PCT second quarter,” Grieco emphasized.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About PCT LTD.:","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nPCT LTD (\"PCTL\") focuses its business on acquiring, developing, and providing sustainable, environmentally safe disinfecting, cleaning, and tracking technologies. The company acquires and holds rights to innovative products and technologies, which are commercialized through its wholly owned operating subsidiary, Paradigm Convergence Technologies Corporation (PCT Corp). Currently trading on OTC: PINK, \"PCTL\" has applied for listing its common stock to the OTC QB market. The Company established entry into its target markets with commercially viable products in the United States and now looks forward to gaining market share in the U.S. and U.K.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nADDITIONAL NEWS AND CORPORATE UPDATES:\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nPCTL would like to warn its stockholders and potential investors that material corporate information regarding sales, areas of business and other corporate updates will only be made through press releases or filings with the SEC and through Twitter (PCTL@PCTL_). PCTL does not utilize social media, chatrooms, or other online sources to disclose material information. The public should only rely on official press releases, Tweets from the Company’s official Twitter account, and corporate filings for accurate and up to date information regarding PCTL.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nForward-Looking Statements:\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release contains \"forward-looking statements\" as defined in Section 27A of the Securities Act of 1933, as amended, and Section 21B of the Securities Exchange Act of 1934, as amended. Any statements that express or involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, goals, assumptions or future events or performance are not statements of historical fact and may be \"forward-looking statements.\"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nSuch statements are based on expectations, estimates and projections at the time the statements are made that involve a number of risks and uncertainties, which could cause actual results or events to differ materially from those presently anticipated. Such statements involve risks and uncertainties, including but not limited to: PCTL's ability to raise sufficient funds to satisfy its working capital requirements; the ability of PCTL to execute its business plan; the anticipated results of business contracts with regard to revenue; and any other effects resulting from the information disclosed above; risks and effects of legal and administrative proceedings and government regulation; future financial and operational results; competition; general economic conditions; and the ability to manage and continue growth. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual outcomes may vary materially from those indicated. Important factors that could cause actual results to differ materially from the forward-looking statements PCTL makes in this press release include market conditions and those set forth in reports or documents it files from time to time with the SEC. PCTL undertakes no obligation to revise or update such statements to reflect current events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pctl.com&esheet=52585115&newsitemid=20220224005735&lan=en-US&anchor=www.pctl.com&index=1&md5=62c6135c8e93fb8034359aca69c54162","contentObject":[{"type":"text","content":"www.pctl.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nLinkedIn: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.linkedin.com%2Fin%2Fparadigm-convergence-technologies-b52571224%2F&esheet=52585115&newsitemid=20220224005735&lan=en-US&anchor=https%3A%2F%2Fwww.linkedin.com%2Fin%2Fparadigm-convergence-technologies-b52571224%2F&index=2&md5=e429675b8f894fbb8e46d1401eddf14c","contentObject":[{"type":"text","content":"https://www.linkedin.com/in/paradigm-convergence-technologies-b52571224/ \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Twitter: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Ftwitter.com%2FPCTL_&esheet=52585115&newsitemid=20220224005735&lan=en-US&anchor=https%3A%2F%2Ftwitter.com%2FPCTL_&index=3&md5=c0653818025ac50247c6ab49b07acf48","contentObject":[{"type":"text","content":"https://twitter.com/PCTL_","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220224005735r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nInvestor Relations:\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Craig Fischer\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:IR@pctl.com","contentObject":[{"type":"text","content":"IR@pctl.com \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"786-375-0556\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220224005735/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220224005735/en/","gated":false}],"gated":false}],"gated":false}]}