{"id":"8503694","sourceId":"globe-newswire","sourceName":"GlobeNewswire","providerName":"GlobeNewswire","title":"Prizeout Announces Integration with Q2’s Digital Banking Platform","publishedDate":"2022-03-16T08:33:00-05:00","body":[{"type":"p","contentObject":[{"type":"em","contentObject":[{"type":"text","content":"Prizeout’s integration brings benefits directly to the local communities of Q2’s banking partners.","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"NEW YORK, March  16, 2022  (GLOBE NEWSWIRE) -- Prizeout Corp. (Prizeout), an innovative ad-tech company that works within a wide variety of industries to turn withdrawals into a growth solution for eCommerce and retail businesses, has announced its integration with Q2’s Digital Banking Platform. ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=5aAGoEwKw1LCZbBkJwZW1VGjr6kfRl9I-_IhmIbhY4gCwLlNFYP6n5oxarPYMgUMZ1K0S103V0QVrOJKhMPBlg==","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Q2 Holdings, Inc.","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" (NYSE: QTWO), is a leading provider of digital banking and lending solutions.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"As part of Q2’s Partner Accelerator Program, Prizeout’s integration has been standardized so it can work seamlessly across all 450+ Q2 banks and credit unions, who now have the option to deploy this integration to their customers. Account holders who use Prizeout’s platform can convert their online funds into digital gift cards to their favorite brands, many of which offer added value on top of the gift card amount. Gift cards are delivered instantly and cost the customer no transaction fees.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"According to recent studies, getting more value for their money is a customer’s leading factor of importance when dealing with financial institutions. The Prizeout platform allows customers to maximize purchasing power for everyday expenses such as groceries, food delivery, and more. On average, Prizeout offers 11% more value on every withdrawal.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"A Prizeout integration will also be a boon to business accounts as well. While Prizeout has relationships with hundreds of national retailers, the Prizeout platform has the ability to onboard a bank or credit union’s local business clients, even if they don’t currently have a gift card program. By including them as part of the consideration set, Prizeout can drive revenue to local businesses and keep money within the community.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"“We’re thrilled to be able to help each part of the banking ecosystem.” said Prizeout CEO David Metz. “Not only will an account holder be getting more for their hard-earned money, but they have the opportunity to cycle that back into local businesses within their community. Furthermore, the Q2 integration makes it simple for the banks and credit unions to introduce this program to customers and earn increased engagement and retention.”","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"ABOUT PRIZEOUT","gated":false},{"type":"br","gated":false},{"type":"text","content":"Founded in 2019, Prizeout is a first-in-class ad-tech company that works within the gaming, neobank, crypto, gig economy, payroll & finance industries to turn withdrawals into a growth solution for e-commerce & retail businesses. Through its exclusive partnerships, Prizeout offers users unprecedented access to bonus offers on popular and emerging brand favorites while providing them with a fast, secure and curated experience. For more information about Prizeout, please visit ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=AyPrZEYjwCHWt1lMMrkY-yBYBW8iKArPsyQetBth7H-L_oeG1iVVB1PE6hAuRUNFbqvTYKyVQXL3oTLGs5gMYQ==","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"https://prizeout.com/","gated":false}],"gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"About Q2 Holdings, Inc.","gated":false},{"type":"br","gated":false},{"type":"text","content":"Q2 is a financial experience company dedicated to providing digital banking and lending solutions to banks, credit unions, alternative finance, and fintech companies in the U.S. and internationally. With comprehensive end-to-end solution sets, Q2 enables its partners to provide cohesive, secure, data-driven experiences to every account holder – from consumer to small business and corporate. Headquartered in Austin, Texas, Q2 has offices worldwide and is publicly traded on the NYSE under the stock symbol QTWO. To learn more, please visit ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=OG1ZEe2w3aF1Joud2uSWFsFTodlWepIgucTJoehnlAENpbYcghE9ZNmgf9QCSoHB","contentObject":[{"type":"text","content":"Q2.com","gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"img","src":"https://www.globenewswire.com/newsroom/ti?nf=ODUwMzY5NCM0Nzg2NzU2IzIyMjQ4NjU=","alt":"","variations":[],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"img","src":"https://ml.globenewswire.com/media/ODhkZmIyMzEtNjNlOC00NDdlLWFmYWEtYTI3MGVlZDk5ZDcwLTEyMzY0MTg=/tiny/Prizeout.png","alt":"","variations":[],"gated":false},{"type":"pre","contentObject":[{"type":"text","content":"For more information contact:\nScott Robinson\nVP of Marketing, Prizeout\npr@prizeout.com","gated":false}],"gated":false}]}