{"id":"20220516236","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Griffon soars toward biggest gain in 35 years after reviewing alternatives, including possible sale","publishedDate":"2022-05-16T09:27:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Shares of Griffon Corp. (GFF) soared 23.4% toward a record in morning trading Monday, after the diversified management and holding company said it started a review of strategic alternatives to maximize shareholder value, which could include a sale of the company, a divestiture or a recapitalization. The stock is also headed for the biggest one-day gain since it ran up 30.0% since Oct. 31, 1987. Chief Executive Ronald Kramer said the review comes on the belief that there is a \"profound disconnect\" between Griffon's underlying value of its businesses and the stock price. \"Given this disconnect, the Board and management believe it is necessary to consider a review of alternatives, with a focus on maximizing near-term shareholder value creation,\" Kramer said. \"Our top priority is unlocking the true intrinsic value of Griffon for our shareholders.\" The company said there is no timeline for the review, and there is no assurance that it will result in any transaction. The stock, which is trading above the Dec. 28, 2021 record close of $29.06, has gained 11.2% over the past 12 months, while the S&P 500  has slipped 3.8%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tomi Kilgore ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-16-22 1027ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}