{"id":"20220516005964","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab Begins Payload Integration for CAPSTONE Mission to the Moon","publishedDate":"2022-05-16T15:35:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Begins Payload Integration for CAPSTONE Mission to the Moon\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"i","contentObject":[{"type":"text","content":"Rocket Lab will launch the CAPSTONE spacecraft to a unique lunar transfer orbit using the Electron launch vehicle and Lunar Photon spacecraft bus, charting a new path for NASA's Moon-orbiting space station to be used by Artemis astronauts","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab (Nasdaq: RKLB) (“Rocket Lab” or “the Company”), a leading launch and space systems company, today announced that the CAPSTONE spacecraft has arrived at Rocket Lab Launch Complex 1 in Mahia, New Zealand in preparation for launch to lunar orbit. With the spacecraft now at the launch site, Rocket Lab will begin payload integration with the Electron rocket and Photon spacecraft bus ahead of the launch window opening on May 31.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release features multimedia. View the full release here: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220516005964/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220516005964/en/","gated":false}],"gated":false}],"gated":false},{"type":"div","contentObject":[{"type":"img","src":"https://mms.businesswire.com/media/20220516005964/en/1457324/4/CAPSTONE_wet_dress_rehearsal.jpg","alt":"Rocket Lab's Electron launch vehicle on the pad at Launch Complex 1 for a dress rehearsal ahead of the CAPSTONE mission. (Photo: Business Wire)","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Rocket Lab's Electron launch vehicle on the pad at Launch Complex 1 for a dress rehearsal ahead of the CAPSTONE mission. (Photo: Business Wire)","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nDesigned and built by Tyvak Nano-Satellite Systems, a Terran Orbital Corporation, and owned and operated by Advanced Space, the Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment (CAPSTONE) CubeSat will be the first spacecraft to test the Near Rectilinear Halo Orbit (NRHO) around the Moon. Researchers expect this orbit to be a gravitational sweet spot in space – where the pull of gravity from Earth and the Moon interact to allow for a nearly-stable orbit – allowing physics to do most of the work of keeping a spacecraft in orbit around the Moon. NASA has big plans for this unique type of orbit. The agency hopes to park bigger spacecraft – including the lunar-orbiting space station Gateway – in an NRHO around the Moon, providing astronauts with a base from which to descend to the lunar surface as part of the Artemis program.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nCAPSTONE will be launched to an initial low Earth orbit by Rocket Lab’s Electron launch vehicle and then placed on a ballistic lunar transfer by Rocket Lab’s Lunar Photon spacecraft bus. Unlike the Apollo lunar missions of the 1960s and 70s, which took a free return trajectory to the Moon, this fuel efficient ballistic lunar transfer makes it possible to deploy CAPSTONE to such a distant orbit using a small launch vehicle. Standing at just 59 feet tall, Electron is the smallest rocket to attempt a launch to the Moon.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAround ten minutes after lift-off on Electron, Rocket Lab’s Lunar Photon spacecraft bus, with CAPSTONE attached, will separate from the rocket and carry out a series of orbit raising maneuvers, stretching its orbit into a prominent ellipse around Earth. About six days after launch, a final burn from Photon’s 3D printed HyperCurie engine will accelerate Photon to 24,500 miles per hour, enabling it to escape low-Earth orbit and set CAPSTONE on a course for the Moon. Within 20 minutes of the final burn, Photon will release CAPSTONE into space for the first leg of the CubeSat’s solo flight. CAPSTONE’s journey to NRHO is expected to take around four months from this point. Once successfully inserted into the orbit, CAPSTONE is expected to remain there for at least six months, allowing NASA to study the orbit dynamics.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“CAPSTONE’s arrival at Launch Complex 1 marks a major milestone in this historic mission. We’re excited to move into the final integration and test phase ahead of launch day,” said Rocket Lab founder and CEO, Peter Beck. “This is our most ambitious Photon mission yet and a significant step toward providing scientific missions with dedicated and affordable access to interplanetary orbits. Less than four years after our first Electron mission for NASA, it’s fantastic to be working with the agency and its partners again to go beyond low Earth orbit and pave the way for humanity’s return to the Moon.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab has carried out 26 Electron launches since 2017, but the CAPSTONE mission will be Rocket Lab’s first launch beyond low Earth orbit. Rocket Lab also operates two Photon spacecraft in low Earth orbit, but the CAPSTONE mission is the first to employ the high energy variant of the Photon spacecraft bus, powered by the HyperCurie engine, designed to support lunar and interplanetary missions. CAPSTONE is the first in a series of interplanetary missions for Photon, including the ESCAPADE mission to Mars in 2024 and Rocket Lab’s private mission to Venus in 2023.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFor real time updates on the CAPSTONE mission in the lead up to launch, follow Rocket Lab, NASA, Advanced Space, and Terran Orbital on Twitter.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n@RocketLab\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"@NASAAmes\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"@AdvancedSpace\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"@TerranOrbital\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ Images & Video Content\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&esheet=52721373&newsitemid=20220516005964&lan=en-US&anchor=www.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&index=1&md5=2cf9b5c039a7893e0721f30279fc2418","contentObject":[{"type":"text","content":"www.rocketlabusa.com/about-us/updates/link-to-rocket-lab-imagery-and-video/","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ About Rocket Lab\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 2006, Rocket Lab is an end-to-end space company with an established track record of mission success. We deliver reliable launch services, satellite manufacture, spacecraft components, and on-orbit management solutions that make it faster, easier and more affordable to access space. Headquartered in Long Beach, California, Rocket Lab designs and manufactures the Electron small orbital launch vehicle and the Photon satellite platform and is developing the Neutron 8-ton payload class launch vehicle. Since its first orbital launch in January 2018, Rocket Lab’s Electron launch vehicle has become the second most frequently launched U.S. rocket annually and has delivered 146 satellites to orbit for private and public sector organizations, enabling operations in national security, scientific research, space debris mitigation, Earth observation, climate monitoring, and communications. Rocket Lab’s Photon spacecraft platform has been selected to support NASA missions to the Moon and Mars, as well as the first private commercial mission to Venus. Rocket Lab has three launch pads at two launch sites, including two launch pads at a private orbital launch site located in New Zealand and a second launch site in Virginia, USA which is expected to become operational in 2022. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2F&esheet=52721373&newsitemid=20220516005964&lan=en-US&anchor=www.rocketlabusa.com&index=2&md5=29f1fb90026d6ffe88f836d4e12a0a96","contentObject":[{"type":"text","content":"www.rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220516005964r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Morgan Bailey\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220516005964/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220516005964/en/","gated":false}],"gated":false}],"gated":false}]}