{"id":"20220426137","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"China's latest COVID outbreak spooks investors, while U.S. cases and hospitalizations are rising again","publishedDate":"2022-04-26T06:44:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  U.S. cases are up more than 50% from two weeks ago, and hospitalizations are up 4% ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  A fresh outbreak of COVID-19 cases in Chinese capital Beijing was dominating headlines on the pandemic on Monday as health officials reacted with extreme measures to prevent further spread. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Beijing started to test millions and shut down residential and business districts, after 47 cases were found since Friday, as the Associated Press reported. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The city's more than 21 million residents began to stock up on food, anxious to avoid the shortages that hit Shanghai in recent weeks amid a strict lockdown. Long lines formed in supermarkets as shoppers purchased rice, noodles, vegetables and other food items, while store workers hastily restocked some empty shelves. State media issued reports saying supplies remained plentiful in Beijing despite the buying surge. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Shanghai, which has been locked down for more than two weeks, reported more than 19,000 new infections and 51 deaths in the latest 24-hour period, pushing its death toll from the ongoing outbreak to more than 100. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The central city of Anyang, along with Dandong on the border with North Korea, also announced lockdowns as the omicron variant spreads across the vast country. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"China's zero-COVID policy may turn into a zero-growth policy,\" said David Donabedian, chief investment officer of CIBC Private Wealth U.S.,  with $98 billion in assets under management. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"China's economy had been growing, but lockdowns are weakening that economy and raising global concerns. China plays a huge part in the global supply chain, so closing factories and ports has created a shortage mentality that is front and center in the financial markets right now,\" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The news unsettled U.S. stock investors, coming at a time when cases have started to rise again in the U.S. after their steep decline early in the year, driven by the BA.2 variant, and two new subvariants that appear to be even more infectious. The two, named BA.2.12 and BA.2.12.1, were highlighted by health officials in New York State recently. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The U.S. is averaging 46,925 cases a day, according to a New York Times tracker, up 51% from two weeks ago. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Hospitalizations, which had also been steadily declining, are also ticking up. The country is averaging 15,642 hospitalizations a day, up 4% from two weeks ago, but still close to the lowest since the first weeks of the pandemic. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The daily death toll has fallen below 400 to 362, on average.  The official U.S. death toll is expected to exceed 1  million within weeks. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Public health officials are concerned that the world is not going to meet the target set last year by the World Health Organization of getting 70% of the global population vaccinated by June, the New York Times reported ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The momentum has stalled as U.S. COVID funding has dried up, with only a handful of the world's poorest countries, including Bangladesh, Bhutan, Cambodia and Nepal, reaching the 70% threshold. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The WHO has repeatedly warned that allowing the virus to run unchecked in major parts of the world creates the risk that new variants will emerge and that those could prove resistant to vaccines. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Coronavirus Update: MarketWatch's daily roundup has been curating and reporting all the latest developments every weekday since the coronavirus pandemic began ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Other COVID-19 news you should know about: ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -- New York City Mayor Eric Adams said Sunday he is planning to invest more than $170 million in the budget for fiscal 2023 to help homeless New Yorkers get off the streets. The money is expected to fund 1,400 more shelter beds. \"With increased risk and difficulty accessing resources during the pandemic, it is more important now than ever to provide shelter and resources for the unsheltered population around the city, said city council member Althea Stevens in remarks on the news. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See now: Can a decades-old antidepressant keep COVID-19 patients out of the hospital? ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -- Britain's travel curbs on airlines during the COVID pandemic were disproportionate and confusing -- and financially ravaged the sector, U.K. lawmakers concluded Monday, as AFP reported Parliament's cross-party transport committee delivered the verdict in a key report into aviation during the emergency health crisis. Britain imposed passenger testing and quarantine rules, and a \"traffic light\" system ranking COVID risks from destination countries. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -- One of the first cruise ships to be allowed to return to Western Australia is experiencing a COVID outbreak, the Guardian reported. Health officials said they are working to manage an undisclosed number of positive cases on the Coral Discoverer, which is docked at Broome in he state's northwest. Small cruise ships carrying no more than 350 passengers and crew have been permitted to enter  Western Australia  waters since April 17. The Coral Discovered has a capacity of just 72 passengers. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -- French drug company Valneva SE  said the European Medicines Agency has requested additional information about its COVID-19 vaccine candidate. Valneva said it will respond to the request, and if the new data are accepted by the EMA's Committee for Medicinal Products for Human Use, it expects authorization this quarter. The U.K. recently authorized Valneva's COVID-19 shot. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Here's what the numbers say ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The global tally of confirmed cases of COVID-19 topped 509.8 million on Friday, while the death toll rose above 6.21 million, according to data aggregated by Johns Hopkins University. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The U.S. leads the world with 81 million cases and more than 991,424 fatalities. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Centers for Disease Control and Prevention's tracker shows that 219.3 million people living in the U.S. are fully vaccinated, equal to 66.1% of the total population. But just 100 million are boosted, equal to 45.6% of the vaccinated population. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  04-26-22 0744ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}