{"id":"20220317fl95374","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"PureCycle Adds Top Industry Leaders to Board of Directors","publishedDate":"2022-03-17T07:30:00-05:00","body":[{"type":"text","content":"PureCycle Adds Top Industry Leaders to Board of Directors\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"PureCycle Adds Top Industry Leaders to Board of Directors","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"ORLANDO, Fla., March 17, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"i","contentObject":[{"type":"text","content":"Company bids farewell to founding board member","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"ORLANDO, Fla., March 17, 2022 /PRNewswire/ -- Today, PureCycle (NASDAQ: PCT) announced the appointment of two new members to its Board of Directors. Steven F. Bouck, former president of Waste Connections, Inc. and Allen Jacoby, chief strategy officer and senior vice president of corporate development for Milliken & Company joined PureCycle's Board of Directors effective March 15, 2022. Together, Bouck and Jacoby bring more than 50 years of relevant experience to the board and will help PureCycle continue to advance its mission and business objectives. Each of Jacoby and Bouck qualify as an independent director under the NASDAQ listing rules independence standards.","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n                ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n                        ","gated":false},{"type":"a","href":"https://mma.prnewswire.com/media/1730092/PureCycle_Logo.html","contentObject":[{"type":"text","content":"\n                    ","gated":false},{"type":"img","src":"https://mma.prnewswire.com/media/1730092/PureCycle_Logo.jpg","alt":"(PRNewsfoto/PureCycle Technologies)","variations":[],"gated":false},{"type":"text","content":"\n                        ","gated":false}],"gated":false},{"type":"text","content":"\n                ","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Mike Otworth, chairman of the board and chief executive officer, PureCycle, said, ","gated":false}],"gated":false},{"type":"text","content":"\"We are thrilled to expand our board with the addition of Allen and Steven who will bring deep industry and recycling knowledge to our bench. We have worked hard to ensure our board represents the different experiences within our industry, and our two new members are no exception. They are both proven and successful leaders and will serve PureCycle well.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Steven Bouck, former president, Waste Connections, Inc., said,","gated":false}],"gated":false},{"type":"text","content":" \"I am grateful and excited for the opportunity to join PureCycle's Board of Directors. Being connected to an innovative and entrepreneurial organization is an exciting new challenge and I look forward to bringing my finance and environmental experience to this top-notch team.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Allen Jacoby, chief strategy officer and senior vice president of corporate development, Milliken & Company,","gated":false}],"gated":false},{"type":"text","content":" said, \"I am ready to roll up my sleeves and begin working with my fellow board members to achieve PureCycle's overall mission of revolutionizing plastic waste into a renewable resource. PureCycle is a leader in the plastics recycling technology space, and I look forward to helping guide the company through commercialization.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Bouck, 65, worked for Waste Connections, Inc., for more than 20 years serving first as its chief financial officer and then as president until his departure in 2018. Before joining Waste Connections Inc., he developed significant financial services experience, focus on the environmental industry, through his roles with First Analysis Corporation. Bouck currently does not serve on any other public company boards.  ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Jacoby","gated":false},{"type":"b","contentObject":[{"type":"text","content":", ","gated":false}],"gated":false},{"type":"text","content":"55, has more than 30 years of leadership experience serving in top roles in research and development, manufacturing, strategy, and finance within the plastics and technology industries. He has spent 19 years at Milliken & Company, working his way from business manager to his current role as chief strategy officer and senior vice president of corporate development. Jacoby currently does not serve on any other public company boards.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PureCycle also announced the resignation of Richard \"Rick\" Brenner from PureCycle's Board of Directors effective March 15, 2022. Brenner submitted his resignation from the board to focus more time on his increasing business obligations outside of PureCycle. Mr. Brenner was appointed an inaugural member of PureCycle's public company board when it listed with NASDAQ in March 2021.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Otworth ","gated":false}],"gated":false},{"type":"text","content":"added, \"We are incredibly thankful for Rick's service and longstanding commitment to PureCycle. We have benefitted significantly from the leadership and insight he brought to the board. Rick has been a positive force from the creation of our company to listing as a public company and we are grateful for his contributions.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"With the two new appointments and Brenner's resignation, the Board is currently comprised of 8 members, six of whom have been deemed independent under NASDAQ listing rules.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Media Contact:","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Anna Farrar ","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:afarrar@purecycle.com","contentObject":[{"type":"text","content":"afarrar@purecycle.com","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"text","content":"954.647.7059","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"About PureCycle Technologies","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"PureCycle Technologies LLC, a subsidiary of PureCycle Technologies, Inc., holds a global license to commercialize the only patented, solvent-based purification recycling technology, developed by The Procter & Gamble Company (P&G), for restoring waste polypropylene (PP) into ultra-pure resin. The proprietary process removes color, odor and other contaminants from recycled feedstock resulting in an ultra-pure polypropylene suitable for any PP market. To learn more, visit purecycle.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"This press release contains forward-looking statements, including statements about the Ironton facility and Augusta facility. In addition, any statements that refer to projections, forecasts or other characterizations of future events or circumstances, including any underlying assumptions, are forward-looking statements. Forward-looking statements are typically identified by words such as \"plan,\" \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"outlook,\" \"estimate,\" \"forecast,\" \"project,\" \"continue,\" \"could,\" \"may,\" \"might,\" \"possible,\" \"potential,\" \"predict,\" \"should,\" \"would\" and other similar words and expressions, but the absence of these words does not mean that a statement is not forward-looking.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The forward-looking statements are based on the current expectations of the management of PCT and are inherently subject to uncertainties and changes in circumstances and their potential effects and speak only as of the date of such statement. There can be no assurance that future developments will be those that have been anticipated. These forward-looking statements involve a number of risks, uncertainties or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. These risks and uncertainties include, but are not limited to, those factors described in the section of PCT's Quarterly Report on Form 10-Q entitled \"Risk Factors,\" those discussed and identified in public filings made with the SEC by PCT and the following:","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"ul","contentObject":[{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to satisfy all conditions to closing for the Offering and to consummate the transaction in a timely manner, or at all; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to meet, and to continue to meet, applicable regulatory requirements for the use of PCT's ultra-pure recycled (\"UPR\") resin (as defined below) in food grade applications (both in the United States and abroad); ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to comply on an ongoing basis with the numerous regulatory requirements applicable to the UPR resin and PCT's facilities (both in the United States and abroad); ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"Expectations and changes regarding PCT's strategies and future financial performance, including its future business plans, expansion plans or objectives, prospective performance and opportunities and competitors, revenues, products and services, pricing, operating expenses, market trends, liquidity, cash flows and uses of cash, capital expenditures, and PCT's ability to invest in growth initiatives; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to scale and build its first commercial-scale recycling facility in Lawrence County, Ohio in a timely and cost-effective manner; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to complete the necessary financing with respect to, and complete the construction of, its first U.S. cluster facility, located in Augusta, Georgia, in a timely and cost-effective manner; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to sort and process polypropylene plastic waste at its plastic waste prep facilities; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to maintain exclusivity under the Procter & Gamble Company license (as described below); ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the implementation, market acceptance and success of PCT's business model and growth strategy; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the success or profitability of PCT's offtake arrangements; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the ability to source feedstock with a high polypropylene content; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's future capital requirements and sources and uses of cash; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"PCT's ability to obtain funding for its operations and future growth; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"developments and projections relating to PCT's competitors and industry; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the outcome of any legal or regulatory proceedings to which PCT is, or may become, a party including the recently filed securities class action case and the ongoing SEC investigation; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the ability to recognize the anticipated benefits of the previously-announced business combination (the \"Business Combination\") consummated on March 17, 2021; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"unexpected costs related to the Business Combination; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"geopolitical risk and changes in applicable laws or regulations; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the possibility that PCT may be adversely affected by other economic, business, and/or competitive factors; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"labor shortages and turnover or increases in employees and employee-related costs; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the potential impact of climate change on the company, including physical and transition risks, higher regulatory and compliance costs, reputational risks, and availability of capital on attractive terms; ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"operational risk; and ","gated":false}],"gated":false},{"type":"li","contentObject":[{"type":"text","content":"the risk that the COVID-19 pandemic (\"COVID-19\"), including any new and emerging variants and the efficacy and distribution of vaccines, and local, state, federal and international responses to addressing the pandemic may have an adverse effect on PCT's business operations, as well as PCT's financial condition and results of operations.","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Should one or more of these risks or uncertainties materialize or should any of the assumptions made by the management of PCT prove incorrect, actual results may vary in material respects from those projected in these forward-looking statements.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"All subsequent written and oral forward-looking statements or other matters attributable to PCT or any person acting on their behalf are expressly qualified in their entirety by the cautionary statements contained or referred to in this press release. Except to the extent required by applicable law or regulation, PCT undertakes no obligation to update these forward-looking statements to reflect events or circumstances after the date of this press release or to reflect the occurrence of unanticipated events.","gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=FL95374&sd=2022-03-17","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content to download multimedia:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/purecycle-adds-top-industry-leaders-to-board-of-directors-301505010.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/purecycle-adds-top-industry-leaders-to-board-of-directors-301505010.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  PureCycle Technologies","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false}]}