{"id":"20220517434","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Walmart says consumers are trading down to private label for items like dairy and bacon","publishedDate":"2022-05-17T15:15:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Tonya Garcia ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart's profit missed first-quarter expectations after pressure from inventory delays, costs and a facility fire ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart Inc. says it's seeing customers increasingly trade down to private-label goods amid sky-high inflation. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Consumers are feeling inflation pressures as evidenced by an increase in grocery private-label penetration,\" said Brett Biggs, Walmart's (WMT) chief financial officer on the early Tuesday earnings call, according to a FactSet transcript. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  John Furner, chief executive of Walmart U.S., said the move to private labels is happening in categories like \"deli, lunch meat, bacon [and] dairy.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart, which discussed the range of income levels it serves on its call, says it's keeping an eye on how inflation is squeezing those on the lower end. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"[W]e need to do more to keep costs low, and where we see the switching from brands to private brands, we'll continue to watch that for a group of customers, but we've got to all work harder to keep prices low for the American consumer,\" Furner said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Analysts had forecast a move to private labels as inflation continued rising to a 40-year high. Experts say companies have raised the level of quality in private labels to make them more enticing, putting pressure on big brands to emphasize value as prices and costs march upward. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See:Rising wages and labor shortage threaten U.S. effort to tame inflation quickly ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Also: P&G makes the case for its premium products as consumer budgets battle shrinkflation and rising prices ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Treehouse Foods Inc. (THS), a maker of private-label goods, reported a revenue beat and narrower-than-expected losses in the most recent quarter as private-label consumption grows. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read: TreeHouse Foods shares jump as private-label goods make gains across income levels ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart is adjusting prices in other parts of the store due to inflation and inventory levels as well. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"[P]art of what's at play here is you've got food inflation moving up, but we've got general merchandise categories like apparel and some of our hardlines categories to play with,\" said Chief Executive Doug McMillon on the call, according to FactSet. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"[A]nd the beauty of it is customers are even more price-sensitive right now, they are paying close attention, fuel prices are high, food prices are high, and so when you bring something down in sporting goods or hardware, one of these other categories, they notice even more than they would notice before and that makes the elasticity impact be different than it would be otherwise.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart ran into inventory challenges during the quarter, one of several hurdles that drove a profit miss. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  And: Walmart shares fall after profit misses expectations ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"As it relates to Walmart U.S. general merchandise sales, we knew that we were up against stimulus dollars from last year, but the rate of inflation in food pulled more dollars away from GM [gross margin] than we expected as customers needed to pay for the inflation in food,\" McMillon said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We like the fact that our inventory is up because so much of it is needed to be in-stock [...] but a 32% increase is higher than we want. We'll work through most or all of the excess inventory over the next couple of quarters.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Some merchandise was delayed, Walmart executives said, driving higher-than-normal markdowns, putting gross margin under pressure by about $100 million. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Retailers and consumer companies continue to face challenges even as companies and those working within the supply chain network work to clear the backup that began last year. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Also: Christmas in July: Hasbro moves up inventory purchases to make sure there are enough toys for the holidays ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Grocery Outlet Holding Corp. (GO), an \"extreme value\" grocery retailer, said during its first-quarter earnings report last week that it is taking advantage of supply chain challenges to offer customers a better deal. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Some recent examples of how we are capitalizing on the current environment include our purchase of 20,000 cases of frozen entrees from a highly recognized brand, which we offer to customers at a more than 50% discount,\" said Grocery Outlet President Robert Sheedy during the earnings call, according to FactSet. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The product was produced for the European market, but due to instability in the region and rising freight costs became available to the company \"at an extreme value,\" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Another example was a purchase of 25,000 cases of a premier gourmet popcorn that was originally headed to a \"leading department store. \" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The opportunity resulted from cancellation of the order due to shipping delays and enabled us to offer the product to our customers at a more than 60% discount,\" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Grocery Outlet reported net income of $11.6 million, or 12 cents per share, down from $18.9 million, or 19 cents per share, last year. Adjusted EPS of 22 cents beat the FactSet consensus for 20 cents. Sales of $831.4 million were up from $752.5 million last year and also beat the FactSet consensus for $810.4 million. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Grocery Outlet stock has run up 30.2% for the year to date. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Some experts are raising early warnings about more problems ahead. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Supply chain issues are expected to persist for Walmart, and the wider discount retail industry, for at least the next 12-to-18 months,\" wrote Landon Luxembourg, senior analyst at Third Bridge. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The impact of COVID on manufacturing capacity in Asia, container availability, and the availability of truckers in local ports are three areas of concern.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Don't miss: Walmart to pilot program aimed at putting new college grads on the path to a $210,000 salary ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart also ran into trouble in other areas of operations. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The return of workers who were sidelined by COVID-19 led to what Biggs described as \"labor scheduling inefficiency,\" including over-staffing, that was \"unique to the first quarter.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  And a fire in one of the company's largest fulfillment centers forced Walmart to use other facilities and its stores to fulfill e-commerce orders, driving some costs. No one was hurt in the blaze. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart stock tumbled 11.4% in Tuesday trading, and shares are down 9.2% for the year to date. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We don't expect this miss to become a norm, seeing that Walmart has historically outperformed competition during tough economic times,\" wrote CFRA's Arun Sundaram. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We also think the market is underappreciating the investments Walmart is making to diversify its business into advertising, first and third-party marketplaces, fulfillment services, health care, financial services, and data monetization.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  CFRA rates Walmart stock buy with a $162 price target, which it lowered from $165. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Walmart's softer-than-expected earnings for the first quarter demonstrate that no retailer is immune from the higher cost pressures reverberating throughout the retail sector,\" said Mickey Chadha, Moody's retail analyst. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Despite the lower earnings guidance for the year, we continue to believe Walmart is one of the best suited retailers to weather the challenging period for the sector with its scale, strong balance sheet, merchandise mix, lower price points and stellar execution.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Neil Saunders, managing director at GlobalData, says some new customers may be turning to Walmart to save money as inflation bursts budgets. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We remain broadly optimistic that this more economically pressured environment is one in which Walmart can do well. However, we are also very aware that compared to previous periods of economic difficulty, consumers have a lot more choice at the value end of the spectrum thanks to the expansion of dollar stores and deep discount chains like Aldi over the past decade. Walmart will have to work much harder to win over shoppers with its value for money stance.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tonya Garcia ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-17-22 1615ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}