{"id":"20220419006088","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab Secures Multi-Launch Contract with HawkEye 360, Confirms First Launch Planned from Virginia","publishedDate":"2022-04-19T15:46:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Secures Multi-Launch Contract with HawkEye 360, Confirms First Launch Planned from Virginia\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab will launch three Electron missions for HawkEye 360, the first of which is expected to be the inaugural launch from Rocket Lab Launch Complex 2 in Virginia\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab (Nasdaq: RKLB) (“Rocket Lab” or “the Company”), a leading launch and space systems company, today announced it has been selected by Virginia-based HawkEye 360 to launch three Electron missions for the radio frequency geospatial analytics provider. The first of the three missions is scheduled to be Rocket Lab’s inaugural Electron mission from Launch Complex 2 on Wallops Island, Virginia, ushering in an era of Rocket Lab launches from U.S. soil from no earlier than December 2022.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release features multimedia. View the full release here: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220419006088/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220419006088/en/","gated":false}],"gated":false}],"gated":false},{"type":"div","contentObject":[{"type":"img","src":"https://mms.businesswire.com/media/20220419006088/en/1425563/4/Electron_at_LC-2.jpg","alt":"Electron at Launch Complex 2, Virginia (Photo: Business Wire)","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Electron at Launch Complex 2, Virginia (Photo: Business Wire)","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe multi-launch contract with HawkEye 360 will see Rocket Lab deliver 15 satellites (five clusters) to low Earth orbit across three Electron missions anticipated between late 2022 and 2024. Rocket Lab will first deploy three HawkEye 360 satellites as part of a rideshare mission, followed by six satellites each on two dedicated Electron launches.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe first HawkEye 360 mission is scheduled to launch from Rocket Lab Launch Complex 2 at Virginia Space’s Mid-Atlantic Regional Spaceport within NASA’s Wallops Flight Facility – a dedicated pad for Electron launches developed to support missions from U.S. soil for government and commercial customers. Encouraged by NASA’s recent progress in certifying its Autonomous Flight Termination Unit (NAFTU) software, which is required to enable Electron launches from Virginia, Rocket Lab has scheduled the mission from Launch Complex 2 no earlier than December 2022. With Launch Complex 2 joining Rocket Lab’s two operational launch pads at Launch Complex 1 in Mahia NZ, Rocket Lab can provide even greater flexibility over schedule, launch frequency and launch location to its global customers. Supporting Rocket Lab’s vertical integration strategy, Rocket Lab will also supply HawkEye 360 with separation systems produced by Planetary Systems Corporation, a Maryland-based space hardware company acquired by Rocket Lab in December 2021.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab founder and CEO, Peter Beck, says: “I’m thrilled to welcome HawkEye 360 onto Electron’s manifest and especially looking forward to launching our inaugural mission from Launch Complex 2 in Virginia. Operating multiple Electron pads across both hemispheres opens up incredible flexibility for our customers and delivers assured access to space, something we know is becoming increasingly critical as launch availability wanes worldwide. This contract also demonstrates continued execution on our vertical integration strategy, in this case bringing reliable launch and flight proven separation systems under one roof to streamline the integration and launch process for HawkEye 360.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nHawkEye 360 COO Rob Rainhart said: “Rocket Lab provides the flexibility we need to fill out our constellation and reach our desired orbits. Their service will drive down our revisit rates in midlatitude AOIs, bringing a higher density of data to our customers. We’re excited to be joining the inaugural launch from Virginia, as a Virginia-based company launching our satellites from our home state.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThese missions will grow HawkEye 360’s constellation of radio frequency monitoring satellites, enabling the company to better deliver precise mapping of radio frequency emissions anywhere in the world. By combining radio frequency emissions data with its analytical tools and algorithms, HawkEye 360 provides commercial and government customers with insights that have helped to detect illegal fishing, poachers in national parks, GPS radio frequency interference along international borders, and emergency beacons in crisis situations.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis agreement is the latest multi-launch contract for Rocket Lab, adding to a multi-launch contract for five dedicated Electron missions for global Internet-of-Things (IoT) connectivity provider Kinéis to be launched from 2023 onward, as well as one for three dedicated missions for Earth imaging company Synspective, the first of which was launched in February 2022.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ About Rocket Lab\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 2006, Rocket Lab is an end-to-end space company with an established track record of mission success. We deliver reliable launch services, satellite manufacture, spacecraft components, and on-orbit management solutions that make it faster, easier and more affordable to access space. Headquartered in Long Beach, California, Rocket Lab designs and manufactures the Electron small orbital launch vehicle and the Photon satellite platform and is developing the Neutron 8-ton payload class launch vehicle. Since its first orbital launch in January 2018, Rocket Lab’s Electron launch vehicle has become the second most frequently launched U.S. rocket annually and has delivered 112 satellites to orbit for private and public sector organizations, enabling operations in national security, scientific research, space debris mitigation, Earth observation, climate monitoring, and communications. Rocket Lab’s Photon spacecraft platform has been selected to support NASA missions to the Moon and Mars, as well as the first private commercial mission to Venus. Rocket Lab has three launch pads at two launch sites, including two launch pads at a private orbital launch site located in New Zealand and a second launch site in Virginia, USA which is expected to become operational in 2022. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2F&esheet=52691103&newsitemid=20220419006088&lan=en-US&anchor=www.rocketlabusa.com&index=1&md5=611bd80007cd91c658149b8786f4d15e","contentObject":[{"type":"text","content":"www.rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ FORWARD LOOKING STATEMENTS\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release may contain certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are based on Rocket Lab’s current expectations and beliefs concerning future developments and their potential effects. These forward-looking statements involve a number of risks, uncertainties (many of which are beyond Rocket Lab’s control), or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including risks related to the global COVID-19 pandemic; risks related to government restrictions and lock-downs in New Zealand and other countries in which we operate that could delay or suspend our operations; delays and disruptions in expansion efforts; our dependence on a limited number of customers; the harsh and unpredictable environment of space in which our products operate which could adversely affect our launch vehicle and spacecraft; increased congestion from the proliferation of low Earth orbit constellations which could materially increase the risk of potential collision with space debris or another spacecraft and limit or impair our launch flexibility and/or access to our own orbital slots; increased competition in our industry due in part to rapid technological development and decreasing costs; technological change in our industry which we may not be able to keep up with or which may render our services uncompetitive; average selling price trends; failure of our launch vehicles, spacecraft and components to operate as intended either due to our error in design in production or through no fault of our own; launch schedule disruptions; supply chain disruptions, product delays or failures; design and engineering flaws; launch failures; natural disasters and epidemics or pandemics; changes in governmental regulations including with respect to trade and export restrictions, or in the status of our regulatory approvals or applications; or other events that force us to cancel or reschedule launches, including customer contractual rescheduling and termination rights; risks that acquisitions may not be completed on the anticipated time frame or at all or do not achieve the anticipated benefits and results; and the other risks detailed from time to time in Rocket Lab’s filings with the Securities and Exchange Commission (the “SEC”), including under the heading “Risk Factors” in Rocket Lab’s Annual Report on Form 10-K for the fiscal year ended December 31, 2021, which was filed with the SEC on March 24, 2022, and elsewhere (including that the impact of the COVID-19 pandemic may also exacerbate the risks discussed therein). There can be no assurance that the future developments affecting Rocket Lab will be those that we have anticipated. Except as required by law, Rocket Lab is not undertaking any obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220419006088r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ Rocket Lab Media Contact\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Morgan Bailey\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220419006088/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220419006088/en/","gated":false}],"gated":false}],"gated":false}]}