{"id":"20220512005801","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Paradigm Convergence Technologies Announces Grassy Creek Testing Justifies Commercial Drilling","publishedDate":"2022-05-12T10:03:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Paradigm Convergence Technologies Announces Grassy Creek Testing Justifies Commercial Drilling","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nPCT LTD (OTC Pink: PCTL) is excited to announce the Summary of Amott Cell Testing for Validating Heavy Oil Recovery Using High Concentration Catholyte® infused with High and Lower Concentration Nano Gas Nitrogen Spheres in Grassy Creek Warner Sandstone Core.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAs hoped, the higher concentration catholyte, referred to as Super Catholyte®, infused with high concentration nitrogen (N@) nanospheres achieved a 25.5% better recovery than the catholyte alone, and a 13.35% better than lower concentration NanogasN2 spheres infused into a high concentration of Super Catholyte®. These results validate that high concentration, Nanogas N2 Sphere infused high concentration catholyte (Super Catholyte®) outperforms Super Catholyte alone, or a lower concentration Nanogas Sphere Infusion in Super Catholyte®.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIt was also noted that these differences could be observed in a shorter time frame (i.e., 54 hours as opposed to 96 hours as in past testing). This will allow for shorter treatment shut in times in the field, thus allowing for optimum results to be obtained in a shorter amount of time which helps to reduce overall lease operating costs!\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nWith these affirming results, we have committed to continue to secure financing for the drilling programming at the Grassy Creek formation. Additionally, research, development and testing will continue to move toward its final stages in the Oklahoma formation. Corporate executives will be traveling to Kansas City and other locales in the coming weeks to further the advancement of revenues for this project.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About PCT LTD:","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nPCT LTD (\"PCTL\") focuses its business on acquiring, developing, and providing sustainable, environmentally safe disinfecting, cleaning, and tracking technologies. The company acquires and holds rights to innovative products and technologies, which are commercialized through its wholly owned operating subsidiary, Paradigm Convergence Technologies Corporation (PCT Corp). The Company established entry into its target markets with commercially viable products in the United States and now continues to gain market share in the U.S. and U.K.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements:","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release contains \"forward-looking statements\" as defined in Section 27A of the Securities Act of 1933, as amended, and Section 21B of the Securities Exchange Act of 1934, as amended. Any statements that express or involve discussions with respect to predictions, expectations, beliefs, plans, projections, objectives, goals, assumptions or future events or performance are not statements of historical fact and may be \"forward-looking statements.\"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nSuch statements are based on expectations, estimates and projections at the time the statements are made that involve a number of risks and uncertainties, which could cause actual results or events to differ materially from those presently anticipated. Such statements involve risks and uncertainties, including but not limited to: PCTL's ability to raise sufficient funds to satisfy its working capital requirements; the ability of PCTL to execute its business plan; the anticipated results of business contracts with regard to revenue; and any other effects resulting from the information disclosed above; risks and effects of legal and administrative proceedings and government regulation; future financial and operational results; competition; general economic conditions; and the ability to manage and continue growth. Should one or more of these risks or uncertainties materialize, or should underlying assumptions prove incorrect, actual outcomes may vary materially from those indicated. Important factors that could cause actual results to differ materially from the forward-looking statements PCTL makes in this press release include market conditions and those set forth in reports or documents it files from time to time with the SEC. PCTL undertakes no obligation to revise or update such statements to reflect current events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220512005801r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nTim Rieu\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Chesapeake Group\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"410.825.3930\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"a","href":"mailto:IR@para-con.com","contentObject":[{"type":"text","content":"IR@para-con.com \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.pctl.com&esheet=52717573&newsitemid=20220512005801&lan=en-US&anchor=www.pctl.com&index=1&md5=8d9c4c10162da9f06fb61d0d29bc3257","contentObject":[{"type":"text","content":"www.pctl.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nTwitter: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fmobile.twitter.com%2FPCTL_&esheet=52717573&newsitemid=20220512005801&lan=en-US&anchor=https%3A%2F%2Fmobile.twitter.com%2FPCTL_&index=2&md5=8d43b8bfdc2da81757a739108e151834","contentObject":[{"type":"text","content":"https://mobile.twitter.com/PCTL_","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220512005801/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220512005801/en/","gated":false}],"gated":false}],"gated":false}]}