{"id":"20220517123","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Walmart shares fall after profit misses expectations","publishedDate":"2022-05-17T06:24:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart Inc. (WMT) shares fell 6.7% in Tuesday premarket trading after it reported fiscal first-quarter profit that missed expectations. The retail giant posted net income of $2.054 billion, or 74 cents per share, down from $2.730 billion, or 97 cents per share, last year. Adjusted EPS of $1.30 missed the FactSet consensus of $1.48. Revenue of $141.569 billion was up from $138.310 billion and beat the FactSet consensus for $138.803 billion. U.S. comp sales grew 3%, ahead of the FactSet consensus for 2.5% growth. \"Bottom line results were unexpected and reflect the unusual environment,\" said Chief Executive Doug McMillon in a statement. \"U.S. inflation levels, particularly in food and fuel, created more pressure on margin mix and operating costs than we expected.\" E-commerce was up 1%, and the global advertising business jumped 30%. For the second quarter, Walmart is guiding for consolidated net sales growth of over 5%, U.S. comp sales growth excluding fuel of 4% to 5%, and EPS of flat to up slightly. The FactSet consensus is for sales of $146.426 billion, implying growth of 3.8%, U.S. comp sales growth of 3.6%, and EPS of $1.90, implying 6.9% growth. For the year, Walmart is guiding for sales growth of 4% on a constant currency basis, U.S. comp sales growth of 3.5% excluding fuel, and a 1% EPS decline. Full-year sales and EPS guidance exclude divestitures. The FactSet consensus is for sales of $590.509 billion, implying 3.1% growth, U.S. comp sales growth of 3.3% and EPS of $6.75, implying 4.4% growth. Walmart stock is up 2.4% for the year to date. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tonya Garcia ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-17-22 0724ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}