{"id":"20220228006005","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab Announces Fourth Quarter and Full Year 2021 Financial Results, Issues Guidance for the First Quarter 2022","publishedDate":"2022-02-28T15:05:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Announces Fourth Quarter and Full Year 2021 Financial Results, Issues Guidance for the First Quarter 2022\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Fourth Quarter and Full Year 2021 Financial Highlights:","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nFull year 2021 Revenue of $62.2M, representing year-on-year growth of 77%.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nQ4 2021 Revenue above high end of prior guidance range at $27.5 million, representing quarterly sequential growth of 420% versus Q3 2021.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nQ4 2021 saw broad based growth with Launch Services growing by 1126% and Space Systems growing by 229% in quarterly sequential growth.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nQ4 2021 GAAP and non-GAAP gross margins of 24% and 36%, versus (236%) and (84%) in prior quarter Q3 2021.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nBacklog increased from $183 million at September 30, 2021 to $241 million as of December 30, 2021, and currently stands at $545 million as of February 28, 2022.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"First Quarter 2022 Guidance:","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nRevenue expected to range between $42 million to $47 million.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nExpect GAAP and non-GAAP gross margins of 17% and 30%, respectively.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nExpect GAAP and non-GAAP operating expenses between $38.0 million to $40.0 million, and $21.0 million to $23.0 million, respectively.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nExpect GAAP Net Loss between $32.5 million and $34.5 million, and Adjusted EBITDA of negative $3 million to negative $5 million.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab USA, Inc. (Nasdaq: RKLB) (“Rocket Lab” or “the Company”), a global leader in launch services and space systems, today announced financial results for its fiscal fourth quarter and full year ended December 31, 2021.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“In 2021, we made significant progress on our strategy to grow Rocket Lab from a launch provider to an end-to-end space company delivering technology and services spanning the full space economy,” said Rocket Lab founder and CEO, Peter Beck. “Not only did we launch six missions and retain Electron’s position as the second most frequently launched U.S. rocket, we also expanded our space systems capabilities with the acquisition of Planetary Systems Corporation and ASI Aerospace LLC, and we signed an agreement to acquire SolAero Technologies Inc., which subsequently closed on January 17, 2022. These strategic acquisitions, combined with the continued growth of our existing flagship launch and spacecraft programs, strengthen Rocket Lab’s position as a leading mission partner spanning satellite design and volume manufacture, satellite component production, flight software and testing, launch, and on-orbit operations. Today, Rocket Lab is supplying hardware or services to hundreds of missions currently on orbit and in development, from launching low Earth orbit constellations and developing spacecraft that enable on-orbit manufacturing, to developing flight software for lunar landers and supplying solar panels for interplanetary NASA missions.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Full Year 2021 Business Highlights:","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nLaunched six Electron missions, delivering satellites to orbit for commercial and government customers and retaining position as second most frequently launched U.S. orbital rocket.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nSigned multi-launch agreements with three commercial satellite constellation operators: BlackSky, Synspective, and Kinéis.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nAwarded $24M Space Force contract to develop Neutron upper stage.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nSuccessfully completed two Electron first stage ocean recoveries as part of the program to make Electron a reusable launch vehicle.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nPassed key design review for twin Photon mission to Mars.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nClosed the acquisition of ASI Aerospace LLC and Planetary Systems Corporation, and signed an agreement to acquire SolAero Technologies Inc.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nSuccessfully launched two dedicated missions for BlackSky, further building out their real-time geospatial and global monitoring constellation.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nAwarded a contract to launch NASA’s Advanced Composite Solar Sail System.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Highlights since December 31, 2021:","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nClosed the acquisition of SolAero Technologies Inc., giving Rocket Lab the world’s largest production line of high-performing space solar cells.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nAwarded $143M contract by MDA to design and manufacture 17 spacecraft for Globalstar.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nSelected by NASA as one of 12 companies to provide launch services for Venture-Class Acquisition of Dedicated and Rideshare (VADR) missions, a five-year program with a maximum total budget of $300 million in launch contracts.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nOperationalized third Rocket Lab launch pad, enabling double the launch capacity from Launch Complex 1 in New Zealand.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nDeveloping new space systems complex in Littleton, Colorado that more than triples footprint in Colorado to support ASI Aerospace LLC’s growing customer demand for flight software, mission simulation, and Guidance, Navigation and Control (GNC) services.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nSelected Commonwealth of Virginia for Neutron launch site and production complex. Commonwealth of Virginia to invest $45 million in infrastructure and operational systems improvements to the Mid-Atlantic Regional Spaceport to support Neutron launch and production facilities.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Conference Call Information","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab will host a conference call for investors at 1:30 p.m. PT (4:30 p.m. ET) today to discuss these business highlights and financial results, and to provide our outlook for the first quarter ending March 31, 2022 and other updates. The live webcast and a replay of the webcast, along with presentation, will be available on Rocket Lab’s Investor Relations website: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Finvestors.rocketlabusa.com%2Fevents-and-presentations%2Fevents&esheet=52586733&newsitemid=20220228006005&lan=en-US&anchor=https%3A%2F%2Finvestors.rocketlabusa.com%2Fevents-and-presentations%2Fevents&index=1&md5=147aca0340f1f7c6868fa28489706d59","contentObject":[{"type":"text","content":"https://investors.rocketlabusa.com/events-and-presentations/events","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Rocket Lab","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 2006, Rocket Lab is an end-to-end space company with an established track record of mission success. We deliver reliable launch services, spacecraft components, satellites and other spacecraft and on-orbit management solutions that make it faster, easier and more affordable to access space. Headquartered in Long Beach, California, Rocket Lab designs and manufactures the Electron small orbital launch vehicle and the Photon satellite platform and is developing the Neutron 8-ton payload class launch vehicle. Since its first orbital launch in January 2018, Rocket Lab’s Electron launch vehicle has become the second most frequently launched U.S. rocket annually and has delivered 109 satellites to orbit for private and public sector organizations, enabling operations in national security, scientific research, space debris mitigation, Earth observation, climate monitoring, and communications. Rocket Lab’s Photon spacecraft platform has been selected to support NASA missions to the Moon and Mars, as well as the first private commercial mission to Venus. Rocket Lab has three launch pads at two launch sites, including two launch pads at a private orbital launch site located in New Zealand, and a second launch site in Virginia, USA which is expected to become operational in 2022. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com&esheet=52586733&newsitemid=20220228006005&lan=en-US&anchor=www.rocketlabusa.com&index=2&md5=f82dd5495ee5525de9f9568afb9a609f","contentObject":[{"type":"text","content":"www.rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Forward Looking Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release contains certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities and Exchange Act of 1934, as amended. All statements, other than statements of historical facts, contained in this press release, including statements regarding our strategy, future operations, future financial position, projected costs, prospects, plans and objectives of management, including without limitation Q1 2022 guidance, are forward-looking statements. Words such as, but not limited to, “anticipate,” “aim,” “believe,” “contemplate,” “continue,” “could,” “design,” “estimate,” “expect,” “intend,” “may,” “might,” “plan,” “possible,” “potential,” “predict,” “project,” “seek,” “should,” “suggest,” “strategy,” “target,” “will,” “would,” and similar expressions or phrases, or the negative of those expressions or phrases, are intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. These forward-looking statements involve a number of risks, uncertainties (many of which are beyond Rocket Lab’s control), or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by the forward-looking statements contained in this press release, including risks related to the global COVID-19 pandemic, including risks related to government restrictions and lock-downs in New Zealand and other countries in which we operate that could delay or suspend our operations; delays and disruptions in expansion efforts; our dependence on a limited number of customers; the harsh and unpredictable environment of space in which our products operate which could adversely affect our launch vehicle and spacecraft; increased congestion from the proliferation of low Earth orbit constellations which could materially increase the risk of potential collision with space debris or another spacecraft and limit or impair our launch flexibility and/or access to our own orbital slots; increased competition in our industry due to rapid technological development and decreasing costs; technological change in our industry which we may not be able to keep up with or which may render our services uncompetitive; average selling price trends; failure of our launch vehicles, satellites or components to operate as intended either due to our error in design in production or through no fault of our own; launch schedule disruptions; supply chain disruptions, product delays or failures, design and engineering flaws; launch failures; natural disasters and epidemics or pandemics; changes in governmental regulations including with respect to trade and export restrictions, or in the status of our regulatory approvals or applications; or other events that force us to cancel or reschedule launches, including customer contractual rescheduling and termination rights, and the other risks detailed from time to time in Rocket Lab’s filings with the Securities and Exchange Commission (the “SEC”), including under the heading “Risk Factors” in the prospectus dated October 7, 2021 related to our Registration Statement on Form S-1 (File No. 333-259757), which was filed with the Securities and Exchange Commission pursuant to Rule 424(b) on October 7, 2021 and elsewhere (including that the impact of the COVID-19 pandemic may also exacerbate the risks discussed therein).\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThese forward-looking statements are based on Rocket Lab’s current plans, expectations and beliefs concerning future developments and their potential effects. Although we believe that we have a reasonable basis for each forward-looking statement contained in this press release, there can be no assurance that the future developments affecting Rocket Lab will be those that we have anticipated and we may not actually achieve the plans, intentions or expectations disclosed in our forward-looking statements, and you should not place undue reliance on our forward-looking statements. Moreover, we operate in a very competitive and rapidly changing environment. New risks emerge from time to time. It is not possible for our management to predict all risks, nor can we assess the impact of all factors on our business or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those contained in any forward-looking statements we may make. You should read this press release with the understanding that our actual results may be materially different from the plans, intentions and expectations disclosed in the forward-looking statements we make. All forward-looking statements are qualified in their entirety by this cautionary statement. The forward-looking statements contained in this press release are made as of the date of this press release, and we do not assume any obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise except as required by applicable law.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Use of Non-GAAP Financial Measures","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nTo supplement our unaudited consolidated financial statements presented on a basis consistent with GAAP, we disclose certain non-GAAP financial measures, including Adjusted EBITDA, non-GAAP gross margin, non-GAAP operating expenses and non-GAAP income (loss) from operations. These supplemental measures exclude the effects of (i) stock-based compensation expense; (ii) amortization of purchased intangible assets; (iii) other recurring and non-recurring interest and other income (expenses), net attributable to acquisitions and (iv) non-cash income tax benefits and expenses. We also supplement our unaudited historical statements and forward-looking guidance with the measure of Adjusted EBITDA, where adjustments to net loss before interest, taxes, depreciation and amortization (EBITDA) include share-based compensation, warrant expense, foreign exchange gains or losses, and other recurring and non-recurring gains or losses. These non-GAAP measures are not in accordance with and do not serve as an alternative for GAAP. We believe that these non-GAAP measures have limitations in that they do not reflect all of the amounts associated with our GAAP results of operations. These non-GAAP measures should only be viewed in conjunction with corresponding GAAP measures. We compensate for the limitations of non-GAAP financial measures by relying upon GAAP results to gain a complete picture of our performance. Non-GAAP financial measures are not in accordance with and do not serve as an alternative for the presentation of our GAAP financial results. We are providing this information to enable investors to perform more meaningful comparisons of our operating results in a manner similar to management's analysis of our business. We believe that these non-GAAP measures have limitations in that they do not reflect all of the amounts associated with our GAAP results of operations. These non-GAAP measures should only be viewed in conjunction with corresponding GAAP measures. We have not provided a reconciliation of forward-looking non-GAAP measures because, without unreasonable efforts, we are unable to predict with reasonable certainty the amount and timing of adjustments that are used to calculate these non-GAAP measures, particularly related to stock-based compensation and its related tax effects.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Notes to Editor:","gated":false}],"gated":false},{"type":"text","content":" All dollar amounts in this press release are expressed in U.S. dollars, unless otherwise stated.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220228006005r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"+ Rocket Lab Investor Relations Contact \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Adam Spice\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:investors@rocketlabusa.com","contentObject":[{"type":"text","content":"investors@rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"+ Rocket Lab Media Contact \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Morgan Bailey\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"+64 27 538 9039\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220228006005/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220228006005/en/","gated":false}],"gated":false}],"gated":false}]}