{"id":"20220223005596","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab Officially Opens Third Launch Pad, First Mission Scheduled to Launch Within a Week","publishedDate":"2022-02-23T07:00:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Officially Opens Third Launch Pad, First Mission Scheduled to Launch Within a Week\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"i","contentObject":[{"type":"text","content":"Located at Launch Complex 1 in New Zealand, the world’s first and only private orbital launch site, the new pad will enable Rocket Lab to double launch cadence","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab USA, Inc (Nasdaq: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Finvestors.rocketlabusa.com%2F&esheet=52584008&newsitemid=20220223005596&lan=en-US&anchor=RKLB&index=1&md5=5c5a422f3731de3a9f7ba9c039980030","contentObject":[{"type":"text","content":"RKLB","gated":false}],"gated":false},{"type":"text","content":") (“Rocket Lab” or “the Company”), a global leader in launch and space systems, today announced the completion of its second orbital launch pad at Launch Complex 1 in New Zealand – the Company’s third dedicated pad for its Electron rocket - and confirmed the new pad’s first mission will be a dedicated commercial launch scheduled to lift-off within a week’s time.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release features multimedia. View the full release here: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220223005596/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220223005596/en/","gated":false}],"gated":false}],"gated":false},{"type":"div","contentObject":[{"type":"img","src":"https://mms.businesswire.com/media/20220223005596/en/1368673/4/PadB_Aerial_Low-001.jpg","alt":"Rocket Lab Launch Complex 1 (Photo: Business Wire)","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Rocket Lab Launch Complex 1 (Photo: Business Wire)","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nPad B is based within Rocket Lab Launch Complex 1, the world’s first private orbital launch site, located in Mahia, New Zealand. The new pad is Rocket Lab’s third for the Company’s Electron launch vehicle and joins the existing Pad A at Launch Complex 1 and a third launch pad at Rocket Lab Launch Complex 2 in Virginia, USA. With two operational pads within the same launch complex, Rocket Lab doubles the launch capacity of its Electron launch vehicle.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nLaunch Complex 1 Pad B will support the upcoming launch of a dedicated Electron mission for Japanese Earth-imaging company Synspective. Lift-off is currently scheduled for no earlier than February 28 UTC / March 1 NZT. Full detail about the mission can be found here: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2Fmissions%2Fnext-mission%2F&esheet=52584008&newsitemid=20220223005596&lan=en-US&anchor=www.rocketlabusa.com%2Fmissions%2Fnext-mission%2F&index=2&md5=ebbfd1a7760bb9190e1b2de423431c2b","contentObject":[{"type":"text","content":"www.rocketlabusa.com/missions/next-mission/","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nWith two launch pads and private range assets at Launch Complex 1, concurrent launch campaigns are now possible from the site. This enables resilient access to space by accommodating tailored customer requirements or late changes to a spacecraft while keeping Rocket Lab’s manifest on schedule. Operating two pads also eliminates pad recycle time, ensuring a launch pad is always available for a rapid-response mission. Launching from a private launch complex, Rocket Lab is also able to avoid the lofty range fees and overheads typically associated with shared launch sites, resulting in a cost-effective launch service for satellite operators.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab founder and CEO, Peter Beck, says: “A reliable launch vehicle is only one part of the puzzle to unlocking space access - operating multiple launch sites so we can launch when and where our customers need to is another crucial factor. We are proud to be delivering responsive space access for our customers, making back-to-back missions possible within hours or days, not weeks or months.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Even with just one pad at Launch Complex 1, Electron quickly became the second most-frequently launched U.S. rocket every year. Now, with two pads at Launch Complex 1 and a third in Virginia, imagine what three pads across two continents can do for schedule control, flexibility, and rapid response for satellite operators globally.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nMore than 50 local construction workers and contractors were involved in the development of Launch Complex 1 Pad B, which includes a 66-ton launch platform and 7.6-ton strongback customized to the Electron launch vehicle. With Pad B operational, several roles are available now at Launch Complex 1 to support Rocket Lab’s increased launch cadence.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab’s Vice President – Launch, Shaun D’Mello, says: “With Pad B we’ve kept things efficient. Its systems and layout replicates Pad A and shares much of Pad A’s infrastructure including the Electron vehicle integration hangar, runway to the pad, and our own range control facility. With that we’ve been able to double our operational capacity - all on a concrete area smaller than the average tennis court. I’m hugely proud of what the team has achieved: building and bringing a second pad online, all while continuing to service and operate Pad A for our Electron launches to date, and in the middle of a global pandemic no less.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Launch Complex 1","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nLocated on the Mahia Peninsula in New Zealand, Launch Complex 1 is the world’s first and only private orbital launch site. As the launch site for Rocket Lab’s Electron rocket, Launch Complex 1 has supported the successful delivery of more than 100 satellites to space across a range of missions for environmental and marine monitoring, Earth observation, science and research, internet connectivity, technology research and development, and national security.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAn FAA-licensed spaceport, Launch Complex 1 is capable of supporting up to 120 launch opportunities every year. From the site it is possible to reach orbital inclinations from sun-synchronous through to 30 degrees, enabling a wide spectrum of inclinations to service the majority of the satellite industry’s missions to low Earth orbit.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nLocated within Launch Complex 1 are Rocket Lab’s private range control facilities, three satellite cleanrooms, a launch vehicle assembly hangar which can process multiple Electrons for launch at once, and administrative offices. Operating a private orbital launch site alongside its own range and mission control centres allows Rocket Lab to reduce the overhead costs per mission, resulting in a cost-effective launch service for satellite operators.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Images and Video for Download\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&esheet=52584008&newsitemid=20220223005596&lan=en-US&anchor=www.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&index=3&md5=3c8809016a15f6fdd36cc20e520716d9","contentObject":[{"type":"text","content":"www.rocketlabusa.com/about-us/updates/link-to-rocket-lab-imagery-and-video/","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAbout Rocket Lab\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 2006, Rocket Lab is an end-to-end space company with an established track record of mission success. We deliver reliable launch services, spacecraft components, satellites and other spacecraft and on-orbit management solutions that make it faster, easier and more affordable to access space. Headquartered in Long Beach, California, Rocket Lab designs and manufactures the Electron small orbital launch vehicle and the Photon satellite platform and is developing the Neutron 8-ton payload class launch vehicle. Since its first orbital launch in January 2018, Rocket Lab’s Electron launch vehicle has become the second most frequently launched U.S. rocket annually and has delivered 109 satellites to orbit for private and public sector organizations, enabling operations in national security, scientific research, space debris mitigation, Earth observation, climate monitoring, and communications. Rocket Lab’s Photon spacecraft platform has been selected to support NASA missions to the Moon and Mars, as well as the first private commercial mission to Venus. Rocket Lab has three launch pads at two launch sites, including two launch pads at a private orbital launch site located in New Zealand, and a second launch site in Virginia, USA which is expected to become operational in 2022. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2F&esheet=52584008&newsitemid=20220223005596&lan=en-US&anchor=www.rocketlabusa.com&index=4&md5=c2e4badc6aaf730a6955a48b5cfe5148","contentObject":[{"type":"text","content":"www.rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release may contain certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are based on Rocket Lab’s current expectations and beliefs concerning future developments and their potential effects. These forward-looking statements involve a number of risks, uncertainties (many of which are beyond Rocket Lab’s control), or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including risks related to the global COVID-19 pandemic; risks related to government restrictions and lock-downs in New Zealand and other countries in which we operate that could delay or suspend our operations; delays and disruptions in expansion efforts; our dependence on a limited number of customers; the harsh and unpredictable environment of space in which our products operate which could adversely affect our launch vehicle and spacecraft; increased congestion from the proliferation of low Earth orbit constellations which could materially increase the risk of potential collision with space debris or another spacecraft and limit or impair our launch flexibility and/or access to our own orbital slots; increased competition in our industry due in part to rapid technological development and decreasing costs; technological change in our industry which we may not be able to keep up with or which may render our services uncompetitive; average selling price trends; failure of our launch vehicles, satellites and components to operate as intended either due to our error in design in production or through no fault of our own; launch schedule disruptions; supply chain disruptions, product delays or failures; design and engineering flaws; launch failures; natural disasters and epidemics or pandemics; changes in governmental regulations including with respect to trade and export restrictions, or in the status of our regulatory approvals or applications; or other events that force us to cancel or reschedule launches, including customer contractual rescheduling and termination rights; risks that acquisitions may not be completed on the anticipated time frame or at all or do not achieve the anticipated benefits and results; and the other risks detailed from time to time in Rocket Lab’s filings with the Securities and Exchange Commission (the “SEC”), including under the heading “Risk Factors” in the prospectus dated October 7, 2021 related to our Registration Statement on Form S-1 (File No. 333-259757), which was filed with the Securities and Exchange Commission pursuant to Rule 424(b) on October 7, 2021 and elsewhere (including that the impact of the COVID-19 pandemic may also exacerbate the risks discussed therein). There can be no assurance that the future developments affecting Rocket Lab will be those that we have anticipated. Except as required by law, Rocket Lab is not undertaking any obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220223005596r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Media Contact\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Murielle Baker\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"+64 27 538 9040\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220223005596/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220223005596/en/","gated":false}],"gated":false}],"gated":false}]}