{"id":"20210902626","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"MongoDB stock jumps more than 10% after narrower Q2 loss","publishedDate":"2021-09-02T15:42:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Shares of MongoDB Inc. (MDB) rallied more than 10% in the extended session late Thursday after the software company reported a narrower-than-expected adjusted loss and sales that were above Wall Street forecasts as businesses continued to accelerate their digital presence. MongoDB said it lost $77.1 million, or $1.22 a share, in the second quarter, compared  with a loss of $64.5 million, or $1.10 a share, in the year-ago period. Adjusted for one-time items, MongoDB lost 24 cents a share. Revenue rose 44% to $199 million, the company said. FactSet consensus called for a loss of 39 cents a share on sales of $184 million. The company guided for revenue between $202 million and $204 million for the third quarter, and between $805 million and $811 million for full-year fiscal 2022. It also called for an adjusted loss between 42 cents and 39 cents for the current quarter, and a fiscal-2022 loss between $1.20 and $1.13. The analysts polled by FactSet expect a loss of $1.29 for the fiscal year. \"MongoDB's second quarter results were exceptionally strong across the board,\" Chief Executive Dev Ittycheria said in a statement. \"Our performance reflects the desire of nearly every business to use a modern application data platform that enables them to accelerate the pace of their digital innovation agenda.\" MongoDB shares ended the regular trading day up 2.1%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Claudia Assis ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  09-02-21 1642ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2021 Dow Jones & Company, Inc.","gated":false}]}