{"id":"20220411005857","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab Breaks Ground on Neutron Production Complex in Wallops, Virginia","publishedDate":"2022-04-11T15:10:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Breaks Ground on Neutron Production Complex in Wallops, Virginia\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe complex will be home to production, assembly, and integration of Rocket Lab’s Neutron launch vehicle and is expected to bring up to 250 highly-skilled jobs to the region.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab USA, Inc (Nasdaq: RKLB) (“Rocket Lab”), a leading launch and space systems company, today broke ground on the construction of a state-of-the-art rocket production complex where the Company’s Neutron launch vehicle will be manufactured.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe 250,000 square foot Neutron Production Complex is being constructed on a 28-acre site adjacent to the NASA Wallops Flight Facility and Mid-Atlantic Regional Spaceport on Virginia’s Eastern Shore. The complex will support Neutron production, assembly, and integration, and is expected to bring up to 250 highly-skilled roles to the region. Construction will also soon begin on a launch pad for Neutron at the southern end of Wallops Island, near Rocket Lab’s existing launch pad for the Electron rocket.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Neutron is a next generation rocket designed to serve the needs of the civil, commercial and national security space markets and we’re proud to be delivering that capability from right here in Virginia,” said Rocket Lab founder and CEO Peter Beck. “Today, we take a major step toward resilient and assured access to space for the nation – a capability that has become increasingly urgent in recent times. We are excited to grow Rocket Lab’s presence in Wallops, to add highly-skilled jobs to the local economy, and to play a part in reinforcing the Eastern Shore’s strong legacy as an aerospace hub. We are grateful for the continued support of the Commonwealth of Virginia and Accomack County for its enthusiasm in helping to establish Rocket Lab and Neutron on the Eastern Shore.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab selected Virginia as the location of its Neutron production complex and launch site due to the location’s abilty to support frequent launch opportunities, as well as continued support from Commonwealth of Virginia. Through the development of Launch Complex 2 for Electron and now the Neutron program, Rocket Lab has built a solid partnership with Virginia with support from the Virginia Economic Development Partnership working alongside Accomack County, the Virginia Commercial Space Flight Authority (Virginia Space), and the General Assembly’s Major Employment and Investment (MEI) Project Approval Commission. As part of the Commonwealth’s support for the Neutron program, $30 million has been set aside for infrastructure and operational systems improvements to the Mid-Atlantic Regional Spaceport, along with $15 million from the MEI Project Approval Commission in site improvements and building construction in support of Neutron.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"About Neutron:","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nNeutron is Rocket Lab’s medium-lift, reusable launch vehicle in development. Designed to deliver reliable and cost-effective launch for payloads to low Earth orbit and beyond. With a large seven meter fairing and a payload lift capacity of 13 tonnes in a downrange landing configuration, Neutron is ideal for both constellation deployment and large single spacecraft missions.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nBuilding on Rocket Lab’s strong heritage as a leader in composite technology, Neutron will be the world’s first carbon composite large launch vehicle. Reusability is at the forefront of Neutron’s design to enable frequent launch, and this new, specially formulated carbon composite material is lightweight, strong and can withstand the immense heat and forces of launch and re-entry again and again to enable frequent re-flight of the first stage. Neutron’s design is especially unique thanks to its captive ‘Hungry Hippo’ fairing design. This innovative design will see the fairing form part of the first stage structure and remain fixed to the stage. Rather than separating from the stage and falling away to the ocean like traditional fairings, Neutron’s Hungry Hippo fairing jaws will open wide to release the second stage and payload, before closing again ready to return to Earth with the first stage. What lands back on the launch pad is a compete first stage with fairings attached, ready for a new second stage to be integrated and launched.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ FORWARD-LOOKING STATEMENTS\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release may contain certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are based on Rocket Lab’s current expectations and beliefs concerning future developments and their potential effects. These forward-looking statements involve a number of risks, uncertainties (many of which are beyond Rocket Lab’s control), or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including risks related to the global COVID-19 pandemic; risks related to government restrictions and lock-downs in New Zealand and other countries in which we operate that could delay or suspend our operations; delays and disruptions in expansion efforts; our dependence on a limited number of customers; the harsh and unpredictable environment of space in which our products operate which could adversely affect our launch vehicle and spacecraft; increased congestion from the proliferation of low Earth orbit constellations which could materially increase the risk of potential collision with space debris or another spacecraft and limit or impair our launch flexibility and/or access to our own orbital slots; increased competition in our industry due in part to rapid technological development and decreasing costs; technological change in our industry which we may not be able to keep up with or which may render our services uncompetitive; average selling price trends; failure of our launch vehicles, spacecraft and components to operate as intended either due to our error in design in production or through no fault of our own; launch schedule disruptions; supply chain disruptions, product delays or failures; design and engineering flaws; launch failures; natural disasters and epidemics or pandemics; changes in governmental regulations including with respect to trade and export restrictions, or in the status of our regulatory approvals or applications; or other events that force us to cancel or reschedule launches, including customer contractual rescheduling and termination rights; risks that acquisitions may not be completed on the anticipated time frame or at all or do not achieve the anticipated benefits and results; and the other risks detailed from time to time in Rocket Lab’s filings with the Securities and Exchange Commission (the “SEC”), including under the heading “Risk Factors” in Rocket Lab’s Annual Report on Form 10-K for the fiscal year ended December 31, 2021, which was filed with the SEC on March 24, 2022, and elsewhere (including that the impact of the COVID-19 pandemic may also exacerbate the risks discussed therein). There can be no assurance that the future developments affecting Rocket Lab will be those that we have anticipated. Except as required by law, Rocket Lab is not undertaking any obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220411005857r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ Rocket Lab Media Contact\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Morgan Bailey\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220411005857/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220411005857/en/","gated":false}],"gated":false}],"gated":false}]}