{"id":"20220307005958","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"World Fuel Services Corporation Publishes Its Sustainability Report for 2020-2021","publishedDate":"2022-03-08T08:05:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"World Fuel Services Corporation Publishes Its Sustainability Report for 2020-2021","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nWorld Fuel Services Corporation (NYSE: INT) today announced that it has published its ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fir.wfscorp.com%2Fcorporate-responsibility&esheet=52591052&newsitemid=20220307005958&lan=en-US&anchor=2020-2021+Sustainability+Report&index=1&md5=cf28d7ff5c4c294551d7428359075ba7","contentObject":[{"type":"text","content":"2020-2021 Sustainability Report","gated":false}],"gated":false},{"type":"text","content":", which provides a comprehensive overview of the company’s progress in environmental, social and governance areas of critical importance to its business, employees, customers, suppliers, shareholders and other stakeholders. The report covers a broad range of actions and initiatives that demonstrate World Fuel Services Corporation’s commitment to taking part in creating the low carbon world of tomorrow and contributing to positive change in society, both today and in the future.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe sustainability report includes World Fuel Services Corporation’s 2020 carbon footprint, reflecting improvements in the company’s global scope 1 and scope 2 greenhouse gas (GHG) emissions over its 2019 baseline and describing the actions being taken to continue progressing on its path to a net zero world. The company is focused on making additional enhancements to its processes and technologies with the aim of further improving efficiencies and decarbonizing its operations over the long-term to achieve its sustainability goals.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Creating innovative solutions to tackle complex challenges has always been at the heart of who we are as a company and what we strive to do each and every day for our customers, suppliers and other stakeholders. The global energy transition is perhaps one of the greatest challenges facing our world today, and we are excited about doing our part to accelerate this transformation through leveraging the talent and ingenuity of our diverse global organization with our worldwide distribution, fulfillment and technical capabilities,” said Michael J. Kasbar, chairman and chief executive officer. “The past two years have tested our resilience as a company and as a broader community, with both emerging stronger on the other side. We will continue to seek ways to champion social issues -- including health, safety, diversity, equity and equality -- to provide our employees, communities and other stakeholders with an equal opportunity to achieve success and develop to their full potential.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAbout World Fuel Services Corporation\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nHeadquartered in Miami, Florida, World Fuel Services is a global energy management company involved in providing energy procurement advisory services, supply fulfillment and transaction and payment management solutions to commercial and industrial customers, principally in the aviation, marine and land transportation industries. World Fuel Services also offers natural gas and electricity, as well as energy advisory services, including programs for carbon offsets, sustainability solutions and renewable energy alternatives. World Fuel Services sells fuel and delivers services to its clients at more than 8,000 locations in more than 200 countries and territories worldwide.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFor more information, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.wfscorp.com&esheet=52591052&newsitemid=20220307005958&lan=en-US&anchor=www.wfscorp.com&index=2&md5=e953413ddb28fb298bc8fcf7fc0c9943","contentObject":[{"type":"text","content":"www.wfscorp.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nInformation Relating to Forward-Looking Statements\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis release includes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding our beliefs and expectations about our progress on our path to a net zero world, the expected benefits of improving our operating efficiencies and decarbonizing our operations, as well as our beliefs about our participation in the global energy transition and our expectations about our ability to provide our employees, communities and other stakeholders with opportunities to achieve success and develop to their full potential. These forward-looking statements are qualified in their entirety by cautionary statements and risk factor disclosures contained in the Company’s Securities and Exchange Commission (“SEC”) filings, including the Company’s most recent Annual Report on Form 10-K filed with the SEC. Actual results may differ materially from any forward-looking statements due to risks and uncertainties, including, but not limited to: adverse conditions in the industries in which our customers operate; our ability to effectively manage the effects of the coronavirus pandemic; customer and counterparty creditworthiness and our ability to collect accounts receivable and settle derivative contracts; sudden changes in the market price of fuel or extremely high or low fuel prices that continue for an extended period of time; the impact of climate change, extreme weather and natural disasters, including the economic, operational and other effects of severe storms, hurricanes, droughts and earthquakes; seasonal variability that adversely affects our revenues and operating results; changes in the political, economic or regulatory environment generally and in the markets in which we operate, including costs of compliance with existing and future environmental requirements, such as those related to climate change; reputational harm and potential impacts on our ability to attract or retain talent arising from negative perception of fossil fuels, environmental impacts and health and safety incidents; our ability to effectively leverage technology and realize the anticipated benefits; federal and state regulations, laws and other efforts designed to promote and expand the use of energy efficiency measures and related advancements in technology that reduce energy consumption; our ability to capitalize on new market opportunities and successfully implement our growth strategy; our ability to integrate acquired businesses and recognize the anticipated benefits; the effects of competition on our ability to grow our sustainability offerings; environmental and other risks associated with the storage, transportation and delivery of petroleum products; risks associated with operating in high-risk locations, including supply disruptions, border closures and other logistical difficulties that arise when working in these areas; actions that may be taken under the current administration in the U.S. that increase costs or otherwise negatively impact ours or our customers and suppliers businesses; our ability to achieve the expected level of benefit from any restructuring activities and cost reduction initiatives as well as successfully execute and achieve efficiencies; the availability of cash and sufficient liquidity to fund our working capital and strategic investment needs; uninsured losses; unanticipated tax liabilities or adverse results of tax audits, assessments, or disputes; the outcome of pending litigation and other proceedings; our ability to retain and attract senior management and other key employees and other risks detailed from time to time in our SEC filings. New risks emerge from time to time and it is not possible for us to predict all such risk factors or to assess the impact of such risks on our business. Accordingly, we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, changes in expectations, future events, or otherwise, except as required by law.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220307005958r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIra M. Birns, Executive Vice President & Chief Financial Officer\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nGlenn Klevitz, Vice President, Treasurer & Investor Relations\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"(305) 428-8000\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:investors@wfscorp.com","contentObject":[{"type":"text","content":"investors@wfscorp.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220307005958/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220307005958/en/","gated":false}],"gated":false}],"gated":false}]}