{"id":"8493717","sourceId":"globe-newswire","sourceName":"GlobeNewswire","providerName":"GlobeNewswire","title":"Century Aluminum and Ocean GeoLoop Partner on Carbon Capture Technology to Help with Goal of Carbon Neutral Aluminum Production","publishedDate":"2022-02-28T11:36:48-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"CHICAGO, Feb.  28, 2022  (GLOBE NEWSWIRE) -- Century Aluminum Company (NASDAQ: CENX) announced today that its wholly-owned subsidiary, Nordural Grundartangi ehf (“Nordural” or “Grundartangi”), signed a Letter of Intent (LOI) with industrial green technology leader, Ocean GeoLoop, for carbon capture at the Grundartangi plant in Iceland. The project has an ambition to reduce Iceland’s carbon emission by approximately 10% by deploying Ocean GeoLoop’s carbon capture solution.","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"“We are proud to announce this agreement with Nordural, aiming to reduce carbon emissions significantly by deploying our disruptive carbon capture solution. The end-of-pipe technology is planned to be assisted by the e-Loop, a horizontal hydropower unit, enabling electricity production utilizing the CO","gated":false},{"type":"sub","contentObject":[{"type":"text","content":"2","gated":false}],"gated":false},{"type":"text","content":" from the aluminum process resulting in a self-energized carbon capture solution at Nordural,” says Odd-Geir Lademo, CEO at Ocean GeoLoop.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Ocean GeoLoop develops, pilots, and commercializes multifunctional environmental technologies for carbon capture, utilization, and storage. The GeoLoop carbon capture solution is characterized by several unique capabilities, as the CO","gated":false},{"type":"sub","contentObject":[{"type":"text","content":"2","gated":false}],"gated":false},{"type":"text","content":" separation is 100% clean, can capture 100% of the CO","gated":false},{"type":"sub","contentObject":[{"type":"text","content":"2","gated":false}],"gated":false},{"type":"text","content":", and has no need for special adaptations based on the type of flue gas. The carbon capture process is expected to be assisted by the e-Loop, a proprietary, horizontal hydropower unit, enabling electricity production from low quality heat sources.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Nordural produces Natur-Al™ aluminum with one of the lowest CO₂ footprints in the world. With OGL, Nordural has the ambition to become a carbon neutral aluminum producer.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"“We are excited at the prospect of being able to capture, use and store the CO","gated":false},{"type":"sub","contentObject":[{"type":"text","content":"2","gated":false}],"gated":false},{"type":"text","content":" that our plant emits now. We are already far ahead of the curve in terms of carbon footprint, as all our electricity is renewable, but a successful carbon capture scheme would bring us to true carbon neutrality,” says Gunnar Guðlaugsson, CEO of Nordural.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"About Century Aluminum Company","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Century Aluminum Company owns primary aluminum capacity in the United States and Iceland. Century's corporate offices are located in Chicago, IL. Visit ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=p3n8BJ_yiNSpH2razKDBhoUUZJq4fMiLQrd0nDv6y0vneq5YiRjypD9xcNV0TKrZ_WvTUHMFiuFBOBhTTnNTI6xKzZ-4gEx75svLePasgQ698aXwMK2MFXgGnCQ7I2df","contentObject":[{"type":"text","content":"www.centuryaluminum.com","gated":false}],"gated":false},{"type":"text","content":" for more information.  ","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Cautionary Statement","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are statements about future events and are based on our current expectations. These forward-looking statements may be identified by the words \"believe,\" \"expect,\" \"hope,\" \"target,\" \"anticipate,\" “aim,” \"intend,\" \"plan,\" \"seek,\" \"estimate,\" \"potential,\" \"project,\" \"scheduled,\" \"forecast\", “ambition,” or words of similar meaning, or future or conditional verbs such as \"will,\" \"would,\" \"should,\" \"could,\" \"might,\" or \"may.\"","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Where we express an expectation or belief as to future events or results, such expectation or belief is expressed in good faith and believed to have a reasonable basis. However, our forward-looking statements are based on current expectations and assumptions that are subject to risks and uncertainties which may cause actual results to differ materially from future results expressed, projected or implied by those forward-looking statements. Important factors that could cause actual results and events to differ from those described in such forward-looking statements can be found in the risk factors and forward-looking statements cautionary language contained in our Annual Report on Form 10-K, quarterly reports on Form 10-Q and in other filings made with the Securities and Exchange Commission. Although we have attempted to identify those material factors that could cause actual results or events to differ from those described in such forward-looking statements, there may be other factors that could cause actual results or events to differ from those anticipated, estimated or intended. Many of these factors are beyond our ability to control or predict. Given these uncertainties, investors are cautioned not to place undue reliance on our forward-looking statements. We undertake no obligation to update or revise publicly any forward-looking statements, whether as a result of new information, future events, or otherwise.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Contact","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Peter Trpkovski","gated":false},{"type":"br","gated":false},{"type":"text","content":"(Investors and media)","gated":false},{"type":"br","gated":false},{"type":"text","content":"312-696-3132","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Source: Century Aluminum Company","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"img","src":"https://www.globenewswire.com/newsroom/ti?nf=ODQ5MzcxNyM0NzYxNjkwIzIwODE0ODA=","alt":"","variations":[],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"img","src":"https://ml.globenewswire.com/media/YWNjYWEzNmQtMjEyMC00MDE1LTg1YjItNzkyYTk0MTA3ZTViLTEwOTMwNTE=/tiny/Century-Aluminum-Company.png","alt":"","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"a","href":"https://www.globenewswire.com/NewsRoom/AttachmentNg/132a3ef5-64e0-4a1b-8832-55eab8165738","contentObject":[{"type":"img","src":"https://ml.globenewswire.com/media/132a3ef5-64e0-4a1b-8832-55eab8165738/small/centuryjpeg-jpg.jpg","alt":"Primary Logo","variations":[],"gated":false}],"gated":false}],"gated":false}]}