{"id":"20220519331","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Tesla dumped by S&P ESG index and Musk cries label is a 'scam'","publishedDate":"2022-05-19T06:23:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Rachel Koning Beals ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Electric vehicle standing doesn't offset discrimination claims, autopilot crashes, S&P says ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Tesla may be regarded by many as a revolutionary in the switch to cleaner-burning cars, but its early-to-market feat isn't enough to protect its stock listing in one of mostly widely followed environmental, social and governance (ESG) indexes. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n   The S&P 500 ESG Index has dropped Elon Musk's Tesla(TSLA) from the lineup, as revealed this week in its annual rebalancing. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"While Tesla may be playing its part in taking fuel-powered cars off the road, it has fallen behind its peers when examined through a wider ESG lens,\" says Margaret Dorn, senior director and head of ESG indices, North America, at S&P Dow Jones Indices, in a blog post. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Musk had his own response to the lost status, in a Twitter thread. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The news also hits amid continued scrutiny of Musk's bid for Twitter and his claim it has thwarted free speech. The pursuit has impacted both the stock of the targeted company (TWTR) and Tesla's shares, as investors mull a risk of thinning attention from Musk. Tesla trades down 31% in the year to date, but remains up 28% from it stood one year ago. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Tesla's S&P DJI ESG score has remained fairly stable year-over-year but it was pushed further down the ranks relative to its global industry group peers, S&P said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  An analysis identified two separate events centered around claims of racial discrimination and poor working conditions at Tesla's Fremont, Calif., factory, S&P said. A judge did reduce Tesla's payout in a related suit. Tesla's handling of the NHTSA investigation after multiple deaths and injuries were linked to its autopilot vehicles also dragged on its score, S&P said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Tesla was recently tagged by sustainable investing advocate As You Sow in a report that ranked 55 companies on their \"green\" progress. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Most major corporations tell customers and shareholders they're working toward zero greenhouse gas emissions in the coming years and decades, doing their part to slow global warming. But the speed of progress varies. And many still rely on buying permission to pollute through carbon offsets rather than changing how they source energy, the As You Sow investing group charged. Others, even environmental groundbreaker Tesla, earned poor marks for not publicly sharing emissions data at all. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Warren Buffett's Berkshire Hathaway BRK.B earned a similar scolding for no emissions reporting amid the company's investment in both traditional energy and solar and other forward-looking green energy. It, too, has been cut from the S&P ESG list. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Broadly, S&P said it took a fresh look at the ESG listings using a revised list of exclusions based on a company's involvement in business activities such as small arms, military contracting and oil sands . ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  But the index has also maintained a posture that keeps it closely tracking, at least by industry weight, the broader S&P 500 .  S&P claims it can continue this alignment while enhancing the overall sustainability profile of the index. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  That means it includes oil giant ExxonMobil (XOM) in the ESG mix, a factor Musk also lamented. For S&P, the inclusion keeps up its energy-sector representation in line with broad goals. Staunch environmental groups also typically take issue with such inclusion, but other energy-industry watchers say the transition to cleaner options at the well-established traditional energy firms will be most effective given their size and their investment in practices such as carbon capture. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  JPMorgan Chase & Co. (JPM) also makes the ESG cut in this index. It is the largest lender to the fossil-fuel industry, while saying it has cut investment in the \"dirtiest\" industries and cleaning up its company-created emissions. Still, its lending, which has increased to oil and gas interests, has earned a rebuke from environmental groups. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read:EVs can store power for our homes and the grid: Why 'vehicle-to-everything' technology is a must-follow investing theme ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Rachel Koning Beals ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-19-22 0723ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}