{"id":"20220516fl59127","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"Spirit Airlines Board of Directors to Review Unsolicited Tender Offer from JetBlue","publishedDate":"2022-05-16T13:27:00-05:00","body":[{"type":"text","content":"Spirit Airlines Board of Directors to Review Unsolicited Tender Offer from JetBlue\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"Spirit Airlines Board of Directors to Review Unsolicited Tender Offer from JetBlue","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"MIRAMAR, Fla., May 16, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"i","contentObject":[{"type":"text","content":"Stockholders Advised Not to Take Action at This Time","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"MIRAMAR, Fla., May 16, 2022 /PRNewswire/ -- Spirit Airlines, Inc. (\"Spirit\" or the \"Company\") (NYSE: SAVE) today confirmed that JetBlue Airways (\"JetBlue\") (NASDAQ: JBLU) has commenced an unsolicited tender offer to acquire all outstanding shares of Spirit's common stock for $30 per share in cash and a proxy solicitation opposing Spirit's merger agreement with Frontier Group Holdings, Inc. (\"Frontier\") (NASDAQ: ULCC), parent company of Frontier Airlines, Inc.","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n                ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n                        ","gated":false},{"type":"a","href":"https://mma.prnewswire.com/media/1442236/Spirit_Airlines_Logo.html","contentObject":[{"type":"text","content":"\n                    ","gated":false},{"type":"img","src":"https://mma.prnewswire.com/media/1442236/Spirit_Airlines_Logo.jpg","alt":"(PRNewsfoto/Spirit Airlines, Inc.)","variations":[],"gated":false},{"type":"text","content":"\n                        ","gated":false}],"gated":false},{"type":"text","content":"\n                ","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Consistent with its fiduciary duties and applicable law, and in consultation with outside financial and legal advisors, the Spirit Board of Directors (the \"Board\") will carefully review JetBlue's tender offer to determine the course of action that it believes is in the best interests of Spirit and its stockholders. Spirit stockholders are urged to take no action with respect to the JetBlue tender offer at this time pending the Board's evaluation of the offer.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Spirit intends to advise its stockholders of the Board's formal position regarding the JetBlue tender offer within ten business days by making available to Spirit stockholders and filing with the Securities and Exchange Commission (the \"SEC\") a solicitation/recommendation statement on Schedule 14D-9. Applicable securities laws prevent Spirit from making any further comments with respect to JetBlue's tender offer or the terms thereof until after the Schedule 14D-9 is filed with the SEC.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"On May 2, 2022, Spirit ","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3538378-1&h=677119491&u=https%3A%2F%2Fwww.prnewswire.com%2Fnews-releases%2Fspirit-airlines-board-of-directors-reiterates-support-for-merger-with-frontier-airlines-301537140.html&a=announced","contentObject":[{"type":"text","content":"announced","gated":false}],"gated":false},{"type":"text","content":" that its Board unanimously determined that the unsolicited proposals received from JetBlue in March and April 2022 did not constitute a 'Superior Proposal' as defined in Spirit's merger agreement with Frontier, because it determined that the proposed transaction was not reasonably capable of being consummated.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Barclays and Morgan Stanley & Co. LLC are serving as financial advisors to Spirit, and Debevoise & Plimpton LLP and Paul, Weiss, Rifkind, Wharton & Garrison LLP are serving as legal advisors.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"About Spirit Airlines ","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Spirit Airlines (NYSE: SAVE) is committed to delivering the best value in the sky. We are the leader in providing customizable travel options starting with an unbundled fare. This allows our Guests to pay only for the options they choose — like bags, seat assignments and refreshments — something we call Á La Smarte. We make it possible for our Guests to venture further and discover more than ever before. Our Fit Fleet® is one of the youngest and most fuel-efficient in the U.S. We serve destinations throughout the U.S., Latin America and the Caribbean and are dedicated to giving back and improving those communities. Come save with us at spirit.com.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"No Offer or Solicitation","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This communication is for informational purposes only and is not intended to and does not constitute an offer to sell, or the solicitation of an offer to subscribe for or buy, or a solicitation of any vote or approval in any jurisdiction, nor shall there be any sale, issuance or transfer of securities in any jurisdiction in which such offer, sale or solicitation would be unlawful, prior to registration or qualification under the securities laws of any such jurisdiction.  No offer of securities shall be made except by means of a prospectus meeting the requirements of Section 10 of the Securities Act of 1933, as amended, and otherwise in accordance with applicable law.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Important Additional Information Will be Filed with the SEC","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Frontier has filed with the Securities and Exchange Commission (\"SEC\") a Registration Statement on Form S-4 in connection with the proposed transaction, including a definitive Information Statement/Prospectus of Frontier and a definitive Proxy Statement of Spirit. The Form S-4 was declared effective on May 11, 2022 and the prospectus/proxy statement was first mailed to Spirit stockholders on May 11, 2022.  Frontier and Spirit also plan to file other relevant documents with the SEC regarding the proposed transaction.  INVESTORS AND STOCKHOLDERS ARE URGED TO READ THE REGISTRATION STATEMENT/ INFORMATION STATEMENT/ PROSPECTUS/ PROXY STATEMENT AND ANY OTHER RELEVANT DOCUMENTS TO BE FILED BY FRONTIER OR SPIRIT WITH THE SEC IN THEIR ENTIRETY CAREFULLY WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT FRONTIER, SPIRIT, THE PROPOSED TRANSACTIONS AND RELATED MATTERS.  Investors and stockholders are able to obtain free copies of the Registration Statement and the definitive Information Statement/Proxy Statement/Prospectus and other documents filed with the SEC by Frontier and Spirit through the website maintained by the SEC at ","gated":false},{"type":"a","href":"http://www.sec.gov","contentObject":[{"type":"text","content":"www.sec.gov","gated":false}],"gated":false},{"type":"text","content":". In addition, investors and stockholders will be able to obtain free copies of the information statement and the proxy statement and other documents filed with the SEC by Frontier and Spirit on Frontier's Investor Relations website at ","gated":false},{"type":"a","href":"https://ir.flyfrontier.com","contentObject":[{"type":"text","content":"https://ir.flyfrontier.com","gated":false}],"gated":false},{"type":"text","content":" and on Spirit's Investor Relations website at ","gated":false},{"type":"a","href":"https://c212.net/c/link/?t=0&l=en&o=3538378-1&h=76117690&u=https%3A%2F%2Fir.spirit.com%2F&a=https%3A%2F%2Fir.spirit.com","contentObject":[{"type":"text","content":"https://ir.spirit.com","gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Participants in the Solicitation","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Frontier and Spirit, and certain of their respective directors and executive officers, may be deemed to be participants in the solicitation of proxies in respect of the proposed transactions contemplated by the Merger Agreement. Information regarding Frontier's directors and executive officers is contained in Frontier's definitive proxy statement, which was filed with the SEC on April 13, 2022. Information regarding Spirit's directors and executive officers is contained in Spirit's definitive proxy statement, which was filed with the SEC on March 30, 2022.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"div","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Cautionary Statement Regarding Forward-Looking Information","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Certain statements in this communication, including statements concerning Frontier, Spirit, the proposed transactions and other matters, should be considered forward-looking within the meaning of the Securities Act of 1933, as amended, the Securities Exchange Act of 1934, as amended, and the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on Frontier's and Spirit's current expectations and beliefs with respect to certain current and future events and anticipated financial and operating performance. Such forward-looking statements are and will be subject to many risks and uncertainties relating to Frontier's and Spirit's operations and business environment that may cause actual results to differ materially from any future results expressed or implied in such forward looking statements. Words such as \"expects,\" \"will,\" \"plans,\" \"intends,\" \"anticipates,\" \"indicates,\" \"remains,\" \"believes,\" \"estimates,\" \"forecast,\" \"guidance,\" \"outlook,\" \"goals,\" \"targets\" and other similar expressions are intended to identify forward-looking statements. Additionally, forward-looking statements include statements that do not relate solely to historical facts, such as statements which identify uncertainties or trends, discuss the possible future effects of current known trends or uncertainties, or which indicate that the future effects of known trends or uncertainties cannot be predicted, guaranteed, or assured. All forward-looking statements in this communication are based upon information available to Frontier and Spirit on the date of this communication. Frontier and Spirit undertake no obligation to publicly update or revise any forward-looking statement, whether as a result of new information, future events, changed circumstances, or otherwise, except as required by applicable law.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Actual results could differ materially from these forward-looking statements due to numerous factors including, without limitation, the following: the occurrence of any event, change or other circumstances that could give rise to the right of one or both of the parties to terminate the merger agreement; failure to obtain applicable regulatory or Spirit stockholder approval in a timely manner or otherwise; failure to satisfy other closing conditions to the proposed transactions; failure of the parties to consummate the transaction; risks that the new businesses will not be integrated successfully or that the combined companies will not realize estimated cost savings, value of certain tax assets, synergies and growth, or that such benefits may take longer to realize than expected; failure to realize anticipated benefits of the combined operations; risks relating to unanticipated costs of integration; demand for the combined company's services; the growth, change and competitive landscape of the markets in which the combined company participates; expected seasonality trends; diversion of managements' attention from ongoing business operations and opportunities; potential adverse reactions or changes to business or employee relationships, including those resulting from the announcement or completion of the transaction; risks related to investor and rating agency perceptions of each of the parties and their respective business, operations, financial condition and the industry in which they operate; risks related to the potential impact of general economic, political and market factors on the companies or the proposed transaction; that Frontier's cash and cash equivalents balances, together with the availability under certain credit facilities made available to Frontier and certain of its subsidiaries under its existing credit agreements, will be sufficient to fund Frontier's operations including capital expenditures over the next 12 months; Frontier's expectation that based on the information presently known to management, the potential liability related to Frontier's current litigation will not have a material adverse effect on its financial condition, cash flows or results of operations; that the COVID-19 pandemic will continue to impact the businesses of the companies; ongoing and increase in costs related to IT network security; and other risks and uncertainties set forth from time to time under the sections captioned \"Risk Factors\" in Frontier's and Spirit's reports and other documents filed with the SEC from time to time, including their Annual Reports on Form 10-K and Quarterly Reports on Form 10-Q.","gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=FL59127&sd=2022-05-16","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content to download multimedia:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/spirit-airlines-board-of-directors-to-review-unsolicited-tender-offer-from-jetblue-301548206.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/spirit-airlines-board-of-directors-to-review-unsolicited-tender-offer-from-jetblue-301548206.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  Spirit Airlines, Inc.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false}]}