{"id":"20220516la58204","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"NUTEX HEALTH ANNOUNCES TWO NEW FULLY FUNCTIONAL MICRO HOSPITALS","publishedDate":"2022-05-16T02:00:00-05:00","body":[{"type":"text","content":"NUTEX HEALTH ANNOUNCES TWO NEW FULLY FUNCTIONAL MICRO HOSPITALS\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"NUTEX HEALTH ANNOUNCES TWO NEW FULLY FUNCTIONAL MICRO HOSPITALS","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"HOUSTON, May 16, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"HOUSTON, May 16, 2022 /PRNewswire/ -- Nutex Health Inc. (\"Nutex Health\" or the \"Company\") (NASDAQ: NUTX), a physician-led, technology-enabled healthcare services company comprised of a hospital division with 21 facilities in 8 states and a primary care-centric, risk-bearing population health management division, today announced two new fully operational micro hospitals.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The first hospital, New Braunfels ER & Hospital, is in New Braunfels, Texas, located about 30 miles northeast of San Antonio.  The state-of-the-art facility is open 24/7, 365 days a year, and includes an emergency room with 9 private exam rooms staffed with board-certified physicians and 4 private inpatient beds.  The hospital provides both adult and pediatric care, and has the most advanced imaging and laboratory equipment, including CT, X-Ray and ultrasound with rapid radiological reports.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The second hospital, East Valley ER & Hospital, is in Gilbert, Arizona, located about 21 miles southeast of Phoenix. The state-of-the-art hospital is open 24/7, 365 days a year, and includes an emergency room with 14 private exam rooms and 14 private inpatient beds. The hospital provides both adult and pediatric care, and has the most advanced imaging and laboratory equipment, including MRI, CT, X-Ray and ultrasound.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Nutex currently anticipates opening 3 more facilities in 2022, with another 17 facilities either under construction or in advanced planning stages and anticipated to open in 2023 and 2024.  There can be no assurance that these additional facilities will open in the anticipated timing or that they will open at all.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Nutex micro hospitals focus on ensuring that patients receive a premium patient experience.  Our hospitals feature short ER wait times averaging 15 minutes from entering the door to seeing a physician, high-quality care, lower nursing- and physician-to-patient staffing ratios and faster discharge times.  Physicians, nurses and other employees are incentivized to provide quality, compassionate care to their patients.  Nutex micro hospitals consistently have better outcomes and high patient satisfaction scores, with well over 1000 five-star Google reviews.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"We are excited to continue to expand Nutex's network of micro hospitals across the country,\" stated Tom Vo, M.D., MBA, Chairman and Chief Executive Officer of Nutex Health. \"Both New Braunfels and Gilbert are vibrant and rapidly growing suburbs of major metropolitan areas.  Our goal is to provide high-quality acute medical care to the populations of these communities.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"Entering the medical field, my goal was always to try to revolutionize the way healthcare is delivered to our patients.  Our unique model allows physicians and nurses to retake control of patient care,\" stated Trey Allen, M.D., Medical Director at New Braunfels ER & Hospital.  \"We are committed to working with the community to make sure they can receive the healthcare they deserve.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"As physicians, we saw how healthcare was being delivered, and we felt we could do better.  We felt the humanity and compassion were absent from many medical interactions.  We value and respect our patients, and treat them as family,\" stated Daniel Stites, M.D., Medical Director at East Valley ER & Hospital.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"About Nutex Health Inc. (Combined post-merger company) ","gated":false},{"type":"br","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Headquartered in Houston, Texas and founded in 2011, Nutex Health Inc. is a physician-led, technology-enabled healthcare services company with approximately 1500 employees nationwide and is partnered with over 800 physicians. The Company has two divisions a Hospital division and a Population Health Management division. The hospital division owns and operates 21 facilities in eight different states.  The division implements and operates different innovative health care models, including micro hospitals, specialty hospitals and hospital outpatient departments (HOPDs). The Population Health Management division owns and operates provider networks such as Independent Physician Associations (IPAs). Through our Management Services Organizations (MSOs), we provide management, administrative and other support services to our affiliated hospitals and physician groups. Our cloud-based proprietary technology platform aggregates clinical and claims data across multiple settings, information systems and sources to create a holistic view of patients and providers, allowing us to deliver greater quality care more efficiently. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Safe Harbor:","gated":false},{"type":"br","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Certain statements and information included in this press release constitute \"forward-looking statements\" within the meaning of the Federal Private Securities Litigation Act of 1995. When used in this press release, the words or phrases \"will\", \"will likely result,\" \"expected to,\" \"will continue,\" \"anticipated,\" \"estimate,\" \"projected,\" \"intend,\" \"goal,\" or similar expressions are intended to identify \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Such statements are subject to certain risks, known and unknown, and uncertainties, many of which are beyond the control of the Company.  Such uncertainties and risks include the ability to realize the anticipated benefits of the transaction, significant transaction costs and unknown liabilities and litigation and regulatory risks related to the transaction.   In addition, forward-looking statements are subject to additional uncertainties and risks facing the Company, including but not limited to, economic conditions, dependence on management, dilution to stockholders, lack of capital, changes in laws or regulations, the effects of rapid growth upon the Company and the ability of management to effectively respond to the growth and demand for products and services of the Company, newly developing technologies, the Company's  ability to compete, conflicts of interest in related party transactions, regulatory matters, protection of technology, lack of industry standards, the effects of competition and the ability of the Company to obtain future financing. Such factors could materially adversely affect the Company's financial performance and could cause the Company's actual results for future periods to differ materially from any opinions or statements expressed within this press release.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=LA58204&sd=2022-05-16","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/nutex-health-announces-two-new-fully-functional-micro-hospitals-301547611.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/nutex-health-announces-two-new-fully-functional-micro-hospitals-301547611.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  Nutex Health, Inc.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false}]}