{"id":"20220518451","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Target's stock plunge casts a pall on retail sector","publishedDate":"2022-05-18T10:34:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  The historic selloff in Target Corp's stock (TGT) is casting a pall on the retail sector, as shares of 90 of the S&P 500's  92 consumer discretionary and staples companies are trading lower. Target's stock was the weakest of the bunch, tumbling 24.7% toward an 18-month low, as well as the biggest one-day plunge since Black Monday (Oct. 19, 1987), after a hugely disappointing earnings report. The SPDR Consumer Staples Select Sector ETF (XLP) slumped 4.7%, with all 32 components losing ground, while the SPDR Consumer Discretionary Select Sector ETF (XLY), of which Target is a component, also dropped 4.7% with 58 of 60 components falling. Among some of the more sympathetic losers, shares of fellow discount retailers Dollar Tree Inc. (DLTR) tumbled 17.2% and Dollar General Corp. (DG) slid 12.2%, while membership-based warehouse retailer Costco Wholesale Corp (COST) sank 11.6%. Drug store chain and health care services company Walgreens Boots Alliance Inc.'s stock (WBA) dropped 6.6%, and was the Dow Jones Industrial Average's  biggest decliner. Walmart Inc.'s stock (WMT) slumped 5.9%, after tumbling 11.4% on Tuesday on the back of disappointing earnings.  The two retail gainers were shares of discount retailers TJX Companies Inc. (TJX), which rallied 9.1% after an earnings beat, and Ross Stores Inc. (ROST), which tacked on 2.6%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tomi Kilgore ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-18-22 1134ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}