{"id":"20220324ny03560","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"Paramount Global Announces $1.0 Billion Subordinated Debt Offering","publishedDate":"2022-03-24T18:33:00-05:00","body":[{"type":"text","content":"Paramount Global Announces $1.0 Billion Subordinated Debt Offering\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"Paramount Global Announces $1.0 Billion Subordinated Debt Offering","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"NEW YORK, March 24, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"NEW YORK, March 24, 2022 /PRNewswire/ -- Paramount Global (NASDAQ: PARA; PARAA) today announced that it has agreed to sell $1.0 billion in aggregate principal amount of 6.375% fixed-to-fixed rate junior subordinated debentures due 2062 at a price equal to 100.000% of the principal amount thereof (the \"Debentures\"). The sale of the Debentures is expected to close on March 29, 2022, subject to customary closing conditions.","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n                ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n                        ","gated":false},{"type":"a","href":"https://mma.prnewswire.com/media/1747626/Paramount_Logo.html","contentObject":[{"type":"text","content":"\n                    ","gated":false},{"type":"img","src":"https://mma.prnewswire.com/media/1747626/Paramount_Logo.jpg","alt":"ViacomCBS today announced that the global media company will become Paramount Global (referred to as “Paramount”), effective February 16, bringing together its leading portfolio of premium entertainment properties under a new parent company name. (PRNewsfoto/ViacomCBS Inc.)","variations":[],"gated":false},{"type":"text","content":"\n                        ","gated":false}],"gated":false},{"type":"text","content":"\n                ","gated":false}],"gated":false},{"type":"text","content":"\n\n    ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Paramount Global intends to use the net proceeds from the offering, after deducting underwriting discounts and commissions and other fees and expenses related to the offering, for general corporate purposes, including the possible repayment of existing indebtedness.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The joint structuring agents and book-running managers for the offering are BofA Securities, Inc., Citigroup Global Markets Inc., Deutsche Bank Securities Inc. and J.P. Morgan Securities LLC.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The Debentures, which constitute unsecured subordinated indebtedness of Paramount Global, are expected to be rated BB+ (stable) by S&P Global Ratings, BB+ (stable) by Fitch Ratings and Baa3 (stable) by Moody's Investors Service.","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"*","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The terms and conditions of the Debentures are set forth in a prospectus and related prospectus supplement, which can be obtained by contacting Paramount Global Investor Relations at (877) 227-0787 or by written request to Paramount Global, 1515 Broadway, 52nd Floor, New York, New York 10036, Attn: Investor Relations.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release shall not constitute an offer to sell or the solicitation of an offer to buy, nor shall there be any sale of these securities in any state or jurisdiction in which such offer, solicitation, or sale would be unlawful prior to registration or qualification under the securities laws of any such state or jurisdiction.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"sup","contentObject":[{"type":"text","content":"*","gated":false}],"gated":false},{"type":"text","content":"A securities rating is not a recommendation to buy, sell or hold securities and may be subject to revision or withdrawal at any time.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"ABOUT PARAMOUNT GLOBAL","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Paramount Global (NASDAQ: PARA, PARAA) is a leading global media and entertainment company that creates premium content and experiences for audiences worldwide. Driven by iconic studios, networks and streaming services, Paramount's portfolio of consumer brands includes CBS, Showtime Networks, Paramount Pictures, Nickelodeon, MTV, Comedy Central, BET, Paramount+, Pluto TV and Simon & Schuster, among others. Paramount delivers the largest share of the U.S. television audience and boasts one of the industry's most important and extensive libraries of TV and film titles. In addition to offering innovative streaming services and digital video products, the company provides powerful capabilities in production, distribution and advertising solutions.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"CAUTIONARY STATEMENT CONCERNING FORWARD-LOOKING STATEMENTS","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This communication contains both historical and forward-looking statements, including statements related to our future results and performance. All statements that are not statements of historical fact are, or may be deemed to be, forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Similarly, statements that describe our objectives, plans or goals are or may be forward-looking statements. These forward-looking statements reflect our current expectations concerning future results and events; generally can be identified by the use of statements that include phrases such as \"believe,\" \"expect,\" \"anticipate,\" \"intend,\" \"plan,\" \"foresee,\" \"likely,\" \"will,\" \"may,\" \"could,\" \"estimate\" or other similar words or phrases; and involve known and unknown risks, uncertainties and other factors that are difficult to predict and which may cause our actual results, performance or achievements to be different from any future results, performance or achievements expressed or implied by these statements. These risks, uncertainties and other factors include, among others: risks related to our streaming initiatives; changes in consumer behavior, as well as evolving technologies, distribution platforms and packaging; the impact on our advertising revenues as a result of changes in consumer viewership, advertising market conditions and deficiencies in audience measurement; our ability to maintain attractive brands and our reputation, and to offer popular programming and other content; increased costs for content and other rights; competition for talent, content, audiences, subscribers, advertising and distribution; the potential for loss of carriage or other reduction in or the impact of negotiations for the distribution of our content; losses due to asset impairment charges for goodwill, intangible assets, FCC licenses and programming; risks related to our ongoing investments in new businesses, products, services and technologies, through acquisitions and other strategic initiatives; evolving business continuity, cybersecurity, privacy and data protection and similar risks; content infringement; the impact of Covid-19 and other pandemics and measures taken in response thereto; domestic and global political, economic and regulatory factors affecting our businesses generally; liabilities related to discontinued operations and former businesses; the loss of existing or inability to hire new key employees or secure creative talent; strikes and other union activity; potential conflicts of interest arising from our ownership structure with a controlling stockholder; and other factors described in our news releases and filings with the Securities and Exchange Commission, including but not limited to our most recent Annual Report on Form 10-K and reports on Form 10-Q and Form 8-K. There may be additional risks, uncertainties and factors that we do not currently view as material or that are not necessarily known. The forward-looking statements included in this communication are made only as of the date of this communication, and we do not undertake any obligation to publicly update any forward-looking statements to reflect subsequent events or circumstances.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PARA-IR","gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=NY03560&sd=2022-03-24","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content to download multimedia:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/paramount-global-announces-1-0-billion-subordinated-debt-offering-301510489.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/paramount-global-announces-1-0-billion-subordinated-debt-offering-301510489.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  Paramount Global","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false}]}