{"id":"8524227","sourceId":"globe-newswire","sourceName":"GlobeNewswire","providerName":"GlobeNewswire","title":"BJ’s Restaurants Opens in Live Oak, Texas","publishedDate":"2022-04-19T12:00:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"HUNTINGTON BEACH, Calif., April  19, 2022  (GLOBE NEWSWIRE) -- BJ’s Restaurants, Inc. (NASDAQ: BJRI) announced the opening of its restaurant in Live Oak, Texas. The new BJ’s Restaurant & Brewhouse opened yesterday, April 18, 2022, on a free standing pad at Live Oak Center located on IKEA-RBFCU Parkway. The restaurant is approximately 7,500 square feet, seats approximately 250 guests and features BJ’s extensive menu, including BJ’s signature deep-dish pizza, award-winning handcrafted beer and famous Pizookie® dessert. BJ’s unique, contemporary décor provides the perfect environment for all dining occasions. Current hours of operation are from 11:00 a.m. to 11:00 p.m. Sunday through Thursday, and 11:00 a.m. to 12:00 midnight Friday and Saturday.","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"“We are excited to open our second restaurant of 2022,” commented Greg Levin, Chief Executive Officer & President. “Our new restaurant in Live Oak joins our four existing and successful restaurants in the San Antonio, Texas market. Our 2022 pipeline is in excellent shape and we expect to open our next restaurant in Framingham, Massachusetts in May.”","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"As with all of our new restaurant openings, BJ’s invited members of the Live Oak community to attend a soft opening event prior to our grand opening. While our team members put the final touches on the restaurant, invited guests were treated to complimentary food and had the opportunity to make a voluntary donation to the Cystic Fibrosis Foundation, a very important charity to BJ’s. Additionally, all proceeds from alcohol purchases during the soft opening event are donated to the BJ’s Restaurants Foundation.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"About BJ’s Restaurants, Inc.","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"text","content":" BJ’s Restaurants, Inc. (“BJ’s”) is a national brand with brewhouse roots where craft matters. BJ’s broad menu has something for everyone: slow-roasted entrees, like prime rib, BJ’s EnLIGHTened Entrees® including Cherry Chipotle Glazed Salmon, signature deep dish pizza and the often imitated, but never replicated world-famous Pizookie® dessert. BJ’s has been a pioneer in the craft brewing world since 1996, and takes pride in serving BJ’s award-winning proprietary handcrafted beers, brewed at its brewing operations in five states and by independent third party craft brewers. The BJ’s experience offers high-quality ingredients, bold flavors, moderate prices, sincere service and a cool, contemporary atmosphere. Founded in 1978, BJ’s owns and operates 213 casual dining restaurants in 29 states: Alabama, Arizona, Arkansas, California, Colorado, Connecticut, Florida, Indiana, Kansas, Kentucky, Louisiana, Maryland, Massachusetts, Michigan, Nevada, New Jersey, New Mexico, New York, North Carolina, Ohio, Oklahoma, Oregon, Pennsylvania, Rhode Island, South Carolina, Tennessee, Texas, Virginia and Washington. All restaurants offer dine-in, take-out, delivery and large party catering. For more BJ’s information, visit ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=WLOLh_w9iNGISH2X-d7NJt0okrKh8YYwPZBbpN4P0W85OCDzavczmFG52O7qCyucI7a0Tc22lAv_HXOsfLV62XRqShqWkYGr5QGQqjKT4tk=","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"http://www.bjsrestaurants.com","gated":false}],"gated":false}],"gated":false},{"type":"text","content":". ","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"About BJ’s Restaurants Foundation","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"text","content":" BJ’s Restaurants Foundation (the “Foundation”) is a registered 501(c)(3) qualified non-profit charitable organization principally dedicated to supporting charities that benefit children’s healthcare and education, with a primary focus on the Cystic Fibrosis Foundation. In addition, the Foundation supports volunteer efforts of BJ’s team members across the country as they help give back to the communities in which our restaurants do business. ","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Forward-Looking Statements Disclaimer","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"text","content":" Certain statements in the preceding paragraphs and all other statements that are not purely historical constitute “forward-looking” statements for purposes of the Securities Act of 1933 and the Securities Exchange Act of 1934, as amended, and are intended to be covered by the safe harbors created thereby. Such statements include, but are not limited to, those regarding expected comparable restaurant sales and margins, total potential domestic capacity, the success of various sales-building and productivity initiatives, future guest traffic trends, on and off-premise sales trends, construction cost savings initiatives and the number and timing of new restaurants expected to be opened in future periods. These “forward-looking” statements involve known and unknown risks, uncertainties and other factors which may cause actual results to be materially different from those projected or anticipated. Factors that might cause such differences include, but are not limited to: (i) the effect of the COVID-19 pandemic on our restaurant sales and operations, labor and staffing, customer traffic, our supply chain and the ability of our suppliers to continue to timely deliver food and other supplies necessary for the operation of our restaurants, the ability to manage costs and reduce expenditures and the availability of additional financing, (ii) our ability to manage new restaurant openings, (iii) construction delays, (iv) labor shortages, (v) increases in minimum wage and other employment related costs, including compliance with the Patient Protection and Affordable Care Act and minimum salary requirements for exempt team members, (vi) the effect of credit and equity market disruptions on our ability to finance our continued expansion on acceptable terms, (vii) food quality and health concerns and the effect of negative publicity about us, our restaurants, other restaurants, or others across the food supply chain, due to food borne illness or other reasons, whether or not accurate, (viii) factors that impact California, Texas and Florida, where a substantial number of our restaurants are located, (ix) restaurant and brewery industry competition, (x) impact of certain brewing business considerations, including without limitation, dependence upon suppliers, third party contractors and distributors, and related hazards, (xi) consumer spending trends in general for casual dining occasions, (xii) potential uninsured losses and liabilities due to limitations on insurance coverage, (xiii) fluctuating commodity costs and availability of food in general and certain raw materials related to the brewing of our craft beers and energy requirements, (xiv) trademark and service-mark risks, (xv) government regulations and licensing costs, (xvi) beer and liquor regulations, (xvii) loss of key personnel, (xviii) inability to secure acceptable sites, (xix) legal proceedings, (xx) other general economic and regulatory conditions and requirements, (xxi) the success of our key sales-building and related operational initiatives, (xxii) any failure of our information technology or security breaches with respect to our electronic systems and data, and (xxiii) numerous other matters discussed in the Company’s filings with the Securities and Exchange Commission, including its recent reports on Forms 10-K, 10-Q and 8-K. The “forward-looking” statements contained in this press release are based on current assumptions and expectations, and BJ’s Restaurants, Inc. undertakes no obligation to update or alter its “forward-looking” statements whether as a result of new information, future events or otherwise.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"For further information, please contact Tom Houdek of BJ’s Restaurants, Inc. at (714) 500-2400 or JCIR at (212) 835-8500 or at ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=lIRjkRHZ91lLUVTMIAKL8ItCiODAqGsZ-9ld5_kTQfKv1BEMhlhYW0bAClJ2quWxDnu_boOHiybkI2vTsDv3Mg==","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"bjri@jcir.com","gated":false}],"gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[],"gated":false},{"type":"text","content":" ","gated":false},{"type":"img","src":"https://www.globenewswire.com/newsroom/ti?nf=ODUyNDIyNyM0ODU2OTc4IzIwMDY1MjI=","alt":"","variations":[],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"img","src":"https://ml.globenewswire.com/media/N2Y0Y2Q1YTEtMDBjZS00ZDQwLTlmYzYtNTUyM2FjNmRjNDZmLTEwMTgwOTU=/tiny/BJ-s-Restaurants-Inc-.png","alt":"","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"a","href":"https://www.globenewswire.com/NewsRoom/AttachmentNg/34854abf-ac2d-40f7-a3fc-5942ed640638","contentObject":[{"type":"img","src":"https://ml.globenewswire.com/media/34854abf-ac2d-40f7-a3fc-5942ed640638/small/bjs-logo-jpg.JPG","alt":"Primary Logo","variations":[],"gated":false}],"gated":false}],"gated":false}]}