{"id":"20220517005577","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Apple Previews Innovative Accessibility Features Combining the Power of Hardware, Software, and Machine Learning","publishedDate":"2022-05-17T07:00:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Apple Previews Innovative Accessibility Features Combining the Power of Hardware, Software, and Machine Learning","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Software features coming later this year offer users with disabilities new tools for navigation, health, communication, and more","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nApple® today previewed innovative software features that introduce new ways for users with disabilities to navigate, connect, and get the most out of Apple products. These powerful updates combine the company’s latest technologies to deliver unique and customizable tools for users, and build on Apple’s long-standing commitment to making products that work for everyone.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nUsing advancements across hardware, software, and machine learning, people who are blind or low vision can use their iPhone® and iPad® to navigate the last few feet to their destination with Door Detection; users with physical and motor disabilities who may rely on assistive features like Voice Control and Switch Control can fully control Apple Watch® from their iPhone with Apple Watch Mirroring; and the Deaf and hard of hearing community can follow Live Captions on iPhone, iPad, and Mac®. Apple is also expanding support for its industry-leading screen reader VoiceOver with over 20 new languages and locales. These features will be available later this year with software updates across Apple platforms.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Apple embeds accessibility into every aspect of our work, and we are committed to designing the best products and services for everyone,” said Sarah Herrlinger, Apple’s senior director of Accessibility Policy and Initiatives. “We’re excited to introduce these new features, which combine innovation and creativity from teams across Apple to give users more options to use our products in ways that best suit their needs and lives.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Door Detection for Users Who Are Blind or Low Vision","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nApple is introducing Door Detection, a cutting-edge navigation feature for users who are blind or low vision. Door Detection can help users locate a door upon arriving at a new destination, understand how far they are from it, and describe door attributes — including if it is open or closed, and when it’s closed, whether it can be opened by pushing, turning a knob, or pulling a handle. Door Detection can also read signs and symbols around the door, like the room number at an office, or the presence of an accessible entrance symbol. This new feature combines the power of LiDAR, camera, and on-device machine learning, and will be available on iPhone and iPad models with the LiDAR Scanner.","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"1","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nDoor Detection will be available in a new Detection Mode within Magnifier, Apple’s built-in app supporting blind and low vision users. Door Detection, along with People Detection and Image Descriptions, can each be used alone or simultaneously in Detection Mode, offering users with vision disabilities a go-to place with customizable tools to help navigate and access rich descriptions of their surroundings. In addition to navigation tools within Magnifier, Apple Maps will offer sound and haptics feedback for VoiceOver users to identify the starting point for walking directions.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Advancing Physical and Motor Accessibility for Apple Watch","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nApple Watch becomes more accessible than ever for people with physical and motor disabilities with Apple Watch Mirroring, which helps users control Apple Watch remotely from their paired iPhone. With Apple Watch Mirroring, users can control Apple Watch using iPhone's assistive features like Voice Control and Switch Control, and use inputs including voice commands, sound actions, head tracking, or external Made for iPhone switches as alternatives to tapping the Apple Watch display. Apple Watch Mirroring uses hardware and software integration, including advances built on AirPlay®, to help ensure users who rely on these mobility features can benefit from unique Apple Watch apps like Blood Oxygen, Heart Rate, Mindfulness, and more.","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"2","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nPlus, users can do even more with simple hand gestures to control Apple Watch. With new Quick Actions on Apple Watch, a double-pinch gesture can answer or end a phone call, dismiss a notification, take a photo, play or pause media in the Now Playing app, and start, pause, or resume a workout. This builds on the innovative technology used in AssistiveTouch® on Apple Watch, which gives users with upper body limb differences the option to control Apple Watch with gestures like a pinch or a clench without having to tap the display.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Live Captions Come to iPhone, iPad, and Mac for Deaf and Hard of Hearing Users","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFor the Deaf and hard of hearing community, Apple is introducing Live Captions on iPhone, iPad, and Mac.","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"3","gated":false}],"gated":false},{"type":"text","content":" Users can follow along more easily with any audio content — whether they are on a phone or FaceTime® call, using a video conferencing or social media app, streaming media content, or having a conversation with someone next to them. Users can also adjust font size for ease of reading. Live Captions in FaceTime attribute auto-transcribed dialogue to call participants, so group video calls become even more convenient for users with hearing disabilities. When Live Captions are used for calls on Mac, users have the option to type a response and have it spoken aloud in real time to others who are part of the conversation. And because Live Captions are generated on device, user information stays private and secure.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"VoiceOver Adds New Languages and More","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nVoiceOver, Apple’s industry-leading screen reader for blind and low vision users, is adding support for more than 20 additional locales and languages, including Bengali, Bulgarian, Catalan, Ukrainian, and Vietnamese.","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"4","gated":false}],"gated":false},{"type":"text","content":" Users can also select from dozens of new voices that are optimized for assistive features across languages. These new languages, locales, and voices will also be available for Speak Selection and Speak Screen accessibility features. Additionally, VoiceOver users on Mac can use the new Text Checker tool to discover common formatting issues such as duplicative spaces or misplaced capital letters, which makes proofreading documents or emails even easier.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Additional Features","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nWith ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Buddy Controller","gated":false}],"gated":false},{"type":"text","content":", users can ask a care provider or friend to help them play a game; Buddy Controller combines any two game controllers into one, so multiple controllers can drive the input for a single player.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nWith ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Siri® Pause Time","gated":false}],"gated":false},{"type":"text","content":", users with speech disabilities can adjust how long Siri waits before responding to a request.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Voice Control Spelling Mode","gated":false}],"gated":false},{"type":"text","content":" gives users the option to dictate custom spellings using letter-by-letter input.","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"5","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Sound Recognition","gated":false}],"gated":false},{"type":"text","content":" can be customized to recognize sounds that are specific to a person’s environment, like their home’s unique alarm, doorbell, or appliances.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nThe ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Apple","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Books®","gated":false}],"gated":false},{"type":"text","content":" app will offer new themes, and introduce customization options such as bolding text and adjusting line, character, and word spacing for an even more accessible reading experience.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Celebrating Global Accessibility Awareness Day","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis week, Apple is celebrating Global Accessibility Awareness Day with special sessions, curated collections, and more:\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"SignTime","gated":false}],"gated":false},{"type":"text","content":" will launch in Canada on May 19 to connect Apple Store® and Apple Support customers with on-demand American Sign Language (ASL) interpreters. SignTime is already available for customers in the US using ASL, the UK using British Sign Language (BSL), and France using French Sign Language (LSF).\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Apple Store locations","gated":false}],"gated":false},{"type":"text","content":" around the world are offering live sessions throughout the week to help customers discover accessibility features on iPhone, and ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Apple Support social channels","gated":false}],"gated":false},{"type":"text","content":" are showcasing how-to content.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nThe ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Accessibility Assistant shortcut","gated":false}],"gated":false},{"type":"text","content":" is coming to the Shortcuts app on Mac and Apple Watch this week to help recommend accessibility features based on user preferences.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nThis week in ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Apple","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Fitness+℠","gated":false}],"gated":false},{"type":"text","content":", trainer Bakari Williams uses ASL to highlight the features available to users that are part of an ongoing effort to make fitness more accessible to all, including Audio Hints, which are short descriptive verbal cues to support users who are blind or low vision, and Time to Walk and Time to Run episodes becoming “Time to Walk or Push” and “Time to Run or Push” for wheelchair users. Additionally, Fitness+ trainers incorporate ASL into every workout and meditation, all videos include closed captioning in six languages, and trainers demonstrate modifications in each workout so users at different levels can join in.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Apple Maps","gated":false}],"gated":false},{"type":"text","content":" features a new guide from the National Park Foundation, Park Access for All, to help users discover accessible features, programs, and services to explore in parks across the US. Guides from Gallaudet University — the world’s premier university for Deaf, hard of hearing, and Deafblind students — feature businesses and organizations that value, embrace, and prioritize the Deaf community and signed languages.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nUsers can explore accessibility-focused apps and powerful stories from app creators in the ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"App Store®","gated":false}],"gated":false},{"type":"text","content":";","gated":false},{"type":"b","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":"check out the Transforming Our World collection in ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Apple Books","gated":false}],"gated":false},{"type":"text","content":", featuring stories by and about people with disabilities; and learn about creative ways technology is advancing accessibility in","gated":false},{"type":"b","contentObject":[{"type":"text","content":" Apple Podcasts®","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Apple Music® ","gated":false}],"gated":false},{"type":"text","content":"will highlight the Saylists playlists, a collection of playlists that each focus on a different sound. Choosing one and singing along is a fun and engaging way to practice vocal sounds or speech therapy.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nThe ","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Apple TV®","gated":false}],"gated":false},{"type":"text","content":" app will highlight the latest hit movies and shows featuring authentic representation of people with disabilities. Plus, viewers can explore guest-curated collections from the accessibility community’s standout actors, including Marlee Matlin (“CODA”), Lauren Ridloff (“Eternals”), Selma Blair (“Introducing, Selma Blair”), Ali Stroker (“Christmas Ever After”), and more.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ol","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nDoor Detection and People Detection features in Magnifier require the LiDAR Scanner on iPhone 13 Pro, iPhone 13 Pro Max, iPhone 12 Pro, iPhone 12 Pro Max, iPad Pro 11-inch (2nd and 3rd generation), and iPad Pro 12.9-inch (4th and 5th generation). Door Detection should not be relied upon in circumstances where a user may be harmed or injured, or in high-risk or emergency situations.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nApple Watch Mirroring is available on Apple Watch Series 6 and later.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nLive Captions will be available in beta later this year in English (US, Canada) on iPhone 11 and later, iPad models with A12 Bionic and later, and Macs with Apple silicon. Accuracy of Live Captions may vary and should not be relied upon in high-risk situations.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nVoiceOver, Speak Selection, and Speak Screen will add support for Arabic (World), Basque, Bengali (India), Bhojpuri (India), Bulgarian, Catalan, Croatian, Farsi, French (Belgium), Galician, Kannada, Malay, Mandarin (Liaoning, Shaanxi, Sichuan), Marathi, Shanghainese (China), Spanish (Chile), Slovenian, Tamil, Telugu, Ukrainian, Valencian, and Vietnamese.\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\nVoice Control spelling mode is available in English (US).\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nApple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nNOTE TO EDITORS: For additional information visit Apple Newsroom (","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.apple.com%2Fnewsroom&esheet=52721835&newsitemid=20220517005577&lan=en-US&anchor=www.apple.com%2Fnewsroom&index=1&md5=1bd7747d13038fb8e4818e38ae28333c","contentObject":[{"type":"text","content":"www.apple.com/newsroom","gated":false}],"gated":false},{"type":"text","content":"), or call Apple’s Media Helpline at (408) 974-2042.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n© 2022 Apple Inc. All rights reserved. Apple, the Apple logo, iPhone, iPad, Apple Watch, Mac, AirPlay, AssistiveTouch, FaceTime, Siri, Apple Books, Apple Store, Apple Fitness+, App Store, Apple Podcasts, Apple Music, and Apple TV are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220517005577r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Press Contacts: \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Chloe Sweet\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Apple\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:chloe_sweet@apple.com","contentObject":[{"type":"text","content":"chloe_sweet@apple.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220517005577/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220517005577/en/","gated":false}],"gated":false}],"gated":false}]}