{"id":"202205181190","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"'It's pure panic': Florida parents of twins spent more than 4 hours driving to find baby formula","publishedDate":"2022-05-18T17:37:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Zoe Han ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Amid a nationwide shortage of baby formula, President Joe Biden says 'there's nothing more urgent we're working on.' ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  When Erik and Kelly Schmidt, both 35, went into a Central Florida Target store on May 9 to buy their usual baby formula, Up & Up Gentle, for their five-month-old twins, they found an empty shelf. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The pair then embarked on a half-day journey in search of formula, any formula, and their quest didn't end there. \"We spent over four hours going to every Target, different Walmarts (WMT), different grocery stores, just finding absolutely nothing,\" Erik Schmidt said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Schmidts moved to Florida from New York in March in search of a lower cost of living. Erik Schmidt works remotely as a graphic designer while Kelly just got a new job as an office administrator at a local church. They were looking to stock up on formula for an upcoming two-day trip to Walt Disney World when they ran smack into the nationwide baby formula shortage. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"It's pure panic, \" Kelly Schmidt said. When she saw the empty shelf, she started texting her mom, who was watching the twins. She avoided calling, even though it would have been quicker. She was in no state to talk, she said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Because I'm freaking out,\" she said. \"And if I happen to talk to somebody right now, I'm gonna cry, I'm gonna yell at her for no reason. Like something bad is gonna happen. I just need to focus on what we're doing and not deal with anything else. \" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Abbott's (ABT) recall of Similac baby formula in February exacerbated a baby formula shortage that started late last year due to supply-chain disruptions. Across the country, parents are scrambling to find formula amid panic hoarding, new purchase restrictions and rising prices as a result of the short supply. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Formula is considered the only safe alternative to breast milk, and making your own is not an option. President Joe Biden on May 13 promised steps to address the shortage, saying there was \"nothing more urgent we're working on.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Schmidt twins' go-to Up & Up Gentle is a Target (TGT) store brand of baby formula, and it's not part of Abbott's safety recall. Yet the ripple effects of the Abbott recall hit the Schmidts and their twins, Lily and Jameson, nonetheless. Just a week or two ago, the shortage wasn't obvious when Erik went to the store and got the usual supply. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"If the shortage was then, it wasn't that bad,\" he said. \"I don't know when it actually started, I don't even know why or how it happened, it's just there, empty shelves, like 'boom.'\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  After finding the empty Target shelf, and after hours of fruitless searching for their regular brand or something close, the Schmidts ended up buying a can of formula from a brand they had never tried or heard of before.  It was the only thing available. The Schmidts use Up & Up Gentle to feed their twins because it doesn't upset their stomachs, and it's cheaper than Enfamil Gentlease. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The search then continued into the night as the two turned online. They discovered that the discount supermarket chain Aldi carries a formula that's supposed to be gentle on babies' stomachs, and that there were four or five Aldi stores within a few hours driving distance from them. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The next morning, Erik was waiting for the doors to open at an Aldi at 9 a.m. No luck. It took trips to three other stores, but by around10:30 a.m. he found what he was looking for: Little Journey Gentle, the Aldi equivalent of their regular brand. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"They only had six left. I left two on the shelf because I didn't want to be 'that guy', \" he said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The pair said they usually need 15 to 16 bottles of formula mix for the twins per day, and their usual Target can makes 36 bottles. With Aldi's packaging slightly smaller, they said the four cans they found -- which required \"a solid six hours\" of driving around and searching online overnight -- will probably sustain them for roughly a week. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Even without the shortage, when he goes to the store to get two weeks worth of stuff, because of we have twins, people look at him like a monster like he's hoarding formula,\" Kelly Schmidt said. \"Now there isn't enough. We don't have one baby, we have two babies, so we need double the amount that a normal person would use.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Target, Walmart, Aldi, and Enfamil didn't respond to requests for comment. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  On Monday, Abbott reached a deal with the Food and Drug Administration to restart production of baby formula at a U.S. plant that has been shut down amid a recall of the product, which contributed to a nationwide shortage of formula. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In the meantime, the Biden administration rolled out measures including importing more formula from overseas to address the shortage. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  While she waits for supplies to return to normal, Kelly Schmidt said she plans to keep checking the Target website and will be ready to order her family's regular brand as soon it appears to be restocked. She's also monitoring the supply of Enfamil Gentlease, a brand the twins have used before but that's twice the price of the Target one. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The pair's plight resonated with friends near and far. They posted on Facebook about their situation and got messages of support, with friends promising to keep an eye out for formula for them, Erik Schmidt said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  If the shortage continues until July, the pair isn't sure what they'll do. Breastfeeding is not an option, Kelly said, because her milk dried up months ago. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"I don't even know, get it when we find it? \" Kelly Schmidt said about how they plan to feed the twins after they've used up the Aldi cans. If they can't find more of what they're using now, they may try some normal formula -- not the kind that's gentle on babies' stomachs. Although it's not perfect, it's an option, Kelly Schmidt said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We could put them back on a regular one, it will disagree with their stomach, but at least they'll be eating,\" she said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Over the weekend, after this story first published, Erik Schmidt told MarketWatch that he and and Kelly had secured their baby-formula supply online. The Schmidts said they had received offers of formula donations after the story ran, and urged people who wanted to help to donate extra formula to a local church or other community organizations. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Zoe Han ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-18-22 1837ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}