{"id":"20220425ph35624","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"TRIUMPH APPOINTS NEAL J. KEATING AS NEW INDEPENDENT DIRECTOR","publishedDate":"2022-04-25T16:00:00-05:00","body":[{"type":"text","content":"TRIUMPH APPOINTS NEAL J. KEATING AS NEW INDEPENDENT DIRECTOR\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"TRIUMPH APPOINTS NEAL J. KEATING AS NEW INDEPENDENT DIRECTOR","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"BERWYN, Pa., April 25, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"BERWYN, Pa., April 25, 2022 /PRNewswire/ -- Triumph Group, Inc. (NYSE:TGI) (\"TRIUMPH\" or the \"Company\") today announced that Neal J. Keating has joined its Board of Directors as an independent director, effective immediately. With this addition, TRIUMPH's board will be expanded to nine directors, eight of whom are independent, and four of whom have been appointed to the Board in the last four years.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Mr. Keating served as Chief Executive Officer and Chairman of the Board of Kaman Corporation, an aerospace and defense company, for 13 years. While at Kaman, he led the company's portfolio reshaping, overseeing a significant increase in revenues. He was previously Chief Operating Officer at Hughes Supply, an industrial distribution business, until it was acquired by Home Depot in 2006, and Chief Executive Officer of GKN Aerospace, a global aerospace supplier, and a Board member for GKN plc, its parent. He also served as Board member for AgustaWestland, a helicopter design and manufacturing company.  Earlier in his career, he spent more than two decades at Rockwell Collins, an aerospace company, holding roles of increasing responsibility, including EVP and Chief Operating Officer, Commercial Systems. Mr. Keating is an experienced board member, and currently serves on the boards of Hubbell Inc., a publicly traded company, and Embry-Riddle Aeronautical University. Mr. Keating received a degree in electrical engineering from the University of Illinois and an MBA from the University of Chicago.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"We are pleased to welcome Neal to the TRIUMPH Board and are confident that his strong corporate governance background and his deep expertise in the aerospace and defense industry will make him a valuable board member,\" said Daniel J. Crowley, the Company's President, Chief Executive Officer & Chairman. \"As we focus on profitable growth as a recently streamlined organization, the addition of Neal will serve the Board and Company well.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"As a Board, we regularly consider our composition and prioritize board refreshment. The Board welcomes Neal's fresh perspective and expects his industry experience and business acumen to complement the existing skillsets on our board as we work to enhance value for all shareholders,\" said William L. Mansfield, the Company's Lead Independent Director.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"TRIUMPH, headquartered in Berwyn, Pennsylvania, designs, engineers, manufactures, repairs, and overhauls a broad portfolio of aerospace and defense systems and components. The company serves the global aviation industry, including original equipment manufacturers and the full spectrum of military and commercial aircraft operators.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Forward Looking Statements ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Statements in this release which are not historical facts are forward-looking statements under the provisions of the Private Securities Litigation Reform Act of 1995, including statements of expectations about the Company's operations and transformation in the future. All forward-looking statements involve risks and uncertainties which could affect the Company's actual results and could cause its actual results to differ materially from those expressed in any forward-looking statements made by, or on behalf of, the Company. Further information regarding the important factors that could cause actual results to differ from projected results can be found in Triumph Group's reports filed with the SEC, including our Annual Report on Form 10-K for the fiscal year ended March 31, 2020.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Widespread health developments, including the recent global coronavirus (COVID-19), and the responses thereto (such as voluntary and in some cases, mandatory quarantines as well as shut downs and other restrictions on travel and commercial, social and other activities) could adversely and materially affect, among other things, the economic and financial markets and labor resources of the countries in which we operate, our manufacturing and supply chain operations, commercial operations and sales force, administrative personnel, third-party service providers, business partners and customers and the demand for our products, which could result in a material adverse effect on our business, financial conditions and results of operations.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=PH35624&sd=2022-04-25","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/triumph-appoints-neal-j-keating-as-new-independent-director-301532349.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/triumph-appoints-neal-j-keating-as-new-independent-director-301532349.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  Triumph Group","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"img","src":"https://rt.prnewswire.com/rt.gif?NewsItemId=PH35624&Transmission_Id=202204251700PR_NEWS_USPR_____PH35624&DateId=20220425","alt":"","variations":[],"gated":false}]}