{"id":"20220414cn25503","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"iQIYI Announces Changes to Board Composition","publishedDate":"2022-04-14T04:00:00-05:00","body":[{"type":"text","content":"iQIYI Announces Changes to Board Composition\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"iQIYI Announces Changes to Board Composition","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"BEIJING, April 14, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"BEIJING, April 14, 2022 /PRNewswire/ -- iQIYI, Inc. (Nasdaq: IQ) (\"iQIYI\" or the \"Company\"), an innovative market-leading online entertainment service in China, today announced changes to its board composition. Mr. Conor Chia-hung Yang, has been appointed as an independent director of the board of directors (the \"Board\") and a member of its audit committee. Ms. Jane Jie Sun has resigned from the Board and the audit committee for personal reasons. These changes became effective today.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"We are delighted to welcome Conor to the Board,\" said Dr. Yu Gong, Founder, Director and Chief Executive Officer of iQIYI. \"We believe Conor's experience and expertise will provide significant value to iQIYI as we continue to execute our strategy to improve business efficiency. On behalf of the Board, I would also like to express my sincere gratitude to Jane for her incredible contribution to the Company during her tenure on the Board, and wish her well for the future.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Mr. Conor Chia-hung Yang has been the chief financial officer of TalkingData Group Holding Limited since December 2021. Prior to that, Mr. Yang was the co-founder and president of Black Fish Group Limited from 2017 to 2021. From 2007 to 2017, Mr. Yang served in several chief financial officer positions at US-listed companies including Tuniu Corporation (Nasdaq: TOUR), E-Commerce China Dangdang Inc., and AirMedia Group Inc. Mr. Yang was the chief executive officer of Rock Mobile Corporation from 2004 to 2007, and the chief financial officer of the Asia Pacific region for Cellstar Asia Corporation from 1999 to 2004.  Prior to that, Mr. Yang was a senior banker at Goldman Sachs (Asia) L.L.C., Lehman Brothers Asia Limited and Morgan Stanley Asia Limited from 1992 to 1999. Mr. Yang received his master's degree in business administration from the University of California, Los Angeles.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"About iQIYI, Inc.","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"iQIYI, Inc. is an innovative market-leading online entertainment service in China. Its corporate DNA combines creative talent with technology, fostering an environment for continuous innovation and the production of blockbuster content. We produce, aggregate and distribute a wide variety of professionally produced content, or PPC, as well as a broad spectrum of other video content in a variety of formats.  The Company distinguishes itself in the online entertainment industry by its leading technology platform powered by advanced AI, big data analytics and other core proprietary technologies. iQIYI attracts a massive user base with tremendous user engagement, and has developed a diversified monetization model including membership services, online advertising services, content distribution, online games, live broadcasting, IP licensing, talent agency, online literature, etc.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"Safe Harbor Statement","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This announcement contains forward-looking statements. These statements are made under the \"safe harbor\" provisions of the U.S. Private Securities Litigation Reform Act of 1995. These forward-looking statements can be identified by terminology such as \"will,\" \"expects,\" \"anticipates,\" \"future,\" \"intends,\" \"plans,\" \"believes,\" \"estimates,\" \"confident\" and similar statements. iQIYI may also make written or oral forward-looking statements in its periodic reports to the U.S. Securities and Exchange Commission, in its annual report to shareholders, in press releases and other written materials and in oral statements made by its officers, directors or employees to third parties. Statements that are not historical facts, including but not limited to statements about iQIYI's beliefs and expectations, are forward-looking statements. Forward-looking statements involve inherent risks and uncertainties, further information regarding which is included in the Company's filings with the Securities and Exchange Commission. All information provided in this press release is as of the date of the press release, and iQIYI undertakes no duty to update such information, except as required under applicable law.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"For further information, please contact:","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Investor Relations","gated":false},{"type":"br","gated":false},{"type":"text","content":"iQIYI, Inc.","gated":false},{"type":"br","gated":false},{"type":"text","content":"+ 86 10 8264 6585","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:ir@qiyi.com","contentObject":[{"type":"text","content":"ir@qiyi.com","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=CN25503&sd=2022-04-14","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/iqiyi-announces-changes-to-board-composition-301525633.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/iqiyi-announces-changes-to-board-composition-301525633.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  iQIYI, Inc.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"img","src":"https://rt.prnewswire.com/rt.gif?NewsItemId=CN25503&Transmission_Id=202204140500PR_NEWS_USPR_____CN25503&DateId=20220414","alt":"","variations":[],"gated":false}]}