{"id":"20220518519","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Next big shoe to drop in financial markets may still be ahead on inflation that fails to respond to Fed's rate hikes","publishedDate":"2022-05-18T12:25:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Vivien Lou Chen ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Traders, investors and strategists were adding one more factor to the list of reasons why financial markets may be in for more volatility through at least the next three to four months: the likelihood that Fed rate hikes won't put a dent in inflation by then.Wednesday's price action reflected the continued anxiety gripping the stock market, with all three major indexes sporting sharp losses. The Dow Jones Industrial Average  dropped nearly 1,000 points, while the S&P 500  fell over 3% amid a flight to safety in government bonds as investors reassessed Fed Chairman Jerome Powell's hawkish comments from Tuesday and his reassurance that there were plausible paths to a \"softish\" landing. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read: Why are stocks falling? Fragile 'bear market' bounce underlines investor jittersEquities had already been roiled in the past two weeks since the Fed's May 4 decision to deliver a 50 basis point hike, its biggest rate increase in 22 years. A day after the Fed's move, Dow industrials dropped almost 1,100 points and, along with the Nasdaq Composite Index , scored its worst daily percentage drop since 2020 on signs of panic selling on Wall Street. This year's selloff in stocks has left all three major indexes nursing double-digit losses.What has yet to be fully considered in financial markets is the notion that U.S. inflation, at 8.3% as of April but still near a four-decade high, may fail to respond to the Fed's rate hikes through this summer, according to traders, strategists and investors. Typically, it takes anywhere from six to nine months, and even up to two years, for rate hikes to work their way through the economy. But that policy lag may be lost on markets accustomed to years of easy money and growing more uneasy by the day. Though the Fed's effort to shrink its almost $9 trillion balance sheet adds an additional layer of tightening to financial conditions, it doesn't start until June 1.\"The meaningful impact of rate hikes will likely be felt toward the end of this year,\" said David Petrosinelli, a senior trader at InspereX in New York, which has underwritten more than $670 billion in securities. Meanwhile, the Fed is \"losing the room,\" or public confidence, \"pretty quickly because there's really no light at the end of the tunnel on inflation.\"\"We are in the first or second innings of market volatility because it's not just what the Fed is doing is, it's what the Fed is not doing,\" he said via phone, referring to the policy makers' decision to not begin shrinking its portfolio until next month. \"There's growing skepticism about Powell and the Fed's current game plan. The window or corridor for a soft landing is narrowing by the day, and there's a growing scenario in which inflation doesn't meaningfully abate during the next few months of Fed hikes.\"As of Wednesday, traders of derivatives-like instruments known as fixings were pricing in at least five more annual headline inflation rates above 8%, based on the consumer-price index reports for May through September. That's largely due to higher energy costs and reflects a notable shift from where expectations stood on May 6, when traders foresaw inflation starting to fall below 8% in June. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The table above reflects the projected gain in the annual headline CPI rate versus the year-earlier period. Five months of 8%-plus readings are now being penciled in, even though Powell reiterated on Tuesday that half a percentage point interest rate increases at both the Fed's June and July meetings remains the baseline case.Just two weeks ago, on May 6, traders expected inflation to fall below 8% sooner: ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In remarks made at a Wall Street Journal event on Tuesday, Powell sought to reassure the public that there are \"plausible paths\" to a \"softish\" landing for the economy, even if there may be some \"pain\" ahead. If necessary, he said, the Fed wouldn't hesitate to push rates past \"broadly understood levels of neutral\" --- or level at which policy neither boosts nor slows economic growth --- to bring down inflation. Powell said the Fed would keep raising rates until there was \"clear and convincing evidence\" that inflation was coming down. The fed-funds rate target currently stands at 0.75% to 1%.For now, financial markets are of four different minds when it comes to inflation, said Jim Vogel, an interest-rate strategist at FHN Financial in Memphis. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The bond market is \"leaning toward the idea of the Fed being successful, though it's uncertain about the timing.\" The stock market \"almost wishes the Fed isn't successful\" because of the idea that higher inflation can help some stocks outperform, Vogel said, in a phone interview. \"Commodities are confused\" and the forward inflation market \"is torn between a Fed that can be successful, but not for an extended period of time.\"The problem, he said, is that even if Fed rate hikes reduce demand \"on the margin,\" policy makers are \"going to be ineffective\" in addressing the following factors: Structural demand for workers; supply-chain disruptions from Russia's war on Ukraine and China's zero-tolerance policy on COVID-19; and the need by businesses to redirect their \"time, energy and money\" into regionalizing some of their investments and operations. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Those dynamics \"accelerate inflation in the short run, though inflation could resolve itself on its own over a longer term,\" Vogel told MarketWatch. Meanwhile, \"there's more room to run in the equities selloff as investors punish stocks with international exposure, and financial markets will be prone to bouts of illiquidity and mild panic.\"Regardless of which inflation outcome is correct, according to Vogel, the Treasury curve will keep flattening with some spreads, like the one between 3-  and 10-year rates  potentially inverting by as much as 20 to 30 basis points at some point. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Depending on how global geopolitical conditions play out this fall, \"we could be looking at an environment that easily lasts through 2023, with Fed policy being latent through the first half of 2024.\"Read:Wild swings in stocks and bonds offer taste of more volatility to come given the risk U.S. inflation keeps risingPetrosinelli of InspereX sees a chance that the 10-year rate could move toward 4%, from Wednesday's level around 2.91%, in the second or third quarter --- taking a bite out of tech stocks --- while the Treasury curve inverts again. As of afternoon trading, Treasury yields were lower as investors flocked to government bonds, shrinking the spread between 2- and 10-year rates to 24 basis points in a worrisome signal about the outlook. Walgreens Boots Alliance Inc. (WBA), Walmart Inc. (WMT), and The Home Depot Inc. (HD) were among the Dow's biggest losers, while shares of retailer Target Corp. (TGT)plunged more than 25% on Wednesday after it reported a big earnings miss amid deepening broad-based pessimism in markets.\"We're a little more optimistic about inflation peaking in the fall and see no recession happening in the U.S.,\" said Jay Hatfield, chief investment officer of Infrastructure Capital Advisors in New York, a manager of exchange-traded funds and hedge funds that oversees around $1.18 billion in assets. He sees the 10-year remaining around 3% and stocks staying rangebound.But in a non-base case scenario in which markets suspect that the Fed is ineffectual --- which he puts 20% to 30% odds on coming to fruition --- the 10-year rate could climb to as high as 3.5% or 4% and \"our estimate of the fair value on the S&P 500  would drop to 3,500\" from its current level near 3,959 on Wednesday, Hatfield said via phone. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Vivien Lou Chen ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-18-22 1325ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}