{"id":"20220402005035","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab Launches 112th Satellite to Orbit","publishedDate":"2022-04-02T09:33:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Launches 112th Satellite to Orbit\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab USA, Inc (Nasdaq: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Finvestors.rocketlabusa.com%2F&esheet=52642344&newsitemid=20220402005035&lan=en-US&anchor=RKLB&index=1&md5=528557652810c691ed4a0ea0ce5dab7d","contentObject":[{"type":"text","content":"RKLB","gated":false}],"gated":false},{"type":"text","content":"), a leading launch and space systems company, has successfully deployed two satellites to orbit for real-time geospatial intelligence company BlackSky (NYSE: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fir.blacksky.com%2F&esheet=52642344&newsitemid=20220402005035&lan=en-US&anchor=BKSY&index=2&md5=2cc502f590a0bc8b69d53680993675c2","contentObject":[{"type":"text","content":"BKSY","gated":false}],"gated":false},{"type":"text","content":"), bringing the total number of satellites deployed by Rocket Lab to 112.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release features multimedia. View the full release here: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220402005035/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220402005035/en/","gated":false}],"gated":false}],"gated":false},{"type":"div","contentObject":[{"type":"img","src":"https://mms.businesswire.com/media/20220402005035/en/1408940/4/Credit_Joseph_Baxter.jpg","alt":"Successful lift-off of the 'Without Mission A Beat' launch by Rocket Lab. (Photo: Business Wire)","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Successful lift-off of the 'Without Mission A Beat' launch by Rocket Lab. (Photo: Business Wire)","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe ‘Without Mission A Beat’ mission, arranged for BlackSky through global launch services provider Spaceflight Inc., was Electron’s 25","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"th","gated":false}],"gated":false},{"type":"text","content":" lift-off from Rocket Lab Launch Complex 1 on New Zealand’s Mahia Peninsula. Following lift-off at 12:41 UTC, April 2, Electron successfully delivered the pair of BlackSky Gen-2 Earth-imaging satellites to a circular 430km orbit, growing BlackSky’s constellation of real-time geospatial monitoring spacecraft to 14.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nBlackSky combines the power of its satellite constellation, that provides high-frequency monitoring of the most strategic and critical locations in the world, with its high-performance software platform, Spectra AI, to deliver real-time alerts, data, and information to decision-makers across a range of industries. BlackSky’s commissioning process for these latest two satellites is now underway to bring them into service as quickly as possible. The last pair of BlackSky satellites deployed by Rocket Lab began commercial operations and generated revenue within six days of launch.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nToday’s mission, in addition to three Rocket Lab launches for BlackSky and Spaceflight in 2021, is part of a multi-launch agreement that represents the largest number of satellites BlackSky has dedicated to a single launch provider to date. Rocket Lab is contracted to launch another pair of BlackSky satellites on a dedicated Electron mission scheduled for later this year.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab founder and CEO, Peter Beck, says: “Congratulations and welcome to space once again, BlackSky. The past few missions for BlackSky showcase the benefits of a dedicated launch on Electron: quick constellation expansion, streamlined access to space, and fast delivery of global insights to BlackSky customers. Rocket Lab is proud to play its part.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“The launch of these latest two satellites enhances our capacity-on-demand offering for customers,” said Nick Merski, BlackSky Chief Operations Officer. “We continue to build on our strategic intelligence advantage as we expand our constellation, ensuring commercial and our government customers are the first to know about the changes that matter most to them.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nDetails about Rocket Lab’s next mission will be announced shortly.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ Images & Video Content\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&esheet=52642344&newsitemid=20220402005035&lan=en-US&anchor=www.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&index=3&md5=f3f0f111656bebd11a3d6924411a1597","contentObject":[{"type":"text","content":"www.rocketlabusa.com/about-us/updates/link-to-rocket-lab-imagery-and-video/","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ ABOUT ROCKET LAB\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 2006, Rocket Lab is an end-to-end space company with an established track record of mission success. We deliver reliable launch services, spacecraft components, satellites and other spacecraft and on-orbit management solutions that make it faster, easier and more affordable to access space. Headquartered in Long Beach, California, Rocket Lab designs and manufactures the Electron small orbital launch vehicle and the Photon satellite platform and is developing the Neutron 8-ton payload class launch vehicle. Since its first orbital launch in January 2018, Rocket Lab’s Electron launch vehicle has become the second most frequently launched U.S. rocket annually and has delivered 112 satellites to orbit for private and public sector organizations, enabling operations in national security, scientific research, space debris mitigation, Earth observation, climate monitoring, and communications. Rocket Lab’s Photon spacecraft platform has been selected to support NASA missions to the Moon and Mars, as well as the first private commercial mission to Venus. Rocket Lab has three launch pads at two launch sites, including two launch pads at a private orbital launch site located in New Zealand, one of which is currently operational, and a second launch site in Virginia, USA which is expected to become operational in 2022. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com&esheet=52642344&newsitemid=20220402005035&lan=en-US&anchor=www.rocketlabusa.com&index=4&md5=7b3eefa62e156f14f7c890b210bbce96","contentObject":[{"type":"text","content":"www.rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ FORWARD LOOKING STATEMENTS\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release may contain certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are based on Rocket Lab’s current expectations and beliefs concerning future developments and their potential effects. These forward-looking statements involve a number of risks, uncertainties (many of which are beyond Rocket Lab’s control), or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including risks related to the global COVID-19 pandemic; risks related to government restrictions and lock-downs in New Zealand and other countries in which we operate that could delay or suspend our operations; delays and disruptions in expansion efforts; our dependence on a limited number of customers; the harsh and unpredictable environment of space in which our products operate which could adversely affect our launch vehicle and spacecraft; increased congestion from the proliferation of low Earth orbit constellations which could materially increase the risk of potential collision with space debris or another spacecraft and limit or impair our launch flexibility and/or access to our own orbital slots; increased competition in our industry due in part to rapid technological development and decreasing costs; technological change in our industry which we may not be able to keep up with or which may render our services uncompetitive; average selling price trends; failure of our launch vehicles, spacecraft and components to operate as intended either due to our error in design in production or through no fault of our own; launch schedule disruptions; supply chain disruptions, product delays or failures; design and engineering flaws; launch failures; natural disasters and epidemics or pandemics; changes in governmental regulations including with respect to trade and export restrictions, or in the status of our regulatory approvals or applications; or other events that force us to cancel or reschedule launches, including customer contractual rescheduling and termination rights; risks that acquisitions may not be completed on the anticipated time frame or at all or do not achieve the anticipated benefits and results; and the other risks detailed from time to time in Rocket Lab’s filings with the Securities and Exchange Commission (the “SEC”), including under the heading “Risk Factors” in Rocket Lab’s Annual Report on Form 10-K for the fiscal year ended December 31, 2021, which was filed with the SEC on March 24, 2022, and elsewhere (including that the impact of the COVID-19 pandemic may also exacerbate the risks discussed therein). There can be no assurance that the future developments affecting Rocket Lab will be those that we have anticipated. Except as required by law, Rocket Lab is not undertaking any obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220402005035r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ Rocket Lab Media Contact\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Murielle Baker\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"+64 27 538 9040\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220402005035/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220402005035/en/","gated":false}],"gated":false}],"gated":false}]}