{"id":"20220321005832","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab to Launch Three Demonstration Satellites for E-Space","publishedDate":"2022-03-21T15:15:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab to Launch Three Demonstration Satellites for E-Space\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe launch is the first step in validating the technology behind E-Space’s mesh network of secure communication satellites designed to make space affordable and accessible\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab USA, Inc. (“Rocket Lab” or the “Company”) (Nasdaq: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Finvestors.rocketlabusa.com%2F&esheet=52608833&newsitemid=20220321005832&lan=en-US&anchor=RKLB&index=1&md5=4f6f7ce63c9b3367012f7e388ebe8dba","contentObject":[{"type":"text","content":"RKLB","gated":false}],"gated":false},{"type":"text","content":"), a global leader in launch services, space systems and space solar power products, announced today it will launch three demonstration satellites for ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.e-space.com%2F&esheet=52608833&newsitemid=20220321005832&lan=en-US&anchor=E-Space&index=2&md5=122cd0347479a82b17ab640faae73d1c","contentObject":[{"type":"text","content":"E-Space","gated":false}],"gated":false},{"type":"text","content":", to validate the systems and technology for its satellite system.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe satellites are scheduled to fly as part of a rideshare mission on Rocket Lab’s Electron launch vehicle from Launch Complex 1 Pad A on New Zealand’s Mahia Peninsula expected in the second quarter of 2022.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nE-Space aims to reduce the launch requirements for a full constellation to months instead of years — decreasing the time it takes to scale, replenish or deliver a full system. E-Space’s system aims to allow governments and companies to own private satellite constellations that can dynamically scale in capabilities, with applications ranging from secure communications to managing remote infrastructure, while maintaining a high level of security, flexibility and resiliency.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“Our first satellites will provide a demonstration and test platform for our new sustainable satellite system,” said Greg Wyler, founder and CEO of E-Space. “E-Space will increase the speed for constellation delivery from years to months, allowing new opportunities for more people to access space-based platforms. With the help of Rocket Lab, we are excited to be bringing these satellites into orbit in record time.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“We’re excited to partner with E-Space on their first mission,” said Rocket Lab founder and CEO, Peter Beck. “Innovation is the key to success in space, and E-Space’s commitment to reducing the time it takes to create a constellation or satellies, while maintaining affordability and accessibilty falls in line with our own values at Rocket Lab, as we have done with Electron, the leading small launch vehicle. We wish them enomous success in their mission with us.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ Images & Video Content\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&esheet=52608833&newsitemid=20220321005832&lan=en-US&anchor=www.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&index=3&md5=b3b7ed03bddd7db65dedfb1fb5b1ac0c","contentObject":[{"type":"text","content":"www.rocketlabusa.com/about-us/updates/link-to-rocket-lab-imagery-and-video/","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ About Rocket Lab\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 2006, Rocket Lab is an end-to-end space company with an established track record of mission success. We deliver reliable launch services, spacecraft components, satellites and other spacecraft and on-orbit management solutions that make it faster, easier and more affordable to access space. Headquartered in Long Beach, California, Rocket Lab designs and manufactures the Electron small orbital launch vehicle and the Photon satellite platform and is developing the Neutron 8-ton payload class launch vehicle. Since its first orbital launch in January 2018, Rocket Lab’s Electron launch vehicle has become the second most frequently launched U.S. rocket annually and has delivered 110 satellites to orbit for private and public sector organizations, enabling operations in national security, scientific research, space debris mitigation, Earth observation, climate monitoring, and communications. Rocket Lab’s Photon spacecraft platform has been selected to support NASA missions to the Moon and Mars, as well as the first private commercial mission to Venus. Rocket Lab has three launch pads at two launch sites, including two launch pads at a private orbital launch site located in New Zealand, and a second launch site in Virginia, USA which is expected to become operational in 2022. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com&esheet=52608833&newsitemid=20220321005832&lan=en-US&anchor=www.rocketlabusa.com&index=4&md5=fea0a6cc087a940a0576d0b32b0e5f39","contentObject":[{"type":"text","content":"www.rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ About E-Space\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nVirginia E-Space is democratizing space with a mesh network of secure multi-application satellites that empowers businesses and governments to access the power of space to solve problems on Earth. Founded by industry pioneer, Greg Wyler, E-Space provides satellite constellation deployments with higher capabilities and lower cost to enable a new generation of services and applications, from 5G communications to command and control systems. The company puts sustainability at the forefront, with a purposeful design that minimizes and reduces debris and destruction while preserving access to space for future generations. Learn more at ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.e-space.com%2F&esheet=52608833&newsitemid=20220321005832&lan=en-US&anchor=e-space.com&index=5&md5=8b25871109dcf57893b1b96c49e8b93e","contentObject":[{"type":"text","content":"e-space.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ Forward-looking statements\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release may contain certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements are based on Rocket Lab’s current expectations and beliefs concerning future developments and their potential effects. These forward-looking statements involve a number of risks, uncertainties (many of which are beyond Rocket Lab’s control), or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including risks related to the global COVID-19 pandemic; risks related to government restrictions and lock-downs in New Zealand and other countries in which we operate that could delay or suspend our operations; delays and disruptions in expansion efforts; our dependence on a limited number of customers; the harsh and unpredictable environment of space in which our products operate which could adversely affect our launch vehicle and spacecraft; increased congestion from the proliferation of low Earth orbit constellations which could materially increase the risk of potential collision with space debris or another spacecraft and limit or impair our launch flexibility and/or access to our own orbital slots; increased competition in our industry due in part to rapid technological development and decreasing costs; technological change in our industry which we may not be able to keep up with or which may render our services uncompetitive; average selling price trends; failure of our launch vehicles, satellites and components to operate as intended either due to our error in design in production or through no fault of our own; launch schedule disruptions; supply chain disruptions, product delays or failures; design and engineering flaws; launch failures; natural disasters and epidemics or pandemics; changes in governmental regulations including with respect to trade and export restrictions, or in the status of our regulatory approvals or applications; or other events that force us to cancel or reschedule launches, including customer contractual rescheduling and termination rights; risks that acquisitions may not be completed on the anticipated time frame or at all or do not achieve the anticipated benefits and results; and the other risks detailed from time to time in Rocket Lab’s filings with the Securities and Exchange Commission (the “SEC”), including under the heading “Risk Factors” in the prospectus dated October 7, 2021 related to our Registration Statement on Form S-1 (File No. 333-259757), which was filed with the Securities and Exchange Commission pursuant to Rule 424(b) on October 7, 2021 and elsewhere (including that the impact of the COVID-19 pandemic may also exacerbate the risks discussed therein). There can be no assurance that the future developments affecting Rocket Lab will be those that we have anticipated. Except as required by law, Rocket Lab is not undertaking any obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220321005832r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Media Contact\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Michael Atchue\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220321005832/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220321005832/en/","gated":false}],"gated":false}],"gated":false}]}