{"id":"20211022397","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"BJ's Restaurants has cut items from its menu and limited dining room capacity due to staffing shortages","publishedDate":"2021-10-22T07:47:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  BJ's Restaurants Inc. (BJRI) Chief Executive Greg Levin said in a third-quarter earnings statement that staffing shortages have driven the company to shorten its menu, cut dining room capacity and cut hours in certain locations. \"As a result, we finished the third quarter with comparable restaurant sales down 0.5%, compared to the same period in 2019,\" he said. \"Looking forward, as our staffing levels improve, we expect sales to benefit as we seat more tables, expand back to pre-pandemic hours, and return all of our restaurants to full menus by early November.\" BJ's reported a net loss of $2.2 million, or 9 cents per share, after a loss of $6.6 million, or 30 cents per share, last year. Revenue of $282.2 million was up from $198.9 million last year. The FactSet consensus was for earnings of 8 cents per share and revenue of $292.3 million. Comparable restaurant sales grew 41.8%, below the 44.2% FactSet consensus. Comparable sales were down 0.5% compared with the the same period in 2019. BJ's plans to open eight restaurants in 2022. BJ's stock slipped 0.5% in Friday premarket trading, and is down 8.7% for the year to date. The S&P 500 index  has gained 21.1% for the period. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tonya Garcia ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  10-22-21 0847ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2021 Dow Jones & Company, Inc.","gated":false}]}