{"id":"8543355","sourceId":"globe-newswire","sourceName":"GlobeNewswire","providerName":"GlobeNewswire","title":"Carlyle to Acquire ManTech in All-Cash Transaction Valued at Approximately $4.2 Billion","publishedDate":"2022-05-16T07:00:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"HERNDON, Va., May  16, 2022  (GLOBE NEWSWIRE) -- ManTech International Corporation (Nasdaq: MANT) (“ManTech” or the “Company”), a leading provider of innovative technologies and solutions for mission-critical national security programs, today announced that it has entered into a definitive agreement to be acquired by funds managed by global investment firm Carlyle (NASDAQ: CG) in an all-cash transaction with a total enterprise value of approximately $4.2 billion.","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Under the terms of the transaction, ManTech shareholders will receive $96.00 per share in cash, which represents a 32% premium to ManTech’s unaffected closing share price of $72.82 on February 2, 2022, the last trading day prior to published media reports regarding a potential strategic process for the Company, and a 17% premium to the closing stock price of $81.97 on May 13, 2022.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"“We have always admired ManTech’s unwavering commitment to support national security customers and their critical missions through differentiated capabilities and technology solutions. ManTech’s talented employees and leadership team have built a remarkable Company with strong market positions across the federal government,” said Dayne Baird, a Managing Director on Carlyle’s Aerospace & Government Services team. “Through this partnership, we look forward to leveraging our sector expertise and resources to accelerate growth and innovation and to drive greater value for customers and employees.”","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"“This announcement is an important milestone for ManTech and a testament to our growth and the leadership position we have built since our founding by George Pedersen more than 50 years ago,” said ManTech Chairman, Chief Executive Officer and President Kevin M. Phillips. “Following a comprehensive review of strategic alternatives, our Board determined that this transaction is in the best interest of our shareholders and provides them with the most compelling value maximization outcome, offering liquidity at a significant premium. We look forward to leveraging Carlyle’s deep knowledge and experience investing in and growing companies, as we deliver stronger outcomes for our customers and increased opportunities for our employees.”","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Transaction Details","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The transaction was unanimously approved by ManTech’s Board of Directors, which recommends that ManTech shareholders vote in favor of the transaction. The transaction is expected to close in the second half of calendar 2022, subject to approval by ManTech shareholders, receipt of regulatory approvals and other customary closing conditions.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Stockholders holding shares of common stock representing 49.2% of the current outstanding voting power of the ManTech common stock have entered into a voting agreement pursuant to which they have agreed, among other things, to vote their shares of common stock in favor of the transaction, subject to certain conditions. ","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Advisors","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Goldman Sachs & Co. LLC is serving as exclusive financial advisor and King & Spalding LLP is serving as legal counsel to ManTech in connection with the transaction.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Robert W. Baird & Co. is serving as financial advisor and Latham & Watkins LLP is serving as legal advisor to Carlyle in connection with the transaction.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"About ManTech International Corporation","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"ManTech provides mission-focused technology solutions and services for U.S. defense, intelligence and federal civilian agencies. In business for more than 53 years, we excel in full-spectrum cyber, data collection & analytics, enterprise IT, systems engineering and software application development solutions that support national and homeland security. Additional information on ManTech can be found at ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=6DVniDJ0D7ixZV5dLiD0kN7QdpoFSVCwi-MoK2Sfv-K7njs3tmN94a5n_nHw1CEw_9cOSo4uXSsRmTOgaXPecg==","contentObject":[{"type":"text","content":"www.mantech.com","gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"About Carlyle ","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Carlyle (NASDAQ: CG) is a global investment firm with deep industry expertise that deploys private capital across three business segments: Global Private Equity, Global Credit and Global Investment Solutions. With $325 billion of assets under management as of March 31, 2022, Carlyle’s purpose is to invest wisely and create value on behalf of its investors, portfolio companies and the communities in which we live and invest. Carlyle employs nearly 1,900 people in 26 offices across five continents. Further information is available at ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=xC7OSRjN-R49kouT3FFjoR-joaMg2Eov9RZ6mwlKZmRYbJn1E7X3RMOkPWkhTMJ4V9lRQwB3jlFZGUiwLUKFxw==","contentObject":[{"type":"text","content":"www.carlyle.com","gated":false}],"gated":false},{"type":"text","content":". Follow Carlyle on Twitter @OneCarlyle.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Additional Information about the Acquisition and Where to Find It","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"This communication is being made in respect of the proposed transaction involving ManTech International Corporation (“ManTech”) and Carlyle. A meeting of the stockholders of ManTech will be announced as promptly as practicable to seek stockholder approval in connection with the proposed Merger. ManTech expects to file with the Securities and Exchange Commission (“SEC”) a proxy statement and other relevant documents in connection with the proposed Merger. The definitive proxy statement will be sent or given to the stockholders of ManTech and will contain important information about the proposed Merger and related matters. STOCKHOLDERS OF MANTECH ARE URGED TO READ THE DEFINITIVE PROXY STATEMENT AND OTHER RELEVANT MATERIALS CAREFULLY AND IN THEIR ENTIRETY WHEN THEY BECOME AVAILABLE BECAUSE THEY WILL CONTAIN IMPORTANT INFORMATION ABOUT MANTECH AND THE MERGER. Investors may obtain a free copy of these materials (when they are available) and other documents filed by ManTech with the SEC at the SEC’s website at ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=nG92DFDqjaG4e1bXYsKjyNaiLRtrba9vT-AdB7BF4DNiczL4jmp0BTlcT4367T6NeVv3MTleZkRchaSbpu6A3w==","contentObject":[{"type":"text","content":"www.sec.gov","gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"ManTech and certain of its directors, executive officers and other members of management and employees may be deemed to be participants in soliciting proxies from its stockholders in connection with the Merger. Information regarding the persons who may, under the rules of the SEC, be considered to be participants in the solicitation of ManTech’s stockholders in connection with the proposed transaction will be set forth in ManTech’s definitive proxy statement for its stockholder meeting at which the proposed transaction will be submitted for approval by ManTech’s stockholders. You may also find additional information about ManTech’s directors and executive officers in ManTech’s definitive proxy statement for its 2022 Annual Meeting of Stockholders, which was filed with the SEC on April 29, 2022, and in subsequently filed Current Reports on Form 8-K and Quarterly Reports on Form 10-Q.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Cautionary Statement Regarding Forward-Looking Statements","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This communication contains certain forward-looking statements concerning ManTech and the proposed transaction between ManTech and Carlyle. All statements other than statements of fact, including information concerning future results, are forward-looking statements. These forward-looking statements are generally identified by the words “anticipate,” “believe,” “estimate,” “expect,” “intend,” “may,” “could” or similar expressions. Such forward-looking statements include, but are not limited to, the inability to obtain required regulatory approvals or satisfy other conditions to the closing of the proposed transaction; unexpected costs, liabilities or delays in connection with the proposed transaction; the occurrence of any event, change or other circumstances that could give rise to the termination of the transaction; the significant transaction costs associated with the proposed transaction and other risks that may imperil the consummation of the proposed transaction, which may result in the transaction not being consummated within the expected time period or at all; negative effects of the announcement, pendency or consummation of the transaction on the market price of ManTech’s common stock or operating results, including as a result of changes in key customer, supplier, employee or other business relationships; the risk of litigation or regulatory actions; the inability of ManTech to retain and hire key personnel; the risk that certain contractual restrictions contained in the business combination agreement during the pendency of the proposed transaction could adversely affect ManTech’s ability to pursue business opportunities or strategic transactions; and failure to maintain ManTech’s relationship with the U.S. government, or the failure to compete effectively for new contract awards or to retain existing U.S. government contracts during the pendency of the transaction.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Forward-looking statements are based on current expectations and assumptions, which are subject to risks and uncertainties that may cause actual results to differ materially from those expressed in or implied by such forward-looking statements. Given these risks and uncertainties, persons reading this communication are cautioned not to place undue reliance on such forward-looking statements. ManTech assumes no obligation to update or revise the information contained in this communication (whether as a result of new information, future events or otherwise), except as required by applicable law.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Contacts:","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"table","contentObject":[{"type":"tbody","contentObject":[{"type":"tr","contentObject":[{"type":"td","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"ManTech Investor Relations","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Stephen Vather","gated":false},{"type":"br","gated":false},{"type":"text","content":"VP, M&A and Investor Relations","gated":false},{"type":"br","gated":false},{"type":"text","content":"(703) 218-6093","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:Stephen.Vather@ManTech.com","contentObject":[{"type":"text","content":"Stephen.Vather@ManTech.com","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"br","gated":false},{"type":"strong","contentObject":[{"type":"text","content":"Carlyle","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Brittany Berliner","gated":false},{"type":"br","gated":false},{"type":"text","content":"(202) 813-4839","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:Brittany.Berliner@Carlyle.com","contentObject":[{"type":"text","content":"Brittany.Berliner@Carlyle.com","gated":false}],"gated":false},{"type":"br","gated":false}],"gated":false},{"type":"td","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"ManTech Media","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Sheila Blackwell","gated":false},{"type":"br","gated":false},{"type":"text","content":"VP, Enterprise Marketing & Communications","gated":false},{"type":"br","gated":false},{"type":"text","content":"(301) 717-7345","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:Sheila.Blackwell@ManTech.com","contentObject":[{"type":"text","content":"Sheila.Blackwell@ManTech.com","gated":false}],"gated":false},{"type":"br","gated":false}],"gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"img","src":"https://www.globenewswire.com/newsroom/ti?nf=ODU0MzM1NSM0OTE5MjgyIzIwMTA2MTg=","alt":"","variations":[],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"img","src":"https://ml.globenewswire.com/media/MDZjNWFiMTItYjA5Mi00NzZiLWFmZGEtNzYyNGM4MTk3MGFjLTEwMjIxOTE=/tiny/ManTech-International-Corporat.png","alt":"","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"a","href":"https://www.globenewswire.com/NewsRoom/AttachmentNg/d9d1bb24-03f1-4641-a352-8c75777d6348","contentObject":[{"type":"img","src":"https://ml.globenewswire.com/media/d9d1bb24-03f1-4641-a352-8c75777d6348/small/mantech-logo-jpg.jpg","alt":"Primary Logo","variations":[],"gated":false}],"gated":false}],"gated":false}]}