{"id":"20220427ln36931","sourceId":"pr-newswire","sourceName":"PR Newswire","providerName":"PR Newswire","title":"Klarna and Global-e expand global partnership to Canada","publishedDate":"2022-04-27T06:00:00-05:00","body":[{"type":"text","content":"Klarna and Global-e expand global partnership to Canada\n\n\n\n\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"h1","contentObject":[{"type":"text","content":"Klarna and Global-e expand global partnership to Canada","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PR Newswire","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"TORONTO and NEW YORK, April 27, 2022","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n\n","gated":false},{"type":"div","contentObject":[{"type":"text","content":"\n\n","gated":false},{"type":"p","contentObject":[{"type":"i","contentObject":[{"type":"text","content":"Global-e's international retail partners can now offer Klarna's alternative payment options to consumers across 15 markets including Canada, US, UK, Europe, Australia, and beyond","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"TORONTO and NEW YORK , April 27, 2022 /PRNewswire/ -- ","gated":false},{"type":"u","contentObject":[{"type":"a","href":"http://www.klarna.com/","contentObject":[{"type":"text","content":"Klarna","gated":false}],"gated":false}],"gated":false},{"type":"text","content":", a leading global retail bank, payments, and shopping service, announced today its expanded partnership with leading cross-border e-commerce provider ","gated":false},{"type":"u","contentObject":[{"type":"a","href":"https://www.global-e.com/en/","contentObject":[{"type":"text","content":"Global-e","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" (Nasdaq: GLBE). Through this partnership, merchants selling to Canada via Global-e's cross-border e-commerce platform, including notable brands such as Reformation, SKIMS, Fenty Beauty, Rimowa, Versace, Marc Jacobs, and Marks & Spencer, can now offer consumers Klarna's flexible payment options.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"Consumers worldwide are demanding smarter ways to pay, and this sentiment also extends to Canada, where, according to our research, at least half of shoppers between the ages of 25 and 56 look for flexible payment options at checkout,\" said Kristina Elkhazin, Head of Canada, Klarna. \"By expanding Klarna's successful partnership with Global-e to Canada, we look forward to providing Canadian consumers with greater choice and flexibility at checkout, while in turn, driving growth on behalf of our shared retail partners through an enhanced online shopping experience and access to our network of more than 147 million shoppers worldwide.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Klarna's suite of alternative payment solutions, including its popular interest-free \"Pay in 4\" service, is now available to retailers selling in Canada via Global-e's cross-border e-commerce platform. Global-e's international merchant network can now seamlessly offer Klarna across 15 core markets including Canada, the United States, France, Spain, Italy, the United Kingdom, Australia, the Netherlands, Denmark, Norway, Sweden, Finland, Germany, Belgium, and Austria, to further enhance their offering of a localized online shopping experience.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\"We are thrilled to expand our already successful partnership with Klarna to enable merchants to provide streamlined and flexible payment options to Canadian consumers,\" said Shahar Tamari, Co-founder, and COO at Global-e. \"Offering such flexibility to shoppers has proven to have a substantially positive impact on a retailer's average order value and customer return rate. We look forward to our continued collaboration with Klarna to empower merchants in providing localized shopping solutions, including payments, to consumers in key markets across the globe.\"","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Global-e's end-to-end, localized cross-border e-commerce platform allows merchants to tailor the online shopping experience to the preferences and behaviours of shoppers in different markets to accelerate online sales and conversions. This includes local pricing in more than 100 currencies, a seamless localized checkout experience supported in over 30 languages, express shipping at attractive rates including various propositions such as free shipping over a specified threshold, a transparent and easy returns process, and a guaranteed landed cost of their purchase, including pricing inclusive of all import duties and taxes, or option of prepayment at checkout, according to local market best practices.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"About Klarna","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Since 2005 Klarna has been on a mission to revolutionize the retail banking industry.  Over 400,000 global retail partners, including H&M, Saks, Sephora, Macys, IKEA, Expedia Group, and Nike have integrated Klarna's innovative technology to deliver a seamless shopping experience online and in-store. With over 5,000 employees, Klarna is active in 45 markets and is one of the most highly-valued private fintechs globally, with a valuation of $45.6 billion. For more information, visit ","gated":false},{"type":"a","href":"https://www.klarna.com/","contentObject":[{"type":"text","content":"Klarna.com","gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"About Global-e","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Global-e (Nasdaq: GLBE) is the world's leading platform enabling and accelerating global, direct-to-consumer cross-border e-commerce. The chosen partner of hundreds of brands and retailers across the United States, Europe and Asia, Global-e makes selling internationally as simple as selling domestically. The company enables merchants to increase the conversion of international traffic into sales by offering online shoppers in over 200 destinations worldwide a seamless, localized shopping experience. Global-e's end-to-end e-commerce solutions combine best-in-class localization capabilities, big-data best-practice business intelligence models, streamlined international logistics and vast cross-border experience, enabling international shoppers to buy seamlessly online and retailers to sell from, and to, anywhere in the world. For more information, please visit: ","gated":false},{"type":"u","contentObject":[{"type":"a","href":"http://www.global-e.com/","contentObject":[{"type":"text","content":"www.global-e.com","gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Forward-looking Statements","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Certain statements in this press release may constitute \"forward-looking\" statements and information, within the meaning of Section 27A of the Securities Act of 1933, Section 21E of the Securities Exchange Act of 1934, and the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. These forward-looking statements, which involve known and unknown risks, uncertainties, and other factors that may cause actual results, performance, or achievements to be materially different from any future results, performance, or achievements expressed or implied by such forward-looking statements. These factors include, but are not limited to: failure to retain our existing merchants, or the gross merchandize value (GMV) generated by such merchants; failure to attract new merchants, or the merchants we do attract fail to generate GMV or revenue comparable to our current merchants; failure to develop or acquire new functionality or enhance our existing platform; failure to successfully compete against current and future competition; failure to integrate our platform with third-party e-commerce platforms; failure to maintain the functionality of our platform; failure to manage our growth effectively; risks associated with cross-border sales and operations; risks associated with the seasonal fluctuations of our business; risks associated with governmental export controls; the compromise of personal information of our merchants and shoppers we store; failure to enhance our reputation and awareness of our platform; diminished demand for our platform and services as a result of changes in laws and regulations; actual or perceived failure to comply with stringent and changing laws, regulations, standards and contractual obligations related to privacy, data protection and data security; failure to adequately maintain, protect or enforce our intellectual property rights; risks related to the COVID-19 pandemic; and other factors discussed under the heading \"Risk Factors\" in our prospectus related to our initial public offering, filed with the Securities and Exchange Commission (\"SEC\") on May 13, 2021 and other documents filed with or furnished to the SEC. When used in this press release, such statements include such words as \"may,\" \"will,\" \"expect,\" \"believe,\" \"plan,\" and other similar terminology. These statements reflect management's current expectations regarding future events and operating performance and speak only as of the date of this document. Other than as required by law, there should not be an expectation that such information will in all circumstances be updated, supplemented, or revised whether as a result of new information, changing circumstances, future events, or otherwise.","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"For Global-e:","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Headline Media","gated":false},{"type":"br","gated":false},{"type":"text","content":"Garrett Krivicich","gated":false},{"type":"br","gated":false},{"type":"u","contentObject":[{"type":"a","href":"mailto:Globale@headline.media","contentObject":[{"type":"text","content":"Globale@headline.media","gated":false}],"gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"+1 786-233-7684","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"b","contentObject":[{"type":"text","content":"For Klarna:","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"Adaline Colton ","gated":false},{"type":"br","gated":false},{"type":"u","contentObject":[{"type":"a","href":"mailto:press.us@klarna.com","contentObject":[{"type":"text","content":"press.us@klarna.com","gated":false}],"gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"+1 (614) 687-9357","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://c212.net/c/img/favicon.png?sn=LN36931&sd=2022-04-27","alt":"Cision","variations":[],"gated":false},{"type":"text","content":" View original content:","gated":false},{"type":"a","href":"https://www.prnewswire.com/news-releases/klarna-and-global-e-expand-global-partnership-to-canada-301534049.html","contentObject":[{"type":"text","content":"https://www.prnewswire.com/news-releases/klarna-and-global-e-expand-global-partnership-to-canada-301534049.html","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"SOURCE  Global-e","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false}]}