{"id":"20220518613","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"30-year Treasury yield has biggest drop in a month as U.S. stocks finish sharply lower","publishedDate":"2022-05-18T15:31:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Vivien Lou Chen and William Watts ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Treasury yields fell across the board on Wednesday, as investors turned pessimistic on signs that inflation is taking a toll on corporate earnings and as they reassessed Federal Reserve Chairman Jerome Powell's hawkish remarks from late Tuesday.  The 30-year rate dropped by the most in a month and Dow industrials finished 1,164.52 points lower. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  What Treasury yields are doing ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  What's driving the market ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Treasury yields fell sharply on Wednesday amid a plunge in all three major U.S. stock indexes, on fears that higher costs are eroding corporate profits. The S&P 500 and Nasdaq Composite finished down by 4% and 4.7%, respectively.Consumer sectors bore the brunt of the equity selloff after Target Corp. (TGT) reported earnings far short of expectations. At the heart of the financial market's deepening pessimism was the idea that multiple shocks may be developing that could curtail growth and push the economy into a recession this year. Meanwhile, investors also re-evaluated hawkish comment delivered by Powell on Tuesday.  Speaking at a Wall Street Journal event Tuesday, Powell said that the Fed would keep raising interest rates until there was \"clear and convincing evidence\" that inflation was coming down. He said that, if necessary, the Fed wouldn't hesitate to push rates past \"broadly understood levels of neutral\" to bring down inflation. The neutral rate is the level at which policy neither boosts nor slows economic growth. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Powell reiterated that half a percentage point interest rate hike at both the June and July meeting remained the baseline case. The Fed chief said there may be some \"pain\" ahead in terms of slower growth or higher unemployment but that there remained \"plausible paths\" to a \"softish\" landing for the economy. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Data released on Wednesday showed U.S. housing starts dipped 0.2% to an annual pace of 1.72 million last month --- suggesting that rising mortgage rates, record home prices, and the high cost of building materials are starting to bite. Economists polled by MarketWatch had expected housing starts to register a 1.75 million rate after factoring in typical seasonal swings in demand. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The number of permits, meanwhile, slipped 3.2% to a 1.82 million rate. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  What analysts say ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The economy might manage through any one of the inflation or policy shocks, but the rapid convergence of multiple shocks has reached a point where we expect a contraction in U.S. GDP growth for a few quarters, starting later this year andcarrying into the second quarter of 2023,\" according to a note released Wednesday by Wells Fargo Investment Institute. The institute said its base case is for a \"mild\" contraction. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Vivien Lou Chen ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-18-22 1631ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}