{"id":"20220512618","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Biden administration unveils actions to address baby-formula shortage","publishedDate":"2022-05-12T14:17:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  The Biden administration on Thursday rolled out measures to address an ongoing U.S. baby-formula shortage, with the steps including one aimed at WIC, which is the federal government's Special Supplemental Nutrition Program for Women, Infants and Children. The administration is \"urging states to allow WIC recipients to use their WIC benefits on a wider variety of products so that if certain sizes or types of formula are out of stock, they can use their benefits on those that are in stock,\" the White House said in a statement. In addition, the U.S. Department of Agriculture is \"urging states to relax their requirements that stores keep a certain amount of formula in stock,\" in an effort to \"offer relief to retailers and allow companies to manage inventories to meet demand,\" the statement said. The Biden administration is also calling on the Federal Trade Commission and state attorneys general to crack down on \"any price gouging or unfair market practices,\" the statement said. And the Food and Drug Administration \"will, in the coming days, announce specific new steps it is taking concerning importing certain infant formula products from abroad.\" The White House said Biden spoke earlier Thursday with retailers and manufacturers of infant formula, including the CEOs of Walmart (WMT), Target (TGT), Nestle (NESN.EB) subsidiary Gerber and Reckitt (RKT.LN) subsidiary Mead Johnson. Biden administration officials also emphasized that more formula has been produced in the last four weeks than in the four weeks preceding a big recall involving an Abbott plant. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Victor Reklaitis ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-12-22 1517ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}