{"id":"20220516270","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Walmart to pilot program aimed at putting new college grads on the path to a $210,000 salary","publishedDate":"2022-05-16T11:22:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Walmart Inc. (WMT) said Monday that it is piloting the College2Career program this summer, which will focus on putting new college grads on a career path with the retail giant. College graduates and college students within a year of graduation are eligible. The program offers training, classwork and mentorship leading to a newly-created management position, emerging coach, which pays $65,000 per year. This role is seen as a stop along the route to the store manager position, which pays $210,000. \"With College2Career, we are aiming to move emerging coaches to store managers within two years,\" wrote Amy Goldfinger, senior vice president of Global Talent & Workforce Strategy and Lorraine Stomski, senior vice president of Learning & Leadership in a joint post on the company website. Walmart says 75% of its salaried store, club and supply chain management in the U.S. started in an hourly wage position. Walmart is scheduled to report first-quarter earnings before the Tuesday opening bell. Walmart stock has run up 10.8% over the last three months. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tonya Garcia ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-16-22 1222ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}