{"id":"20220516312","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"IQIYI stock soars after J.P. Morgan swings to bullish from bearish, quadruples price target","publishedDate":"2022-05-16T12:55:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Shares of iQIYI Inc. (IQ) soared 17.7% in afternoon trading Monday, after a double upgrade by J.P. Morgan analyst Alex Yao to buy from underweight, saying the China-based streaming-video company is a beneficiary of a new paradigm surrounding China's long-form video industry, in which major platforms switch focus to profitability from expansion. Yao multiplied his stock price target by four, to $8 from $2. His new target implies 129% upside from current levels. Yao said he's \"positive\" on iQIYI's path to breakeven this year, given the company's recent change of online-only movie cooperation method, from upfront fee to revenue sharing based on actual movie performance. Although Yao expects iQIYI's advertising revenue to be hurt by the weak macro environment, \"higher stay-at-home entertainment demand is positive for [iQIYI's] user traffic and subscription.\" Yao also believes iQIYI will benefit as price drivers for the China-based internet sector \"to migrate from sentiment in the near term to fundamentals in the medium and long term.\" IQIYI shares have dropped 23.4% year to date, while the iShares MSCI China ETF (MCHI) has shed 22.9% and the S&P 500  has lost 15.5%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tomi Kilgore ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-16-22 1355ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}