{"id":"20220308006340","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab Begins Qualification of Highest Performing Space Solar Cell Technology","publishedDate":"2022-03-08T16:39:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Begins Qualification of Highest Performing Space Solar Cell Technology\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"i","contentObject":[{"type":"text","content":"Developed by SolAero Technologies Inc., a space solar power company recently acquired by Rocket Lab, the IMM-β solar cells are the highest efficiency commercial space solar cell","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab USA, Inc. (“Rocket Lab” or the “Company”) (Nasdaq: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Finvestors.rocketlabusa.com%2F&esheet=52592005&newsitemid=20220308006340&lan=en-US&anchor=RKLB&index=1&md5=0050a4ca5355d38844c0851a180052d0","contentObject":[{"type":"text","content":"RKLB","gated":false}],"gated":false},{"type":"text","content":"), a global leader in launch services, space systems and space solar power products, announced today that its next-generation solar cell technology is transitioning into qualification. The cell is the next product from SolAero’s patented Inverted MetaMorphic (IMM) solar cell technology, dubbed IMM-β, that is expected to exhibit a conversion efficiency of ~33.3% in volume production. IMM-β is the 4","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"th","gated":false}],"gated":false},{"type":"text","content":" generation IMM product created by SolAero Technologies Inc. (SolAero), a space solar power company acquired by Rocket Lab in January 2022.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release features multimedia. View the full release here: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220308006340/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220308006340/en/","gated":false}],"gated":false}],"gated":false},{"type":"div","contentObject":[{"type":"img","src":"https://mms.businesswire.com/media/20220308006340/en/1383971/4/solar-3-07-2022-abq-31750.jpg","alt":"Rocket Lab's new IMM-B high efficiency space solar cell. (Photo: Business Wire)","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Rocket Lab's new IMM-B high efficiency space solar cell. (Photo: Business Wire)","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe IMM-β solar cell is expected to be the highest efficiency space solar cell technology in high-volume production. The cell boasts an average 33.3% Beginning of Life (BOL) efficiency, up from 32% for the IMM-α that is currently in volume production. The IMM-β is also a radiation-hard cell with a power remaining factor of 87% after exposure to 1-MeV electrons at a fluence of 1E15 e/cm","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"2","gated":false}],"gated":false},{"type":"text","content":" or equivalent of about 15 years life in GEO. Now undergoing final space qualification testing, the cells are expected to be ready for commercial use later in 2022.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nIn addition to its best-in-class efficiency, IMM is more than 40% lighter than typical space grade solar cells which helps to make satellites more cost effective.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“We’re excited to bring to market this next significant step in solar cell performance,” said Brad Clevenger, Vice President & General Manager, Space Systems Power Solutions. “In partnership with our colleagues at the Air Force Research Laboratory (AFRL), we’re not only commercializing the world’s highest efficiency and lightest weight space solar cell, we’re doing so at the most competitive cost of any IMM technology to date. IMM-β‘s impact on solar array and launch mass will make it a compelling option for satellite integrators.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“IMM-β’s superior performance is a mission enabler in many applications in the civil, military and commercial space markets. It is also the next stepping stone to even higher performance future IMM solar cell technologies, solidifying SolAero’s segment leading position for many years to come,” added Navid Fatemi, SolAero’s Vice President of Business Development.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n“For 20 years SolAero has been a leader in space solar power innovation and we’re excited to welcome them to the Rocket Lab team as they take yet another technological leap,” said Rocket Lab founder and CEO, Peter Beck. “The SolAero team has enabled trailblazing science missions to distant interplanetary destinations and powered commercial constellations of hundreds of satellites in low Earth orbit, and with the new IMM-β cells they can power the future of space exploration. Solar power is a crucial part of every spacecraft and SolAero is already home to the world’s largest production line of high-performing solar cells. Now with Rocket Lab’s resources and manufacturing capability behind them we look forward to scaling the business to meet the growing demands of the global space market.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 1998 and acquired by Rocket Lab in 2022, Albuquerque, New Mexico-based SolAero has produced solar cells, solar panels, and composite structural products for more than 1,000 successful space missions with 100% reliability. Over the past two decades, SolAero’s products have played key roles in some of the industry’s most ambitious space missions, including supplying power to NASA’s Parker Solar Probe, James Webb Space Telescope, and Mars Insight Lander, as well as several Cygnus Cargo Resupply Missions to the International Space Station.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ About Rocket Lab\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 2006, Rocket Lab is an end-to-end space company with an established track record of mission success. We deliver reliable launch services, spacecraft components, satellites and other spacecraft and on-orbit management solutions that make it faster, easier and more affordable to access space. Headquartered in Long Beach, California, Rocket Lab designs and manufactures the Electron small orbital launch vehicle and the Photon satellite platform and is developing the Neutron 8-ton payload class launch vehicle. Since its first orbital launch in January 2018, Rocket Lab’s Electron launch vehicle has become the second most frequently launched U.S. rocket annually and has delivered 110 satellites to orbit for private and public sector organizations, enabling operations in national security, scientific research, space debris mitigation, Earth observation, climate monitoring, and communications. Rocket Lab’s Photon spacecraft platform has been selected to support NASA missions to the Moon and Mars, as well as the first private commercial mission to Venus. Rocket Lab has three launch pads at two launch sites, including two launch pads at a private orbital launch site located in New Zealand, and a second launch site in Virginia, USA which is expected to become operational in 2022. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2F&esheet=52592005&newsitemid=20220308006340&lan=en-US&anchor=www.rocketlabusa.com&index=2&md5=ac26134839177e6b1a491d10280c8d73","contentObject":[{"type":"text","content":"www.rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220308006340r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n+ Rocket Lab Media Contact\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Michael Atchue\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220308006340/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220308006340/en/","gated":false}],"gated":false}],"gated":false}]}