{"id":"20220516190","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"ManTech stock soars 16-month high after agreeing to be bought by Carlyle for a 17% premium","publishedDate":"2022-05-16T08:18:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Shares of ManTech International Corp. (MANT) hiked up 14.2% toward a 16-month high in premarket trading Monday, after the provider of information technology services for U.S. defense and federal civilian agencies announced an agreement to be acquired by investment firm Carlyle Group Inc. (CG) in a cash deal valued at $4.2 billion. Carlyle's stock rose 1.3% ahead of the open. Under terms of the deal, Carlyle will pay $96 for each ManTech share outstanding, representing a 17.1% premium to Friday's closing price of $81.97. The per-share bid implies a market capitalization of about $3.93 billion for ManTech. \"Following a comprehensive review of strategic alternatives, our Board determined that this transaction is in the best interest of our shareholders and provides them with the most compelling value maximization outcome, offering liquidity at a significant premium,\" said ManTech Chief Executive Kevin Phillips. ManTech's stock, which is on track to open at the highest price seen since January 2021, has rallied 12.4% year to date through Friday, while Carlyle's stock has tumbled 31.4% and the S&P 500  has dropped 15.6%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tomi Kilgore ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-16-22 0918ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}