{"id":"2021101888","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Coronavirus tally: Global cases of COVID-19 top 240 million and U.S. edges toward 725,000 fatalities","publishedDate":"2021-10-18T06:04:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  The global tally for the coronavirus-borne illness climbed above 240 million on Monday, while the death toll edged above 4.9 million, according to data aggregated by Johns Hopkins University. The U.S. continues to lead the world with a total of 44.9 million cases and 724,318 deaths. The U.S. is averaging more than 1,500 deaths a day according to a New York Times tracker, , although new cases and hospitalizations are declining. But some northern states are seeing cases rise again as the cold months send people indoors again, the New York Times reported. Alaska is still leading by new cases on a per capita basis. In medical news, Two doses of either the vaccine made by Pfizer (PFE) and BioNTech (BNTX) or Oxford-AstraZeneca (AZN.LN) vaccines provided a similar level of protection to prior natural infection when the Delta variant was dominant, the U.K. Office of National Statistics said Monday French biotech Valneva  said its coronavirus vaccine candidate outperformed AstraZeneca's in a trial India is second by cases after the U.S. at 34 million and has suffered 452,290 deaths. Brazil has second highest death toll at 603,282 and 21.6 million cases. In Europe, Russia has most fatalities at 220,323, followed by the U.K. at 138,997. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Ciara Linnane ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  10-18-21 0704ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2021 Dow Jones & Company, Inc.","gated":false}]}