{"id":"20220114394","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"BJ's Wholesale stock dives after J.P. Morgan swings to bearish from bullish as stimulus benefits are set to fade","publishedDate":"2022-01-14T07:29:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  Shares of BJ's Wholesale Club Holdings Inc. (BJ) dove 5.2% toward a two-month low in premarket trading Friday, after J.P. Morgan analyst Christopher Horvers swung to bearish from bullish on the membership-based warehouse retailer, following their sizable outperformance the past two years. Horvers cut this rating to underweight from overweight and cut his stock price target to $60 from $78. The new price target implies 7.5% downside from Thursday's closing price. The stock had run up 79.6% in 2021 and 63.9% in 2020, while the SPDR S&P Retail ETF (XRT) rose 40.4% last year and 39.8% the year before. \"As we look ahead, we are wary of the low-end consumer anniversarying stimulus, the abatement of the [Pandemic Electronic Benefits Transfer] payments, the anniversary of the child tax credit (120-[basis point] monthly boost to retail sales August-December) and accelerating food inflation over the year (also concerns for [Walmart]),\" Horvers wrote in a note to clients. \"This dynamic could lead to [same-store sales] shortfalls, particularly as the year progresses.\" So far this year, the stock has lost 3.1% while the retail ETF has declined 5.4% and the S&P 500  has eased 2.3%. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tomi Kilgore ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  01-14-22 0829ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}