{"id":"20220228006048","sourceId":"business-wire","sourceName":"Business Wire","providerName":"Business Wire","title":"Rocket Lab Selects Virginia for Neutron Launch Site & Extensive Manufacturing Complex","publishedDate":"2022-02-28T15:10:00-06:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Rocket Lab Selects Virginia for Neutron Launch Site & Extensive Manufacturing Complex","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"i","contentObject":[{"type":"text","content":"Construction to Begin on Neutron Manufacturing, Operations, and Launch Facilities in Accomack County, Bringing As Many As 250 New Jobs to Eastern Shore","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab USA, Inc (Nasdaq: ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Finvestors.rocketlabusa.com%2F&esheet=52586833&newsitemid=20220228006048&lan=en-US&anchor=RKLB&index=1&md5=f82d5ef612e1aaef9b1e8838a689e32e","contentObject":[{"type":"text","content":"RKLB","gated":false}],"gated":false},{"type":"text","content":") (Rocket Lab), a leading launch and space systems company, today revealed it has selected Wallops Island, Virginia, as the location for its first launch site and extensive manufacturing and operations facilities, for its 8-ton payload class reusable Neutron rocket.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release features multimedia. View the full release here: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220228006048/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220228006048/en/","gated":false}],"gated":false}],"gated":false},{"type":"div","contentObject":[{"type":"img","src":"https://mms.businesswire.com/media/20220228006048/en/1374115/4/1_Neutron_Production_Complex_FINAL_hi_res.jpg","alt":"Artist's impression of Rocket Lab's Neutron Production Complex to be built in Virginia. (Graphic: Business Wire)","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"Artist's impression of Rocket Lab's Neutron Production Complex to be built in Virginia. (Graphic: Business Wire)","gated":false}],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe Neutron Production Complex and launch pad for its Neutron rocket will be located adjacent to and within the NASA Wallops Flight Facility and Mid-Atlantic Regional Spaceport on Virginia’s Eastern Shore. The complex will be home to a rocket production, assembly, and integration facility, as well as a dedicated launch pad for the Neutron rocket located on the southern end of Wallops Island. The estimated 250,000 square foot state-of-the-art complex will be constructed on a 28-acre site adjacent to the Wallops Island Flight Facility and will include a Launch Control Center, Rocket Lab’s fifth global operations center for launch activities and on-orbit operations. To support rapid production of the Neutron rocket, current plans for the complex include automated fiber placement robotic production systems capable of laying up meters of Neutron’s new, specially formulated carbon composite structures in minutes. As a reusable rocket, Neutron is designed to land back on the launch pad after a mission and from there it would be returned to the production complex for refurbishment and re-flight.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThe manufacturing complex will be located within proximity of Rocket Lab Launch Complex 2, the Company’s launch site for the Electron launch vehicle, the second most frequently launched U.S. rocket annually since 2019. Rocket Lab’s Neutron Production Complex is expected to create as many as 250 jobs in Virginia.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab founder and CEO, Peter Beck, says: “Neutron is a new generation of rocket that will advance the way space is accessed, and Virginia makes perfect sense as a significant site for Neutron’s early development. Its position on the eastern seaboard is the ideal location to support both Neutron’s expected frequent launch cadence and the rocket’s return-to-Earth capability of landing back at its launch site after lift-off; and as one of only four states in the United States with an FAA spaceport license for missions to Earth orbit or on interplanetary trajectories, Virginia is home to an active and experienced aerospace workforce we can pull from to support Neutron’s development and launch. I’m thankful for the Commonwealth’s enthusiasm and backing of Neutron which, combined with the state’s rich heritage as an aerospace state, made it difficult to see anywhere else but Virginia to begin Neutron’s journey.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nNeutron is Rocket Lab’s next generation launch vehicle in development, designed to lift 8-tons of payload and to provide a tailored launch solution for satellite mega-constellations. Neutron’s unique design, materials, propulsion, and reusability architecture also make the launch vehicle ideal for assured access to space for the nation’s most critical missions, deep space exploration, and potentially human spaceflight. Neutron will be the world’s first carbon composite large launch vehicle, powered by in-house designed and manufactured Archimedes reusable rocket engines and an advanced upper stage to enable high performance for complex satellite deployments.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab selected Virginia as the location of its Neutron expansion on the strength of the extensive support from the Commonwealth of Virginia, in particular the Virginia Economic Development Partnership working alongside Accomack County, the Virginia Commercial Space Flight Authority (Virginia Space), and the General Assembly’s Major Employment and Investment (MEI) Project Approval Commission. As part of the Commonwealth’s proposal, $30 million has been set aside for infrastructure and operational systems improvements to the Mid-Atlantic Regional Spaceport where the Neutron launch site will be located, along with $15 million from the MEI Project Approval Commission in site improvements and building construction in support of Neutron.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Vice President – Launch Systems, Shaun D’Mello, thanks the Commonwealth of Virginia and Accomack County for its enthusiasm and support to bring Neutron to the Eastern Shore. “We’ve enjoyed a solid partnership with Virginia for years that will no doubt be strengthened with Neutron. We have a shared mission to develop Rocket Lab’s presence at the Mid-Atlantic Regional Spaceport into a strategic national asset that provides responsive, reliable, reusable space launch through Neutron and Electron, and breaking ground on the site soon is a significant and impelling step toward that future.”\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab expects to begin construction on the Neutron Production Complex in Virginia promptly. Commercial and government interest in Neutron is strong and includes a recent $24 million development contract granted by the U.S. Space Force’s Space Systems Command (SSC) in support of Neutron’s capability to aid national security and defense missions ranging from scientific and experimental satellites to the largest and most critical national security payloads. Further Neutron expansion will continue throughout the United States as the program develops toward first launch.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"ADDITIONAL COMMENTS","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"The Governor of the Commonwealth of Virginia, Glenn Youngkin: ","gated":false}],"gated":false},{"type":"text","content":"“Virginia’s industrial and innovation ecosystem and skilled workforce make the Commonwealth an optimal location for industry leaders like Rocket Lab.","gated":false},{"type":"b","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false},{"type":"text","content":"This important project reinforces the Eastern Shore’s legacy as an aerospace hub that offers the infrastructure for manufacturing and developing new technologies, and we look forward to a long partnership with Rocket Lab.”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Senator Mark R. Warner: ","gated":false}],"gated":false},{"type":"text","content":"“Virginia has been a leader for the United States in space development, research, and exploration. This exciting new partnership, which will include the construction of a launch site and manufacturing hub for Rocket Lab’s new reusable Neutron rocket, is the latest in aerospace advancement for the Commonwealth. This new facility will not only continue to help boost our nation’s competitiveness in aeronautics, but will also serve as an investment in Virginia’s economy by bringing over 200 jobs to the Eastern Shore. This project is great for the Eastern Shore and all of Virginia, and I look forward to working with Rocket Lab for years to come.”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Senator Tim Kaine: ","gated":false}],"gated":false},{"type":"text","content":"“Between NASA’s groundbreaking research and the work of our wonderful private sector partners in the field, Virginia continues to lead in the fields of aerospace and aviation. I’m glad to have helped support the creation of Rocket Lab’s new launch site, and am looking forward to watching the innovation that comes out of this facility, as well as the impact these new jobs will have on the local community.”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Senator Ben Cardin:","gated":false}],"gated":false},{"type":"text","content":" “Growing the already robust launch capabilities at Wallops Island is a smart investment that will attract even greater high-level talent to the region. We are proud of the many Marylanders who are essential to the regional aerospace workforce and will surely be a part of Rocket Lab’s growing presence on the Eastern Shore.”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Senator Chris Van Hollen:","gated":false}],"gated":false},{"type":"text","content":" “Our region is home to some of the most innovative science, technology, and space facilities in the country driven by talented Marylanders that leverage partnerships between government institutions and the private sector to support the finest workforce in these fields. That’s why I’m glad Rocket Lab has chosen to open its new manufacturing and operations facilities at our nearby NASA Wallops Flight Facility. This exciting opportunity will bring new jobs, technology, and expertise to Wallops and our surrounding communities, as we keep working to invest in the future of Wallops and Maryland’s vital role in space and exploration.”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Representative Elaine G. Luria:","gated":false}],"gated":false},{"type":"text","content":" “Rocket Lab’s launch site and major manufacturing complex in Accomack County is an exciting opportunity that will bring 250 good-paying jobs to the Eastern Shore and advance Coastal Virginia’s position as a national leader in the space industry. I am proud to support initiatives that create economic opportunities and expand the Commonwealth’s role in the space industry.”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Secretary of Commerce and Trade, Caren Merrick:","gated":false}],"gated":false},{"type":"text","content":" “Wallops Island is a prime site for aerospace and aviation operations, and it is an honor to officially welcome Rocket Lab to the Eastern Shore of Virginia. The Commonwealth has a strong aerospace and unmanned systems industry workforce, which is forecast to grow 8.5% over the next decade, and is well-positioned to provide the skilled talent that Rocket Lab will require for its Neutron launch site, manufacturing, and operations.”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Senator Lynwood Lewis: ","gated":false}],"gated":false},{"type":"text","content":"“Rocket Lab’s official decision to establish its Neutron Production and Launch Complex operation in Accomack County is a game changer for the Eastern Shore and the Commonwealth. We are thrilled that Virginia was selected for this expansion, which will spur even more economic activity, and look forward to building a lasting partnership with this industry-leading company.”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Delegate Robert Bloxom: ","gated":false}],"gated":false},{"type":"text","content":"“Rocket Lab’s selection of Virginia for this major project is a tremendous win, and I appreciate the hard work by all sides. Rocket Lab is a welcome addition to Virginia Space and Accomack County, and I am confident the great workforce and infrastructure offered by NASA Wallops Flight Facility helped the company make its decision to expand on the Eastern Shore of Virginia.”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"NASA’s Wallops Flight Facility Director, David Pierce: ","gated":false}],"gated":false},{"type":"text","content":"“NASA’s only owned and operated launch range at Wallops Flight Facility supports small- and medium-class orbital rocket launches and continues to grow our nation’s space economy. Rocket Lab’s decision will bring more good-paying, high-tech jobs to the Wallops region and proves our industry partners recognize NASA’s spirit of relentless innovation along the Eastern Shore and throughout the country.”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"ul","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"li","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Major General Ted Mercer, USAF (ret), CEO and Executive Director, Virginia Commercial Space Flight Authority:","gated":false}],"gated":false},{"type":"text","content":" “Virginia Space will continue our already outstanding relationship with a premiere company like Rocket Lab. We were able to leverage our existing world-class assets and the significant investment the Commonwealth has made at MARS to enhance our capability, which was instrumental in convincing Rocket Lab to expand their operations and bring a new mission to Virginia. This is a win-win for Rocket Lab, the Commonwealth, and our nation!”\n","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nNeutron Images and Video for Download\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=https%3A%2F%2Fwww.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&esheet=52586833&newsitemid=20220228006048&lan=en-US&anchor=www.rocketlabusa.com%2Fabout-us%2Fupdates%2Flink-to-rocket-lab-imagery-and-video%2F&index=2&md5=ed1c75e6d0dc37d08c2cecc83133fb1d","contentObject":[{"type":"text","content":"www.rocketlabusa.com/about-us/updates/link-to-rocket-lab-imagery-and-video/","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nAbout Rocket Lab\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nFounded in 2006, Rocket Lab is an end-to-end space company with an established track record of mission success. We deliver reliable launch services, spacecraft components, satellites and other spacecraft and on-orbit management solutions that make it faster, easier and more affordable to access space. Headquartered in Long Beach, California, Rocket Lab designs and manufactures the Electron small orbital launch vehicle and the Photon satellite platform and is developing the Neutron 8-ton payload class launch vehicle. Since its first orbital launch in January 2018, Rocket Lab’s Electron launch vehicle has become the second most frequently launched U.S. rocket annually and has delivered 109 satellites to orbit for private and public sector organizations, enabling operations in national security, scientific research, space debris mitigation, Earth observation, climate monitoring, and communications. Rocket Lab’s Photon spacecraft platform has been selected to support NASA missions to the Moon and Mars, as well as the first private commercial mission to Venus. Rocket Lab has three launch pads at two launch sites, including two launch pads at a private orbital launch site located in New Zealand and a second launch site in Virginia, USA which is expected to become operational in 2022. To learn more, visit ","gated":false},{"type":"a","href":"https://cts.businesswire.com/ct/CT?id=smartlink&url=http%3A%2F%2Fwww.rocketlabusa.com%2F&esheet=52586833&newsitemid=20220228006048&lan=en-US&anchor=www.rocketlabusa.com&index=3&md5=253909905f7edc99b6da6bdbda095382","contentObject":[{"type":"text","content":"www.rocketlabusa.com","gated":false}],"gated":false},{"type":"text","content":".\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n","gated":false},{"type":"b","contentObject":[{"type":"text","content":"Forward-Looking Statements","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nThis press release may contain certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities and Exchange Act of 1934, as amended. These forward-looking statements, including without limitation expectations regarding the development, capability and technical design of the Neutron rocket architecture and related components as well as the construction, timing, capabilities and benefits of the Neutron production and launch complex, are based on Rocket Lab’s current expectations and beliefs concerning future developments and their potential effects. These forward-looking statements involve a number of risks, uncertainties (many of which are beyond Rocket Lab’s control), or other assumptions that may cause actual results or performance to be materially different from those expressed or implied by these forward-looking statements. Many factors could cause actual future events to differ materially from the forward-looking statements in this press release, including risks related to the global COVID-19 pandemic, including risks related to government restrictions and lock-downs in New Zealand and other countries in which we operate that could delay or suspend our operations; delays and disruptions in expansion efforts; our dependence on a limited number of customers; the harsh and unpredictable environment of space in which our products operate which could adversely affect our launch vehicle and spacecraft; increased congestion from the proliferation of low Earth orbit constellations which could materially increase the risk of potential collision with space debris or another spacecraft and limit or impair our launch flexibility and/or access to our own orbital slots; increased competition in our industry due in part to rapid technological development and decreasing costs; technological change in our industry which we may not be able to keep up with or which may render our services uncompetitive; average selling price trends; failure of our launch vehicles, satellites and components to operate as intended either due to our error in design, in production or through no fault of our own; launch schedule disruptions; supply chain disruptions, product delays or failures; design and engineering flaws; launch failures; natural disasters and epidemics or pandemics; changes in governmental regulations including with respect to trade and export restrictions, or in the status of our regulatory approvals or applications; or other events that force us to cancel or reschedule launches, including customer contractual rescheduling and termination rights; risks that acquisitions may not be completed on the anticipated timeframe or at all or do not achieve the anticipated benefits and results; and the other risks detailed from time to time in Rocket Lab’s filings with the Securities and Exchange Commission under the heading “Risk Factors” and elsewhere (including that the impact of the COVID-19 pandemic may also exacerbate the risks discussed therein). There can be no assurance that the future developments affecting Rocket Lab will be those that we have anticipated. Except as required by law, Rocket Lab is not undertaking any obligation to update or revise any forward-looking statements whether as a result of new information, future events or otherwise.\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"img","src":"https://cts.businesswire.com/ct/CT?id=bwnews&sty=20220228006048r1&sid=mstr3&distro=nx&lang=en","alt":"","variations":[],"gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"\nRocket Lab Media Contact\n","gated":false},{"type":"br","gated":false},{"type":"text","content":"Murielle Baker\n","gated":false},{"type":"br","gated":false},{"type":"a","href":"mailto:media@rocketlabusa.com","contentObject":[{"type":"text","content":"media@rocketlabusa.com \n","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"+64 27 538 9040\n","gated":false}],"gated":false},{"type":"p","contentObject":[{"type":"text","content":"View source version on businesswire.com: ","gated":false},{"type":"a","href":"https://www.businesswire.com/news/home/20220228006048/en/","contentObject":[{"type":"text","content":"https://www.businesswire.com/news/home/20220228006048/en/","gated":false}],"gated":false}],"gated":false}]}