{"id":"8529447","sourceId":"globe-newswire","sourceName":"GlobeNewswire","providerName":"GlobeNewswire","title":"Tenable Agrees to Acquire Bit Discovery","publishedDate":"2022-04-26T15:05:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"COLUMBIA, Md., April  26, 2022  (GLOBE NEWSWIRE) -- Tenable Holdings, Inc. (“Tenable”) (Nasdaq: TENB), the Cyber Exposure company, today announced that it has signed an agreement to acquire Bit Discovery, Inc. (“Bit Discovery”), a leader in external attack surface management (EASM). Combining Tenable’s market-leading Cyber Exposure solutions with Bit Discovery’s EASM capabilities will provide customers with a differentiated 360-degree view of the modern attack surface – both inside out and outside in – to identify and eliminate areas of known and unknown security risk.","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Discovering and gaining insight into every part of a business's digital footprint are essential steps of any effective cybersecurity program. Discovery has never been more critical, given the reliance on critical internet-facing services, applications and APIs. The problem for most organizations is that they are largely blind to the full and ever-changing scope of internet-facing assets and services. With its powerful EASM solution, Bit Discovery eliminates this problem by continuously monitoring the Internet, allowing customers to rapidly discover and identify all externally facing assets that could become exploitable targets by cyber criminals.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"After closing, Tenable will leverage Bit Discovery’s EASM solutions across its entire portfolio – from enterprise vulnerability management (VM) to Nessus, from cloud to operational technology (OT) to identity. Once integrated, customers will have the ability to assess the security posture of their entire attack surface and understand each of these in the context of an attack path which might exist from external systems to critical assets. By covering both external and internal assets, Tenable will provide a comprehensive view of vulnerabilities and cyber risk, allowing customers to prioritize remediation efforts and minimize cyber exposure.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"“Whatever is visible on the internet is very likely to be the first target and the hardest thing for organizations to continuously see and assess. We believe attack surface management is vital to modern cybersecurity and an integral part of our vulnerability and Cyber Exposure solutions,” said Glen Pendley, chief technology officer, Tenable. “We are seamlessly combining previously disjointed insights and empowering security practitioners to eliminate blind spots and easily understand their cyber exposure in ways previously not possible.”","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"“Bit Discovery’s founding mission is to help enterprises identify their internet-facing attack surface area and continually monitor and manage their exposure. Joining Tenable will give us the ability to instantly reach 40,000 global customers, accelerating our vision in ways that would have otherwise been impossible,” said Jeremiah Grossman, CEO and co-founder, Bit Discovery. “This capability combined with the insights provided by Tenable’s solutions is a compelling chance to change the market.”","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Bit Discovery was founded by Jeremiah Grossman and Robert Hansen. Grossman, who also founded WhiteHat Security, has spent approximately 20 years in information security, during which he has become an industry luminary. Hansen previously served as a security pioneer at eBay, where he was responsible for authentication as well as anti-fraud and anti-phishing technologies.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Under the terms of the agreement, Tenable will acquire Bit Discovery for a total purchase price of $44.5 million in cash, subject to customary purchase price adjustments. The acquisition is expected to close later in the second quarter of 2022, subject to the satisfaction of customary closing conditions.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Bit Discovery is not expected to have a significant impact on Tenable’s financial results in the second quarter. For the second half of the year, revenue is not expected to be significant, but Bit Discovery is expected to add $2 million to $3 million of Calculated Current Billings, most notably in the latter part of the year, and $2 million to $3 million of non-GAAP Net Loss.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Tenable shares news and updates that may be of interest or material to Tenable investors on its Investor Relations website at ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=ETETwtQfSLq2yZh2WJz9FDB0_j1v2BQyWNu5ztLOP7AcTtcdCiG2LLW9kPqiusdf97FmaDy-gh_l27pcc63mgnXRCRjbBQrS3NX7ZKL-UII=","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"investors.tenable.com","gated":false}],"gated":false}],"gated":false},{"type":"text","content":". Please visit the site for more information about the announcement.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"About Tenable","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Tenable® is the Cyber Exposure company. Approximately 40,000 organizations around the globe rely on Tenable to understand and reduce cyber risk. As the creator of Nessus®, Tenable extended its expertise in vulnerabilities to deliver the world’s first platform to see and secure any digital asset on any computing platform. Tenable customers include approximately 60 percent of the Fortune 500, approximately 40 percent of the Global 2000, and large government agencies. Learn more at ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=9ulLr-giFltj7Up885fxHwbZ9CLhgGhB_7szzWcT4GUd1zU7AEiK76YqrSsbWeRL24rlkawvtQgjmE9Bj2r3tg==","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"tenable.com","gated":false}],"gated":false}],"gated":false},{"type":"text","content":".","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Forward Looking Statements","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This press release contains forward-looking information related to Tenable, Bit Discovery and the potential acquisition that involves substantial risks, uncertainties and assumptions that could cause actual results to differ materially from those expressed or implied by such statements. Forward-looking statements in this communication include, among other things, statements about the potential benefits of the acquisition and product developments and other possible or assumed business strategies, anticipated financial impact of the acquisition, potential growth opportunities, new products and potential market opportunities. Risks and uncertainties include, among other things, our ability to successfully integrate Bit Discovery’s operations; our ability to implement our plans, forecasts and other expectations with respect to Bit Discovery’s business; our ability to realize the anticipated benefits of the acquisition, including the possibility that the expected benefits from the acquisition will not be realized or will not be realized within the expected time period; our ability to consummate the transaction pursuant to the terms and in accordance with the timing described in this press release; disruption from the acquisition making it more difficult to maintain business and operational relationships; the inability to retain key employees; the negative effects of the consummation of the acquisition on the market price of our common stock or on our operating results; unknown liabilities; attracting new customers and maintaining and expanding our existing customer base, our ability to scale and update our platform to respond to customers’ needs and rapid technological change, increased competition on our market and our ability to compete effectively, and expansion of our operations and increased adoption of our platform internationally.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Additional risks and uncertainties that could affect our financial results are included in the section titled “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the year ended December 31, 2021 and other filings that we make from time to time with the Securities and Exchange Commission which are available on the SEC’s website at www.sec.gov. In addition, any forward-looking statements contained in this communication are based on assumptions that we believe to be reasonable as of this date. Except as required by law, we assume no obligation to update these forward-looking statements, or to update the reasons if actual results differ materially from those anticipated in the forward-looking statements.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Contact Information:","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Investor Relations","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=ETETwtQfSLq2yZh2WJz9FFySCn5f5vpCG_ng89DWlZR-vKsHOttzJmHnbXXCHm0A1WgECglEWkgZS5Ujf_qzhgCtoPdzo_wfNGHZeaSmH_4=","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"investors@tenable.com","gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Media Relations","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=9ulLr-giFltj7Up885fxH6VT4qGd_LmNMsLYUXXZx0iYEGl8ljgH3oI90W0Bb2WIQas4hMxyWyhFLz4ELCrYH45lGDWtRpenR2XWFog6f0s=","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"tenablepr@tenable.com","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[],"gated":false},{"type":"text","content":" ","gated":false},{"type":"img","src":"https://www.globenewswire.com/newsroom/ti?nf=ODUyOTQ0NyM0ODgxMTU2IzIxMjA3MDI=","alt":"","variations":[],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"img","src":"https://ml.globenewswire.com/media/MDlkYzJjMGItNjllMy00MWZhLWE5Y2EtMTMwZGZjYzZiNjVlLTExMzIyNzM=/tiny/Tenable-Holdings-Inc-.png","alt":"","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"a","href":"https://www.globenewswire.com/NewsRoom/AttachmentNg/2d21292c-c42d-4d59-a69c-0d8e814802c1","contentObject":[{"type":"img","src":"https://ml.globenewswire.com/media/2d21292c-c42d-4d59-a69c-0d8e814802c1/small/tenable-logo2021-png.png","alt":"Primary Logo","variations":[],"gated":false}],"gated":false}],"gated":false}]}