{"id":"20220427580","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"Bill Hwang's $30 billion bezzle: Here are the 5 juiciest details from the DOJ's Archegos indictment","publishedDate":"2022-04-27T14:06:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  By Chris Matthews ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The scandal has motivated the SEC to propose new transparency rules on stock derivatives ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The U.S. Department of Justice unsealed an indictment against Archegos Capital Management founder Bill Hwang and CFO Patrick Halligan for securities fraud, wire fraud and racketeering Wednesday following the 2021 collapse of the fund after it amassed highly levered positions in a handful on U.S. stocks. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Archegos allegedly used a type of derivative called a total return swap that enabled the fund to build up massive positions in stocks like ViacomCBS Inc (PARA) and Discovery Inc. (WBD) without triggering public disclosure requirements, a strategy that enabled it to mislead some of the world's largest and most sophisticated financial institutions into extending it the credit necessary to continue to pump up the value of those names. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"We allege that these defendants and their co-conspirators lied to banks to obtain billions of dollars that they then used to inflate the stock price of a number of publicly-traded companies,\" U.S. Attorney Damian Williams said in a statement. \"The lies fed the inflation, and the inflation led to more lies.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The indictment closes a more than yearlong investigation into Archegos' failure, an episode that has motivated the Securities and Exchange Commission to propose new  transparency rules surrounding total return swaps and other derivatives. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  See also: Hwang's Archegos deceived Wall Street firms, federal government says ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Here are the 5 most interesting details from the indictment: ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Bill Hwang's net worth grew from $1.5 billion to more than $35 billion in just one year -- though much of that value was illusory ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"Between March 2020 and the week of March 22, 2021, Archegos' capital -- essentially Hwang's personal fortune -- increased from approximately $1.5 billion to more than $35 billion,\" the indictment alleges. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The document maintains that the increase in the value of the Archegos' holdings was largely the result of \"Hwang's manipulative trading and deceptive conduct that caused others to trade.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Hwang and his employees allegedly lied to banks about the nature of its positions in order to convince them to extend him the credit necessary to purchase derivatives that were economically equivalent to owning the underlying securities. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Archegos team allegedly knew that buying these derivatives would cause their counterparties to buy the underlying securities in order to hedge their exposure, causing their prices to rise artificially. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The scheme resulted in losses of roughly $100 billion ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"The total size of Archegos' market positions, including investments made with money borrowed from the counterparties, grew from approximately $10 billion to more than $160 billion\" over the course of just one year, the indictment declares. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In March of 2021, declines in the prices of Archegos' major holdings prompted its lenders to demand more collateral. When the fund could not produce this collateral, prices collapsed. \"More than $100 billion in apparent market value for nearly a dozen companies disappeared within days,\" the government said. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Archegos exposure amounted to upwards of 70% of the outstanding shares of specific companies ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The Securities and Exchange Commission said its civil complaint, also unveiled Wednesday, that when combining its equity and derivative stakes, Archegos accumulated exposures equal to more than 70% of the outstanding shares in GSX Techedu Inc., 60% of Discovery Communications and 50% of IQIYY Inc. (IQ) ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  These positions allegedly enabled Archegos to manipulate the prices of these stocks higher, especially when considering that passive index funds, which controlled much of the remaining outstanding shares, do not buy and sell securities based on market performance. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"In June 2020, when asked in a text message by an Archegos analyst whether ViacomCBS's stock price improvement that day was 'a sign of strength' Hwang responded, 'No. It's a sign of me buying'  followed by a 'tears of joy' or laughing emoji,\" according to the SEC complaint. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Read more: 'It's a sign of me buying.' Bill Hwang, the man who manipulated stocks ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Hwang's alleged manipulation helped squeeze major short sellers like Muddy Waters ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The DOJ complaint alleges that Hwang worked to \"defend\" the prices of stocks that were \"facing negative press or market movements.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  GSX  Techedu (GOTU)was facing major negative press in 2020 following a report by famed short selling firm Muddy Waters Research that alleged the education tech company's financial results were fraudulent. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  \"This happened frequently, but not exclusively, with GSX, which was especially volatile due in part to active short sellers, regulatory inquiries and public accusations of fraud,\" the indictment reads. \"As the portfolio became more concentrated, Hwang traded with the further purpose of propping up the stock price to avoid margin calls.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The most sophisticated financial institutions in the world were fooled by an investor who had already been convicted of insider trading ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  In 2012, Hwang wound down his hedge fund Tiger Asia Management after pleading guilty to criminal fraud charges and paying $44 million to settle a civil insider trading case with the SEC. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  The large banks that served as Archegos' counterparties \"were aware of concentration risks associated with Archegos\" because the fund's positions at each of these banks were highly concentrated on a handful of stocks, according to the Justice Department, but they took at face value claims that its positions with other counterparties were different. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  Credit Suisse (CSGN.EB), which lost roughly $5.5 billion following the Archegos default, conducted an independent external investigation into the matter. It said that while Archegos \"deceived CS and obfuscated the true extent of its positions\" the company \"had ample information well before the events of March 22, 2021 that should have prompted them to at least partially mitigate the significant risks Archegos posed to CS.\" ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Chris Matthews ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  04-27-22 1506ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}