{"id":"8519327","sourceId":"globe-newswire","sourceName":"GlobeNewswire","providerName":"GlobeNewswire","title":"Notice to Current Beyond Meat Stockholders of Proposed Settlement and Dismissal with Prejudice of Derivative Actions","publishedDate":"2022-04-08T16:37:57-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"EL SEGUNDO, Calif., April  08, 2022  (GLOBE NEWSWIRE) -- The following is being released by Beyond Meat, Inc. (NASDAQ: BYND) pursuant to an Order of the United States District Court for the Central District of California.","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"br","gated":false},{"type":"text","content":"IN THE UNITED STATES DISTRICT COURT","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"CENTRAL DISTRICT OF CALIFORNIA","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"table","contentObject":[{"type":"tbody","contentObject":[{"type":"tr","contentObject":[{"type":"td","contentObject":[{"type":"text","content":"IN RE: BEYOND MEAT, INC. DERIVATIVE LITIGATION","gated":false},{"type":"br","gated":false},{"type":"br","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"td","contentObject":[{"type":"br","gated":false},{"type":"br","gated":false},{"type":"text","content":"Case No.: CV-20-2524-MWF (AFMx)","gated":false},{"type":"br","gated":false}],"gated":false}],"gated":false},{"type":"tr","contentObject":[{"type":"td","contentObject":[{"type":"br","gated":false},{"type":"text","content":"This Document Relates to:","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"td","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false}],"gated":false},{"type":"tr","contentObject":[{"type":"td","contentObject":[{"type":"br","gated":false},{"type":"text","content":"ALL ACTIONS","gated":false},{"type":"br","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"td","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"br","gated":false},{"type":"text","content":"NOTICE TO CURRENT BEYOND MEAT STOCKHOLDERS OF PROPOSED SETTLEMENT AND DISMISSAL WITH PREJUDICE OF","gated":false}],"gated":false},{"type":"strong","contentObject":[{"type":"u","contentObject":[{"type":"text","content":" DERIVATIVE ACTIONS","gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"TO:         ","gated":false},{"type":"strong","contentObject":[{"type":"text","content":"ALL RECORD HOLDERS AND BENEFICIAL OWNERS OF THE BEYOND MEAT, INC. (“BEYOND MEAT” OR THE “COMPANY”) COMMON STOCK (TICKER SYMBOL: BYND) AS OF JANUARY 14, 2022.","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PLEASE READ THIS NOTICE CAREFULLY AND IN ITS ENTIRETY. THIS NOTICE RELATES TO A PROPOSED SETTLEMENT AND DISMISSAL WITH PREJUDICE OF STOCKHOLDER DERIVATIVE LITIGATION AND CONTAINS IMPORTANT INFORMATION REGARDING YOUR RIGHTS.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"IF THE COURT APPROVES THE SETTLEMENT OF THE DERIVATIVE ACTIONS, BEYOND MEAT STOCKHOLDERS WILL BE FOREVER BARRED FROM CONTESTING THE APPROVAL OF THE PROPOSED SETTLEMENT AND DISMISSAL WITH PREJUDICE, AND FROM PURSUING RELEASED CLAIMS.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"THIS ACTION IS NOT A “CLASS ACTION.” THUS, THERE IS NO COMMON FUND UPON WHICH YOU CAN MAKE A CLAIM FOR A MONETARY PAYMENT.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"PLEASE TAKE NOTICE that this action is being settled on the terms set forth in a Stipulation of Settlement, dated January 14, 2022 (the “Stipulation”). The purpose of this Notice is to inform you of:","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"ul","contentObject":[{"type":"li","contentObject":[{"type":"text","content":"the existence of the above-captioned consolidated derivative action captioned ","gated":false},{"type":"em","contentObject":[{"type":"text","content":"In re: Beyond Meat, Inc. Derivative Litigation, ","gated":false}],"gated":false},{"type":"text","content":"Case No. 2:20-cv-02524, pending in this Court (“Consolidated Action”);","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"ul","contentObject":[{"type":"li","contentObject":[{"type":"text","content":"the existence of a derivative action pending in the United States District Court for the District of Delaware captioned ","gated":false},{"type":"em","contentObject":[{"type":"text","content":"Chew v. Thompson, et al.","gated":false}],"gated":false},{"type":"text","content":", 1:20-cv-00705-RGA (collectively, the “Derivative Actions”);","gated":false},{"type":"br","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"ul","contentObject":[{"type":"li","contentObject":[{"type":"text","content":"the proposed settlement between Plaintiffs","gated":false},{"type":"sup","contentObject":[{"type":"text","content":"1","gated":false}],"gated":false},{"type":"text","content":" and the Settling Defendants reached in the Derivative Actions (the “Settlement”);","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"ul","contentObject":[{"type":"li","contentObject":[{"type":"text","content":"the hearing to be held by the Court to consider the fairness, reasonableness, and adequacy of the Settlement and dismissal of the Consolidated Action with prejudice;","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"ul","contentObject":[{"type":"li","contentObject":[{"type":"text","content":"Plaintiffs’ Counsel’s application for fees and expenses; and","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"ul","contentObject":[{"type":"li","contentObject":[{"type":"text","content":"Plaintiffs’ monetary service awards.","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This Notice describes what steps you may take in relation to the Settlement. This Notice is not an expression of any opinion by the Court about the truth or merits of Plaintiffs’ claims or Defendants’ defenses. This Notice is solely to advise you of the proposed Settlement of the Derivative Actions and of your rights in connection with the proposed Settlement.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Summary","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"On January 14, 2022, Beyond Meat, in its capacity as a nominal defendant, entered into the Stipulation to settle the Derivative Actions filed on behalf of Beyond Meat, in the United States District Court for the Central District of California (the “Court”) and the United States District Court for the District of Delaware against certain current and former directors and officers of the Company and/or certain third party companies with which the Company entered into manufacturing arrangements, and against the Company as a nominal defendant. The Stipulation and the settlement contemplated therein (the “Settlement”), subject to the approval of the Court, are intended by the Settling Parties to fully, finally, and forever compromise, resolve, discharge, and settle the Released Claims and to result in the complete dismissal of the Derivative Actions with prejudice, upon the terms and subject to the conditions set forth in the Stipulation. The proposed Settlement requires the Company to adopt certain corporate governance reforms and procedures, as outlined in Exhibit A to the Stipulation.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Only after the Settling Parties agreed on the corporate governance reforms and procedures, did they engage in arm’s length negotiations over the attorneys’ fees and expenses that would be payable to Plaintiffs’ Counsel in recognition of the substantial benefits achieved through the Settlement. They agreed that the Company would pay $515,000 to Plaintiffs’ Counsel for their attorneys’ fees and expenses. Plaintiffs’ Counsel shall also apply to the Court for service awards to be paid to each of the four Plaintiffs in the amount of $2,000 each (the “Service Awards”), to be paid out of any attorneys’ fees and expense award.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This Notice is a summary only and does not describe all of the details of the Stipulation. For full details of the matters discussed in this summary, please see the full Stipulation and its exhibits posted on the Company’s website, ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=qjO29gmERXnVgKXJQR7HUQ-DYptPcMd8Go838uPXoChnSeqLFxoheO5kUqQZ0zk_MOFTAh8a5T--5mMLgtTpZQ5SPr6bOd6ju2bwvGCIeMUmYYIqK6twTCHbgNKoUC-J","contentObject":[{"type":"text","content":"https://investors.beyondmeat.com/","gated":false}],"gated":false},{"type":"text","content":" (under the “RESOURCES” tab), contact Plaintiffs’ Counsel at the addresses listed below, or inspect the full Stipulation filed with the Clerk of the Court.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"What is the Lawsuit About?","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The Consolidated Action is brought derivatively on behalf of nominal defendant Beyond Meat and alleges that the Individual Defendants breached their fiduciary duties to the Company by allowing or causing Beyond Meat to alter food reports submitted to Don Lee Farms (“Don Lee”) to exclude pertinent safety information; wrongfully terminate Beyond Meat’s exclusive supply agreement with Don Lee; misappropriate Don Lee’s trade secrets with two other manufacturers, ProPortion Foods, LLC and CLW Foods, LLC; and fail to maintain internal controls. Derivative Plaintiffs also allege in the Consolidated Action that certain of the Individual Defendants made and/or caused the Company to violate Section 14(a) of the Securities Exchange Act of 1934 (“Exchange Act”) by making and/or causing the Company to make false and misleading statements and omissions of material fact in the Company’s proxy statement filed on Schedule 14A with the SEC on April 10, 2020, which failed to disclose each of the foregoing.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Why is there a Settlement of the Derivative Actions?","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The Court has not decided in favor of Defendants or Derivative Plaintiffs in the Consolidated Action. Instead, the Settling Parties have agreed to the Settlement to avoid the distraction, costs, and risks of further litigation, and because the Company has determined that the corporate governance reforms and procedures that the Company will adopt as part of the Settlement provide substantial benefits to Beyond Meat and its stockholders.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Settling Defendants deny each and every allegation of wrongdoing or liability arising out of or relating in any way to the events, conduct, statements, acts, or omissions alleged in the Derivative Actions. Settling Defendants further assert that, at all times, they acted legally, in good faith, and in a manner they reasonably believed to be and that was in the best interests of Beyond Meat and Beyond Meat’s stockholders. Nonetheless, Settling Defendants have entered into the Stipulation, without admitting or conceding any fault, liability, wrongdoing, or damage whatsoever, in order to avoid the expense, distraction, and uncertainty of litigation.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"The Settlement Hearing, and Your Right to Object to the Settlement","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"On March 31, 2022, the Court entered an order preliminarily approving the Stipulation and the Settlement contemplated therein (the “Preliminary Approval Order”) and providing for notice of the Settlement to be made to Current Beyond Meat Stockholders. The Preliminary Approval Order further provides that the Court will hold a hearing (the “Settlement Hearing”) on July 11, 2022 at 10:00 a.m. (PT) before the Honorable Michael W. Fitzgerald, United States District Court for the Central District of California, First Street Courthouse, 350 West First Street, Courtroom 5A, Los Angeles, CA 90012, to among other things: (i) determine whether the proposed Settlement is fair, reasonable and adequate and in the best interests of the Company and its stockholders; (ii) consider any objections to the Settlement submitted in accordance with this Notice; (iii) determine whether a judgment should be entered dismissing all claims in the Consolidated Action with prejudice, and releasing the Released Claims against the Released Persons; (iv) determine whether any negotiated attorneys’ fees and expense amount to Plaintiffs’ Counsel is fair, reasonable and adequate or, if the Settling Parties have not agreed to any such amount, the appropriate amount for an attorneys’ fee and expense award to Plaintiffs’ Counsel or consideration of an amount determined by an agreed-upon mediator, as applicable; (v) whether the Court should approve the Service Awards, to be paid out of any attorneys’ fees and expense award; and (vi) consider any other matters that may properly be brought before the Court in connection with the Settlement.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"The Court may, in its discretion, change the date and/or time of the Settlement Hearing without further notice to you. The Court also has reserved the right to hold the Settlement Hearing telephonically or by videoconference without further notice to you. If you intend to attend the Settlement Hearing, please consult the Court’s calendar and/or the website of Beyond Meat, ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=qjO29gmERXnVgKXJQR7HUQ-DYptPcMd8Go838uPXoCjW1J365v7NZwsYwazlRad96vxUpHcBKwxocf8GLMk_XQUWo8aZlRGBxuGN__A-7fi9lTpCKlQrhHrqf7UPVIBt","contentObject":[{"type":"text","content":"https://investors.beyondmeat.com/","gated":false}],"gated":false},{"type":"text","content":" (under the “RESOURCES” tab), for any change in date, time or format of the Settlement Hearing.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Any Current Beyond Meat Stockholder who wishes to object to the fairness, reasonableness, or adequacy of the Settlement as set forth in the Stipulation, or to any agreed-upon Fee and Expense Amount, may file with the Court a written objection. An objector must at least twenty-one (21) calendar days prior to the Settlement Hearing: (1) file with the Clerk of the Court and serve (either by hand delivery or by first class mail) upon the below listed counsel a written objection to the Settlement setting forth (a) the nature of the objection; (b) proof of ownership of Beyond Meat common stock as of January 14, 2022 and through the date of the filing of any such objection, including the number of shares of Beyond Meat common stock held and the date of purchase or acquisition; (c) any and all documentation or evidence in support of such objection; (d) the identities of any cases, by name, court, and docket number, in which the stockholder or his, her, or its attorney has objected to a settlement in the last three years; and (2) if intending to appear, and requesting to be heard, at the Settlement Hearing, he, she, or it must, in addition to the requirements of (1) above, file with the Clerk of the Court and serve (either by hand delivery or by first class mail) upon the below listed counsel (a) a written notice of his, her, or its intention to appear at the Settlement Hearing, (b) a statement that indicates the basis for such appearance, (c) the identities of any witnesses he, she, or it intends to call at the Settlement Hearing and a statement as to the subjects of their testimony, and (d) any and all evidence that would be presented at the Settlement Hearing. Any objector who does not timely file and serve a notice of intention to appear in accordance with this paragraph shall be foreclosed from raising any objection to the Settlement and shall not be permitted to appear at the Settlement Hearing, except for good cause shown.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"em","contentObject":[{"type":"text","content":"IF YOU MAKE A WRITTEN OBJECTION, IT MUST BE ON FILE WITH THE CLERK OF THE COURT NO LATER THAN June 20, 2022.","gated":false}],"gated":false},{"type":"text","content":" The Clerk’s address is:","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Clerk of the Court","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"U.S. DISTRICT COURT, CENTRAL DISTRICT OF CALIFORNIA","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"First Street U.S. Courthouse","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"350 A 1st Street, Suite 4311","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Los Angeles, California 90012","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"em","contentObject":[{"type":"text","content":"YOU ALSO MUST DELIVER COPIES OF THE MATERIALS TO PLAINTIFFS’ COUNSEL AND SETTLING DEFENDANTS’ COUNSEL SO THEY ARE RECEIVED NO LATER THAN June 20, 2022.","gated":false}],"gated":false},{"type":"text","content":" Counsel’s addresses are:","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Counsel for Plaintiffs:","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"table","contentObject":[{"type":"tbody","contentObject":[{"type":"tr","contentObject":[{"type":"td","contentObject":[{"type":"text","content":"Timothy Brown","gated":false},{"type":"br","gated":false},{"type":"text","content":"THE BROWN LAW FIRM, P.C.","gated":false},{"type":"br","gated":false},{"type":"text","content":"767 Third Avenue, Suite 2501","gated":false},{"type":"br","gated":false},{"type":"text","content":"New York, NY 10017 ","gated":false},{"type":"br","gated":false},{"type":"br","gated":false},{"type":"text","content":"Thomas J. McKenna","gated":false},{"type":"br","gated":false},{"type":"text","content":"GAINEY McKENNA & EGLESTON","gated":false},{"type":"br","gated":false},{"type":"text","content":"501 Fifth Avenue, 19th Floor","gated":false},{"type":"br","gated":false},{"type":"text","content":"New York, NY 10017","gated":false},{"type":"br","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"td","contentObject":[{"type":"text","content":"Phillip Kim","gated":false},{"type":"br","gated":false},{"type":"text","content":"THE ROSEN LAW FIRM, P.A.","gated":false},{"type":"br","gated":false},{"type":"text","content":"275 Madison Avenue, 40th Floor","gated":false},{"type":"br","gated":false},{"type":"text","content":"New York, NY 10016","gated":false},{"type":"br","gated":false},{"type":"br","gated":false},{"type":"br","gated":false},{"type":"br","gated":false},{"type":"br","gated":false},{"type":"br","gated":false}],"gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Counsel for Settling Defendants:","gated":false}],"gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"table","contentObject":[{"type":"tbody","contentObject":[{"type":"tr","contentObject":[{"type":"td","contentObject":[{"type":"text","content":"B. John Casey","gated":false},{"type":"br","gated":false},{"type":"text","content":"STOEL RIVES LLP","gated":false},{"type":"br","gated":false},{"type":"text","content":"760 SW Ninth Avenue, Suite 3000","gated":false},{"type":"br","gated":false},{"type":"text","content":"Portland, OR 97205","gated":false},{"type":"br","gated":false},{"type":"br","gated":false}],"gated":false},{"type":"td","contentObject":[{"type":"text","content":" ","gated":false}],"gated":false}],"gated":false}],"gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"An objector may file an objection on his, her, or its own or through an attorney hired at his, her, or its own expense. If an objector hires an attorney to represent him, her, or it for the purposes of making such objection, the attorney must serve (either by hand delivery or by first class mail) a notice of appearance on the counsel listed above and file such notice with the Court no later than twenty-one (21) calendar days before the Settlement Hearing. Any Current Beyond Meat Stockholder who does not timely file and serve a written objection complying with the above terms shall be deemed to have waived, and shall be foreclosed from raising, any objection to the Settlement, and any untimely objection shall be barred.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Any objector who files and serves a timely, written objection in accordance with the instructions above, may appear at the Settlement Hearing either in person or through counsel retained at the objector’s expense. Objectors need not attend the Settlement Hearing, however, in order to have their objections considered by the Court.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"If you are a Current Beyond Meat Stockholder and do not take steps to appear in this action and object to the proposed Settlement, you will be bound by the Judgment of the Court and will forever be barred from raising an objection to the settlement in this Consolidated Action, and from pursuing any of the Released Claims.   ","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"CURRENT BEYOND MEAT STOCKHOLDERS AS OF JANUARY 14, 2022 WHO HAVE NO OBJECTION TO THE SETTLEMENT DO NOT NEED TO APPEAR AT THE SETTLEMENT HEARING OR TAKE ANY OTHER ACTION.","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Interim Stay and Injunction","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"Pending the Court’s determination as to final approval of the Settlement, Plaintiffs and Plaintiffs’ Counsel, and any Beyond Meat stockholders, derivatively on behalf of Beyond Meat, are barred and enjoined from commencing, prosecuting, instigating, or in any way participating in the commencement or prosecution of any action asserting any Released Claims derivatively against any of the Released Persons in any court or tribunal.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"u","contentObject":[{"type":"text","content":"Scope of the Notice","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"This Notice is a summary description of the Derivative Actions, the complaints, the terms of the Settlement, and the Settlement Hearing. For a more detailed statement of the matters involved in the Derivative Actions, reference is made to the Stipulation and its exhibits, copies of which may be reviewed and downloaded at the website of Beyond Meat, ","gated":false},{"type":"a","href":"https://www.globenewswire.com/Tracker?data=qjO29gmERXnVgKXJQR7HUQ-DYptPcMd8Go838uPXoCjIf7hamn8A7O8ahjQCZV0CkBJauGDiYxDJMMEY-3DiX6Qx1FoJoioFEDAS864-IvAGCsrYACKiTOts3wuTr-7Y","contentObject":[{"type":"text","content":"https://investors.beyondmeat.com/","gated":false}],"gated":false},{"type":"text","content":" (under the “RESOURCES” tab).","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"*        *        *","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"You may obtain further information by contacting Plaintiffs’ Counsel at: Timothy Brown, The Brown Law Firm, P.C., 767 Third Avenue, Suite 2501, New York, NY, 10017, Telephone: (516) 922-5427, E-mail: tbrown@thebrownlawfirm.net; or Thomas J. McKenna, Gainey McKenna & Egleston, 501 Fifth Avenue, 19th Floor, New York, NY 10017, Telephone: (212) 983-1300, E-mail: tjmckenna@gme-law.com; or Phillip Kim, The Rosen Law Firm, P.A., 275 Madison Avenue, 40th Floor, New York, NY 10016, Telephone: (212) 686-1060, E-mail: pkim@rosenlegal.com.","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"PLEASE DO NOT CALL, WRITE, OR OTHERWISE DIRECT QUESTIONS TO EITHER THE COURT OR THE CLERK’S OFFICE REGARDING THIS NOTICE.","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Contacts","gated":false}],"gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Media:","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Shira Zackai","gated":false},{"type":"br","gated":false},{"type":"text","content":"shira.zackai@beyondmeat.com","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"strong","contentObject":[{"type":"text","content":"Investors:","gated":false}],"gated":false},{"type":"br","gated":false},{"type":"text","content":"Fitzhugh Taylor and Raphael Gross","gated":false},{"type":"br","gated":false},{"type":"text","content":"beyondmeat@icrinc.com","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"text","content":"_________________________","gated":false}],"gated":false},{"type":"text","content":"  ","gated":false},{"type":"p","contentObject":[{"type":"sup","contentObject":[{"type":"text","content":"1","gated":false}],"gated":false},{"type":"text","content":" All capitalized terms used in this notice, unless otherwise defined herein, are defined as set forth in the Stipulation.","gated":false}],"gated":false},{"type":"text","content":" ","gated":false},{"type":"img","src":"https://www.globenewswire.com/newsroom/ti?nf=ODUxOTMyNyM0ODQzMTQxIzIxMjQ2MDk=","alt":"","variations":[],"gated":false},{"type":"text","content":" ","gated":false},{"type":"br","gated":false},{"type":"img","src":"https://ml.globenewswire.com/media/MWJlMjE0MWEtNmQwMC00NDgyLTkxZGMtMDkwMzhmMGU5OGRlLTExMzYxODA=/tiny/Beyond-Meat-Inc-.png","alt":"","variations":[],"gated":false},{"type":"p","contentObject":[{"type":"a","href":"https://www.globenewswire.com/NewsRoom/AttachmentNg/2fd5b30f-49db-45f5-9420-bdaccbecfe0c","contentObject":[{"type":"img","src":"https://ml.globenewswire.com/media/2fd5b30f-49db-45f5-9420-bdaccbecfe0c/small/beyondmeatlogo-newvisid-primary-greenblack-rgb-1-png.png","alt":"Primary Logo","variations":[],"gated":false}],"gated":false}],"gated":false}]}