{"id":"20220518327","sourceId":"marketwatch","sourceName":"MarketWatch","providerName":"Dow Jones","title":"TJX profit beats expectations, but revenue falls short","publishedDate":"2022-05-18T06:54:00-05:00","body":[{"type":"p","contentObject":[{"type":"text","content":"\n  TJX Cos. (TJX) stock rose 2.7% in Wednesday premarket trading after it reported fiscal first-quarter profit that beat expectations. The off-price retailer posted net income totaling $587.5 million, or 49 cents per share, up from $533.9 million, or 26 cents per share, last year. Adjusted EPS of 68 cents beat the FactSet consensus for 60 cents. Sales of $11.406 billion were up from $10.087 billion last year and below the FactSet consensus for $11.586 billion. The company reported flat U.S. same-store sales with Marmaxx up 3% and the HomeGoods division down 7%. TJX banners include HomeGoods, TJ Maxx and Marshalls. Marmaxx's same-store sales increase was driven by customer traffic, Chief Executive Ernie Herrman said in a statement. For the second quarter, TJX is guiding for a U.S. same-store sales decline of 1% to 3% and EPS of 65 cents to 69 cents. The FactSet consensus is for EPS of 75 cents. For the full fiscal year, the company is guiding for U.S. same-store sales growth of 1% to 2%, EPS in the range of $2.94 to $3.01 and adjusted EPS in the range of $3.13 to $3.20. The FactSet consensus is for EPS of $3.16. TJX stock is down 26% for the year to date while the S&P 500 index  is down 14.2% for the period. ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  -Tonya Garcia ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"pre","contentObject":[{"type":"text","content":"\n ","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  (END) Dow Jones Newswires","gated":false}],"gated":false},{"type":"text","content":"\n","gated":false},{"type":"p","contentObject":[{"type":"text","content":"\n  05-18-22 0754ET","gated":false}],"gated":false},{"type":"text","content":"\n\nCopyright (c) 2022 Dow Jones & Company, Inc.","gated":false}]}